luckycyang/mspm0l1306-dev/include/ti/devices/msp/peripherals/hw_gpio.h
/*****************************************************************************

  Copyright (C) 2023 Texas Instruments Incorporated - http://www.ti.com/

  Redistribution and use in source and binary forms, with or without
  modification, are permitted provided that the following conditions
  are met:

   Redistributions of source code must retain the above copyright
   notice, this list of conditions and the following disclaimer.

   Redistributions in binary form must reproduce the above copyright
   notice, this list of conditions and the following disclaimer in the
   documentation and/or other materials provided with the
   distribution.

   Neither the name of Texas Instruments Incorporated nor the names of
   its contributors may be used to endorse or promote products derived
   from this software without specific prior written permission.

  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT
  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.

*****************************************************************************/

#ifndef ti_devices_msp_peripherals_hw_gpio__include
#define ti_devices_msp_peripherals_hw_gpio__include

/* Filename: hw_gpio.h */
/* Revised: 2023-05-10 21:28:12 */
/* Revision: 63b77c412ca552f19fdd3e7971450ee8560270af */

#ifndef __CORTEX_M
#ifdef __cplusplus
#define __I volatile /*!< Defines 'read only' permissions */
#else
#define __I volatile const /*!< Defines 'read only' permissions */
#endif
#define __O volatile  /*!< Defines 'write only' permissions */
#define __IO volatile /*!< Defines 'read / write' permissions */

/* following defines should be used for structure members */
#define __IM                                                                   \
  volatile const      /*! Defines 'read only' structure member permissions */
#define __OM volatile /*! Defines 'write only' structure member permissions */
#define __IOM                                                                  \
  volatile /*! Defines 'read / write' structure member permissions */
#endif

/* Use standard integer types with explicit width */
#include <stdint.h>

#ifdef __cplusplus
extern "C" {
#endif

#if defined(__CC_ARM)
#pragma anon_unions
#endif

/******************************************************************************
 * GPIO Registers
 ******************************************************************************/
#define GPIO_GEN_EVENT1_OFS ((uint32_t)0x00001080U)
#define GPIO_GEN_EVENT0_OFS ((uint32_t)0x00001050U)
#define GPIO_CPU_INT_OFS ((uint32_t)0x00001020U)
#define GPIO_GPRCM_OFS ((uint32_t)0x00000800U)

/** @addtogroup GPIO_GEN_EVENT1
  @{
*/

typedef struct {
  __I uint32_t IIDX; /* !< (@ 0x00001080) Interrupt index */
  uint32_t RESERVED0;
  __IO uint32_t IMASK; /* !< (@ 0x00001088) Interrupt mask */
  uint32_t RESERVED1;
  __I uint32_t RIS; /* !< (@ 0x00001090) Raw interrupt status */
  uint32_t RESERVED2;
  __I uint32_t MIS; /* !< (@ 0x00001098) Masked interrupt status */
  uint32_t RESERVED3;
  __O uint32_t ISET; /* !< (@ 0x000010A0) Interrupt set */
  uint32_t RESERVED4;
  __O uint32_t ICLR; /* !< (@ 0x000010A8) Interrupt clear */
} GPIO_GEN_EVENT1_Regs;

/*@}*/ /* end of group GPIO_GEN_EVENT1 */

/** @addtogroup GPIO_GEN_EVENT0
  @{
*/

typedef struct {
  __I uint32_t IIDX; /* !< (@ 0x00001050) Interrupt index */
  uint32_t RESERVED0;
  __IO uint32_t IMASK; /* !< (@ 0x00001058) Interrupt mask */
  uint32_t RESERVED1;
  __I uint32_t RIS; /* !< (@ 0x00001060) Raw interrupt status */
  uint32_t RESERVED2;
  __I uint32_t MIS; /* !< (@ 0x00001068) Masked interrupt status */
  uint32_t RESERVED3;
  __O uint32_t ISET; /* !< (@ 0x00001070) Interrupt set */
  uint32_t RESERVED4;
  __O uint32_t ICLR; /* !< (@ 0x00001078) Interrupt clear */
} GPIO_GEN_EVENT0_Regs;

/*@}*/ /* end of group GPIO_GEN_EVENT0 */

/** @addtogroup GPIO_CPU_INT
  @{
*/

typedef struct {
  __I uint32_t IIDX; /* !< (@ 0x00001020) Interrupt index */
  uint32_t RESERVED0;
  __IO uint32_t IMASK; /* !< (@ 0x00001028) Interrupt mask */
  uint32_t RESERVED1;
  __I uint32_t RIS; /* !< (@ 0x00001030) Raw interrupt status */
  uint32_t RESERVED2;
  __I uint32_t MIS; /* !< (@ 0x00001038) Masked interrupt status */
  uint32_t RESERVED3;
  __O uint32_t ISET; /* !< (@ 0x00001040) Interrupt set */
  uint32_t RESERVED4;
  __O uint32_t ICLR; /* !< (@ 0x00001048) Interrupt clear */
} GPIO_CPU_INT_Regs;

/*@}*/ /* end of group GPIO_CPU_INT */

/** @addtogroup GPIO_GPRCM
  @{
*/

typedef struct {
  __IO uint32_t PWREN; /* !< (@ 0x00000800) Power enable */
  __O uint32_t RSTCTL; /* !< (@ 0x00000804) Reset Control */
  uint32_t RESERVED0[3];
  __I uint32_t STAT; /* !< (@ 0x00000814) Status Register */
} GPIO_GPRCM_Regs;

/*@}*/ /* end of group GPIO_GPRCM */

/** @addtogroup GPIO
  @{
*/

typedef struct {
  uint32_t RESERVED0[256];
  __IO uint32_t FSUB_0; /* !< (@ 0x00000400) Subsciber Port 0 */
  __IO uint32_t FSUB_1; /* !< (@ 0x00000404) Subscriber Port 1 */
  uint32_t RESERVED1[15];
  __IO uint32_t FPUB_0; /* !< (@ 0x00000444) Publisher Port 0 */
  __IO uint32_t FPUB_1; /* !< (@ 0x00000448) Publisher Port 1 */
  uint32_t RESERVED2[237];
  GPIO_GPRCM_Regs GPRCM; /* !< (@ 0x00000800) */
  uint32_t RESERVED3[510];
  __IO uint32_t CLKOVR; /* !< (@ 0x00001010) Clock Override */
  uint32_t RESERVED4;
  __IO uint32_t PDBGCTL; /* !< (@ 0x00001018) Peripheral Debug Control */
  uint32_t RESERVED5;
  GPIO_CPU_INT_Regs CPU_INT; /* !< (@ 0x00001020) */
  uint32_t RESERVED6;
  GPIO_GEN_EVENT0_Regs GEN_EVENT0; /* !< (@ 0x00001050) */
  uint32_t RESERVED7;
  GPIO_GEN_EVENT1_Regs GEN_EVENT1; /* !< (@ 0x00001080) */
  uint32_t RESERVED8[13];
  __IO uint32_t EVT_MODE; /* !< (@ 0x000010E0) Event Mode */
  uint32_t RESERVED9[6];
  __I uint32_t DESC; /* !< (@ 0x000010FC) Module Description */
  uint32_t RESERVED10[64];
  __O uint32_t DOUT3_0;   /* !< (@ 0x00001200) Data output 3 to 0 */
  __O uint32_t DOUT7_4;   /* !< (@ 0x00001204) Data output 7 to 4 */
  __O uint32_t DOUT11_8;  /* !< (@ 0x00001208) Data output 11 to 8 */
  __O uint32_t DOUT15_12; /* !< (@ 0x0000120C) Data output 15 to 12 */
  __O uint32_t DOUT19_16; /* !< (@ 0x00001210) Data output 19 to 16 */
  __O uint32_t DOUT23_20; /* !< (@ 0x00001214) Data output 23 to 20 */
  __O uint32_t DOUT27_24; /* !< (@ 0x00001218) Data output 27 to 24 */
  __O uint32_t DOUT31_28; /* !< (@ 0x0000121C) Data output 31 to 28 */
  uint32_t RESERVED11[24];
  __IO uint32_t DOUT31_0; /* !< (@ 0x00001280) Data output 31 to 0 */
  uint32_t RESERVED12[3];
  __O uint32_t DOUTSET31_0; /* !< (@ 0x00001290) Data output set 31 to 0 */
  uint32_t RESERVED13[3];
  __O uint32_t DOUTCLR31_0; /* !< (@ 0x000012A0) Data output clear 31 to 0 */
  uint32_t RESERVED14[3];
  __O uint32_t DOUTTGL31_0; /* !< (@ 0x000012B0) Data output toggle 31 to 0 */
  uint32_t RESERVED15[3];
  __IO uint32_t DOE31_0; /* !< (@ 0x000012C0) Data output enable 31 to 0 */
  uint32_t RESERVED16[3];
  __O uint32_t
      DOESET31_0; /* !< (@ 0x000012D0) Data output enable set 31 to 0 */
  uint32_t RESERVED17[3];
  __O uint32_t
      DOECLR31_0; /* !< (@ 0x000012E0) Data output enable clear 31 to 0 */
  uint32_t RESERVED18[7];
  __I uint32_t DIN3_0;   /* !< (@ 0x00001300) Data input 3 to 0 */
  __I uint32_t DIN7_4;   /* !< (@ 0x00001304) Data input 7 to 4 */
  __I uint32_t DIN11_8;  /* !< (@ 0x00001308) Data input 11 to 8 */
  __I uint32_t DIN15_12; /* !< (@ 0x0000130C) Data input 15 to 12 */
  __I uint32_t DIN19_16; /* !< (@ 0x00001310) Data input 19 to 16 */
  __I uint32_t DIN23_20; /* !< (@ 0x00001314) Data input 23 to 20 */
  __I uint32_t DIN27_24; /* !< (@ 0x00001318) Data input 27 to 24 */
  __I uint32_t DIN31_28; /* !< (@ 0x0000131C) Data input 31 to 28 */
  uint32_t RESERVED19[24];
  __I uint32_t DIN31_0; /* !< (@ 0x00001380) Data input 31 to 0 */
  uint32_t RESERVED20[3];
  __IO uint32_t POLARITY15_0; /* !< (@ 0x00001390) Polarity 15 to 0 */
  uint32_t RESERVED21[3];
  __IO uint32_t POLARITY31_16; /* !< (@ 0x000013A0) Polarity 31 to 16 */
  uint32_t RESERVED22[23];
  __IO uint32_t CTL;      /* !< (@ 0x00001400) FAST WAKE GLOBAL EN */
  __IO uint32_t FASTWAKE; /* !< (@ 0x00001404) FAST WAKE ENABLE */
  uint32_t RESERVED23[62];
  __IO uint32_t SUB0CFG; /* !< (@ 0x00001500) Subscriber 0 configuration */
  uint32_t RESERVED24;
  __IO uint32_t FILTEREN15_0;  /* !< (@ 0x00001508) Filter Enable 15 to 0 */
  __IO uint32_t FILTEREN31_16; /* !< (@ 0x0000150C) Filter Enable 31 to 16 */
  __IO uint32_t DMAMASK;       /* !< (@ 0x00001510) DMA Write MASK */
  uint32_t RESERVED25[3];
  __IO uint32_t SUB1CFG; /* !< (@ 0x00001520) Subscriber 1 configuration */
} GPIO_Regs;

/*@}*/ /* end of group GPIO */

#if defined(__CC_ARM)
#pragma no_anon_unions
#endif

