luckycyang/mspm0l1306-dev/include/ti/devices/msp/peripherals/hw_gpio.h
/******************************************************************************
 * GPIO Register Control Bits
 ******************************************************************************/

/* GPIO_GEN_EVENT1_IIDX Bits */
/* GPIO_GEN_EVENT1_IIDX[STAT] Bits */
#define GPIO_GEN_EVENT1_IIDX_STAT_OFS (0) /* !< STAT Offset */
#define GPIO_GEN_EVENT1_IIDX_STAT_MASK                                         \
  ((uint32_t)0x000000FFU) /* !< Interrupt index status */
#define GPIO_GEN_EVENT1_IIDX_STAT_NO_INTR                                      \
  ((uint32_t)0x00000000U) /* !< No bit is set means there is no                \
                             pending interrupt request */
#define GPIO_GEN_EVENT1_IIDX_STAT_DIO16                                        \
  ((uint32_t)0x00000001U) /* !< DIO0 interrupt */
#define GPIO_GEN_EVENT1_IIDX_STAT_DIO17                                        \
  ((uint32_t)0x00000002U) /* !< DIO1 interrupt */
#define GPIO_GEN_EVENT1_IIDX_STAT_DIO18                                        \
  ((uint32_t)0x00000003U) /* !< DIO2 interrupt */
#define GPIO_GEN_EVENT1_IIDX_STAT_DIO19                                        \
  ((uint32_t)0x00000004U) /* !< DIO3 interrupt */
#define GPIO_GEN_EVENT1_IIDX_STAT_DIO20                                        \
  ((uint32_t)0x00000005U) /* !< DIO4 interrupt */
#define GPIO_GEN_EVENT1_IIDX_STAT_DIO21                                        \
  ((uint32_t)0x00000006U) /* !< DIO5 interrupt */
#define GPIO_GEN_EVENT1_IIDX_STAT_DIO22                                        \
  ((uint32_t)0x00000007U) /* !< DIO6 interrupt */
#define GPIO_GEN_EVENT1_IIDX_STAT_DIO23                                        \
  ((uint32_t)0x00000008U) /* !< DIO7 interrupt */
#define GPIO_GEN_EVENT1_IIDX_STAT_DIO24                                        \
  ((uint32_t)0x00000009U) /* !< DIO8 interrupt */
#define GPIO_GEN_EVENT1_IIDX_STAT_DIO25                                        \
  ((uint32_t)0x0000000AU) /* !< DIO9 interrupt */
#define GPIO_GEN_EVENT1_IIDX_STAT_DIO26                                        \
  ((uint32_t)0x0000000BU) /* !< DIO10 interrupt */
#define GPIO_GEN_EVENT1_IIDX_STAT_DIO27                                        \
  ((uint32_t)0x0000000CU) /* !< DIO11 interrupt */
#define GPIO_GEN_EVENT1_IIDX_STAT_DIO28                                        \
  ((uint32_t)0x0000000DU) /* !< DIO12 interrupt */
#define GPIO_GEN_EVENT1_IIDX_STAT_DIO29                                        \
  ((uint32_t)0x0000000EU) /* !< DIO13 interrupt */
#define GPIO_GEN_EVENT1_IIDX_STAT_DIO30                                        \
  ((uint32_t)0x0000000FU) /* !< DIO14 interrupt */
#define GPIO_GEN_EVENT1_IIDX_STAT_DIO31                                        \
  ((uint32_t)0x00000010U) /* !< DIO15 interrupt */

/* GPIO_GEN_EVENT1_IMASK Bits */
/* GPIO_GEN_EVENT1_IMASK[DIO16] Bits */
#define GPIO_GEN_EVENT1_IMASK_DIO16_OFS (16) /* !< DIO16 Offset */
#define GPIO_GEN_EVENT1_IMASK_DIO16_MASK                                       \
  ((uint32_t)0x00010000U) /* !< DIO16 event mask */
#define GPIO_GEN_EVENT1_IMASK_DIO16_CLR                                        \
  ((uint32_t)0x00000000U) /* !< Event is masked */
#define GPIO_GEN_EVENT1_IMASK_DIO16_SET                                        \
  ((uint32_t)0x00010000U) /* !< Event is unmasked */
/* GPIO_GEN_EVENT1_IMASK[DIO17] Bits */
#define GPIO_GEN_EVENT1_IMASK_DIO17_OFS (17) /* !< DIO17 Offset */
#define GPIO_GEN_EVENT1_IMASK_DIO17_MASK                                       \
  ((uint32_t)0x00020000U) /* !< DIO17 event mask */
#define GPIO_GEN_EVENT1_IMASK_DIO17_CLR                                        \
  ((uint32_t)0x00000000U) /* !< Event is masked */
#define GPIO_GEN_EVENT1_IMASK_DIO17_SET                                        \
  ((uint32_t)0x00020000U) /* !< Event is unmasked */
/* GPIO_GEN_EVENT1_IMASK[DIO18] Bits */
#define GPIO_GEN_EVENT1_IMASK_DIO18_OFS (18) /* !< DIO18 Offset */
#define GPIO_GEN_EVENT1_IMASK_DIO18_MASK                                       \
  ((uint32_t)0x00040000U) /* !< DIO18 event mask */
#define GPIO_GEN_EVENT1_IMASK_DIO18_CLR                                        \
  ((uint32_t)0x00000000U) /* !< Event is masked */
#define GPIO_GEN_EVENT1_IMASK_DIO18_SET                                        \
  ((uint32_t)0x00040000U) /* !< Event is unmasked */
/* GPIO_GEN_EVENT1_IMASK[DIO19] Bits */
#define GPIO_GEN_EVENT1_IMASK_DIO19_OFS (19) /* !< DIO19 Offset */
#define GPIO_GEN_EVENT1_IMASK_DIO19_MASK                                       \
  ((uint32_t)0x00080000U) /* !< DIO19 event mask */
#define GPIO_GEN_EVENT1_IMASK_DIO19_CLR                                        \
  ((uint32_t)0x00000000U) /* !< Event is masked */
#define GPIO_GEN_EVENT1_IMASK_DIO19_SET                                        \
  ((uint32_t)0x00080000U) /* !< Event is unmasked */
/* GPIO_GEN_EVENT1_IMASK[DIO20] Bits */
#define GPIO_GEN_EVENT1_IMASK_DIO20_OFS (20) /* !< DIO20 Offset */
#define GPIO_GEN_EVENT1_IMASK_DIO20_MASK                                       \
  ((uint32_t)0x00100000U) /* !< DIO20 event mask */
#define GPIO_GEN_EVENT1_IMASK_DIO20_CLR                                        \
  ((uint32_t)0x00000000U) /* !< Event is masked */
#define GPIO_GEN_EVENT1_IMASK_DIO20_SET                                        \
  ((uint32_t)0x00100000U) /* !< Event is unmasked */
/* GPIO_GEN_EVENT1_IMASK[DIO21] Bits */
#define GPIO_GEN_EVENT1_IMASK_DIO21_OFS (21) /* !< DIO21 Offset */
#define GPIO_GEN_EVENT1_IMASK_DIO21_MASK                                       \
  ((uint32_t)0x00200000U) /* !< DIO21 event mask */
#define GPIO_GEN_EVENT1_IMASK_DIO21_CLR                                        \
  ((uint32_t)0x00000000U) /* !< Event is masked */
#define GPIO_GEN_EVENT1_IMASK_DIO21_SET                                        \
  ((uint32_t)0x00200000U) /* !< Event is unmasked */
/* GPIO_GEN_EVENT1_IMASK[DIO22] Bits */
#define GPIO_GEN_EVENT1_IMASK_DIO22_OFS (22) /* !< DIO22 Offset */
#define GPIO_GEN_EVENT1_IMASK_DIO22_MASK                                       \
  ((uint32_t)0x00400000U) /* !< DIO22 event mask */
#define GPIO_GEN_EVENT1_IMASK_DIO22_CLR                                        \
  ((uint32_t)0x00000000U) /* !< Event is masked */
#define GPIO_GEN_EVENT1_IMASK_DIO22_SET                                        \
  ((uint32_t)0x00400000U) /* !< Event is unmasked */
/* GPIO_GEN_EVENT1_IMASK[DIO23] Bits */
#define GPIO_GEN_EVENT1_IMASK_DIO23_OFS (23) /* !< DIO23 Offset */
#define GPIO_GEN_EVENT1_IMASK_DIO23_MASK                                       \
  ((uint32_t)0x00800000U) /* !< DIO23 event mask */
#define GPIO_GEN_EVENT1_IMASK_DIO23_CLR                                        \
  ((uint32_t)0x00000000U) /* !< Event is masked */
#define GPIO_GEN_EVENT1_IMASK_DIO23_SET                                        \
  ((uint32_t)0x00800000U) /* !< Event is unmasked */
/* GPIO_GEN_EVENT1_IMASK[DIO24] Bits */
#define GPIO_GEN_EVENT1_IMASK_DIO24_OFS (24) /* !< DIO24 Offset */
#define GPIO_GEN_EVENT1_IMASK_DIO24_MASK                                       \
  ((uint32_t)0x01000000U) /* !< DIO24 event mask */
#define GPIO_GEN_EVENT1_IMASK_DIO24_CLR                                        \
  ((uint32_t)0x00000000U) /* !< Event is masked */
#define GPIO_GEN_EVENT1_IMASK_DIO24_SET                                        \
  ((uint32_t)0x01000000U) /* !< Event is unmasked */
/* GPIO_GEN_EVENT1_IMASK[DIO25] Bits */
#define GPIO_GEN_EVENT1_IMASK_DIO25_OFS (25) /* !< DIO25 Offset */
#define GPIO_GEN_EVENT1_IMASK_DIO25_MASK                                       \
  ((uint32_t)0x02000000U) /* !< DIO25 event mask */
#define GPIO_GEN_EVENT1_IMASK_DIO25_CLR                                        \
  ((uint32_t)0x00000000U) /* !< Event is masked */
#define GPIO_GEN_EVENT1_IMASK_DIO25_SET                                        \
  ((uint32_t)0x02000000U) /* !< Event is unmasked */
/* GPIO_GEN_EVENT1_IMASK[DIO26] Bits */
#define GPIO_GEN_EVENT1_IMASK_DIO26_OFS (26) /* !< DIO26 Offset */
#define GPIO_GEN_EVENT1_IMASK_DIO26_MASK                                       \
  ((uint32_t)0x04000000U) /* !< DIO26 event mask */
#define GPIO_GEN_EVENT1_IMASK_DIO26_CLR                                        \
  ((uint32_t)0x00000000U) /* !< Event is masked */
#define GPIO_GEN_EVENT1_IMASK_DIO26_SET                                        \
  ((uint32_t)0x04000000U) /* !< Event is unmasked */
/* GPIO_GEN_EVENT1_IMASK[DIO27] Bits */
#define GPIO_GEN_EVENT1_IMASK_DIO27_OFS (27) /* !< DIO27 Offset */
#define GPIO_GEN_EVENT1_IMASK_DIO27_MASK                                       \
  ((uint32_t)0x08000000U) /* !< DIO27 event mask */
#define GPIO_GEN_EVENT1_IMASK_DIO27_CLR                                        \
  ((uint32_t)0x00000000U) /* !< Event is masked */
#define GPIO_GEN_EVENT1_IMASK_DIO27_SET                                        \
  ((uint32_t)0x08000000U) /* !< Event is unmasked */
/* GPIO_GEN_EVENT1_IMASK[DIO28] Bits */
#define GPIO_GEN_EVENT1_IMASK_DIO28_OFS (28) /* !< DIO28 Offset */
#define GPIO_GEN_EVENT1_IMASK_DIO28_MASK                                       \
  ((uint32_t)0x10000000U) /* !< DIO28 event mask */
#define GPIO_GEN_EVENT1_IMASK_DIO28_CLR                                        \
  ((uint32_t)0x00000000U) /* !< Event is masked */
#define GPIO_GEN_EVENT1_IMASK_DIO28_SET                                        \
  ((uint32_t)0x10000000U) /* !< Event is unmasked */
/* GPIO_GEN_EVENT1_IMASK[DIO29] Bits */
#define GPIO_GEN_EVENT1_IMASK_DIO29_OFS (29) /* !< DIO29 Offset */
#define GPIO_GEN_EVENT1_IMASK_DIO29_MASK                                       \
  ((uint32_t)0x20000000U) /* !< DIO29 event mask */
#define GPIO_GEN_EVENT1_IMASK_DIO29_CLR                                        \
  ((uint32_t)0x00000000U) /* !< Event is masked */
#define GPIO_GEN_EVENT1_IMASK_DIO29_SET                                        \
  ((uint32_t)0x20000000U) /* !< Event is unmasked */
/* GPIO_GEN_EVENT1_IMASK[DIO30] Bits */
#define GPIO_GEN_EVENT1_IMASK_DIO30_OFS (30) /* !< DIO30 Offset */
#define GPIO_GEN_EVENT1_IMASK_DIO30_MASK                                       \
  ((uint32_t)0x40000000U) /* !< DIO30 event mask */
#define GPIO_GEN_EVENT1_IMASK_DIO30_CLR                                        \
  ((uint32_t)0x00000000U) /* !< Event is masked */
#define GPIO_GEN_EVENT1_IMASK_DIO30_SET                                        \
  ((uint32_t)0x40000000U) /* !< Event is unmasked */
/* GPIO_GEN_EVENT1_IMASK[DIO31] Bits */
#define GPIO_GEN_EVENT1_IMASK_DIO31_OFS (31) /* !< DIO31 Offset */
#define GPIO_GEN_EVENT1_IMASK_DIO31_MASK                                       \
  ((uint32_t)0x80000000U) /* !< DIO31 event mask */
#define GPIO_GEN_EVENT1_IMASK_DIO31_CLR                                        \
  ((uint32_t)0x00000000U) /* !< Event is masked */
#define GPIO_GEN_EVENT1_IMASK_DIO31_SET                                        \
  ((uint32_t)0x80000000U) /* !< Event is unmasked */

