luckycyang/mspm0l1306-dev/include/ti/devices/msp/peripherals/hw_gpio.h
/* GPIO_GEN_EVENT0_IMASK Bits */
/* GPIO_GEN_EVENT0_IMASK[DIO0] Bits */
#define GPIO_GEN_EVENT0_IMASK_DIO0_OFS (0) /* !< DIO0 Offset */
#define GPIO_GEN_EVENT0_IMASK_DIO0_MASK                                        \
  ((uint32_t)0x00000001U) /* !< DIO0 event mask */
#define GPIO_GEN_EVENT0_IMASK_DIO0_CLR                                         \
  ((uint32_t)0x00000000U) /* !< Event is masked */
#define GPIO_GEN_EVENT0_IMASK_DIO0_SET                                         \
  ((uint32_t)0x00000001U) /* !< Event is unmasked */
/* GPIO_GEN_EVENT0_IMASK[DIO1] Bits */
#define GPIO_GEN_EVENT0_IMASK_DIO1_OFS (1) /* !< DIO1 Offset */
#define GPIO_GEN_EVENT0_IMASK_DIO1_MASK                                        \
  ((uint32_t)0x00000002U) /* !< DIO1 event mask */
#define GPIO_GEN_EVENT0_IMASK_DIO1_CLR                                         \
  ((uint32_t)0x00000000U) /* !< Event is masked */
#define GPIO_GEN_EVENT0_IMASK_DIO1_SET                                         \
  ((uint32_t)0x00000002U) /* !< Event is unmasked */
/* GPIO_GEN_EVENT0_IMASK[DIO2] Bits */
#define GPIO_GEN_EVENT0_IMASK_DIO2_OFS (2) /* !< DIO2 Offset */
#define GPIO_GEN_EVENT0_IMASK_DIO2_MASK                                        \
  ((uint32_t)0x00000004U) /* !< DIO2 event mask */
#define GPIO_GEN_EVENT0_IMASK_DIO2_CLR                                         \
  ((uint32_t)0x00000000U) /* !< Event is masked */
#define GPIO_GEN_EVENT0_IMASK_DIO2_SET                                         \
  ((uint32_t)0x00000004U) /* !< Event is unmasked */
/* GPIO_GEN_EVENT0_IMASK[DIO3] Bits */
#define GPIO_GEN_EVENT0_IMASK_DIO3_OFS (3) /* !< DIO3 Offset */
#define GPIO_GEN_EVENT0_IMASK_DIO3_MASK                                        \
  ((uint32_t)0x00000008U) /* !< DIO3 event mask */
#define GPIO_GEN_EVENT0_IMASK_DIO3_CLR                                         \
  ((uint32_t)0x00000000U) /* !< Event is masked */
#define GPIO_GEN_EVENT0_IMASK_DIO3_SET                                         \
  ((uint32_t)0x00000008U) /* !< Event is unmasked */
/* GPIO_GEN_EVENT0_IMASK[DIO4] Bits */
#define GPIO_GEN_EVENT0_IMASK_DIO4_OFS (4) /* !< DIO4 Offset */
#define GPIO_GEN_EVENT0_IMASK_DIO4_MASK                                        \
  ((uint32_t)0x00000010U) /* !< DIO4 event mask */
#define GPIO_GEN_EVENT0_IMASK_DIO4_CLR                                         \
  ((uint32_t)0x00000000U) /* !< Event is masked */
#define GPIO_GEN_EVENT0_IMASK_DIO4_SET                                         \
  ((uint32_t)0x00000010U) /* !< Event is unmasked */
/* GPIO_GEN_EVENT0_IMASK[DIO5] Bits */
#define GPIO_GEN_EVENT0_IMASK_DIO5_OFS (5) /* !< DIO5 Offset */
#define GPIO_GEN_EVENT0_IMASK_DIO5_MASK                                        \
  ((uint32_t)0x00000020U) /* !< DIO5 event mask */
#define GPIO_GEN_EVENT0_IMASK_DIO5_CLR                                         \
  ((uint32_t)0x00000000U) /* !< Event is masked */
#define GPIO_GEN_EVENT0_IMASK_DIO5_SET                                         \
  ((uint32_t)0x00000020U) /* !< Event is unmasked */
/* GPIO_GEN_EVENT0_IMASK[DIO6] Bits */
#define GPIO_GEN_EVENT0_IMASK_DIO6_OFS (6) /* !< DIO6 Offset */
#define GPIO_GEN_EVENT0_IMASK_DIO6_MASK                                        \
  ((uint32_t)0x00000040U) /* !< DIO6 event mask */
#define GPIO_GEN_EVENT0_IMASK_DIO6_CLR                                         \
  ((uint32_t)0x00000000U) /* !< Event is masked */
#define GPIO_GEN_EVENT0_IMASK_DIO6_SET                                         \
  ((uint32_t)0x00000040U) /* !< Event is unmasked */
/* GPIO_GEN_EVENT0_IMASK[DIO7] Bits */
#define GPIO_GEN_EVENT0_IMASK_DIO7_OFS (7) /* !< DIO7 Offset */
#define GPIO_GEN_EVENT0_IMASK_DIO7_MASK                                        \
  ((uint32_t)0x00000080U) /* !< DIO7 event mask */
#define GPIO_GEN_EVENT0_IMASK_DIO7_CLR                                         \
  ((uint32_t)0x00000000U) /* !< Event is masked */
#define GPIO_GEN_EVENT0_IMASK_DIO7_SET                                         \
  ((uint32_t)0x00000080U) /* !< Event is unmasked */
/* GPIO_GEN_EVENT0_IMASK[DIO8] Bits */
#define GPIO_GEN_EVENT0_IMASK_DIO8_OFS (8) /* !< DIO8 Offset */
#define GPIO_GEN_EVENT0_IMASK_DIO8_MASK                                        \
  ((uint32_t)0x00000100U) /* !< DIO8 event mask */
#define GPIO_GEN_EVENT0_IMASK_DIO8_CLR                                         \
  ((uint32_t)0x00000000U) /* !< Event is masked */
#define GPIO_GEN_EVENT0_IMASK_DIO8_SET                                         \
  ((uint32_t)0x00000100U) /* !< Event is unmasked */
/* GPIO_GEN_EVENT0_IMASK[DIO9] Bits */
#define GPIO_GEN_EVENT0_IMASK_DIO9_OFS (9) /* !< DIO9 Offset */
#define GPIO_GEN_EVENT0_IMASK_DIO9_MASK                                        \
  ((uint32_t)0x00000200U) /* !< DIO9 event mask */
#define GPIO_GEN_EVENT0_IMASK_DIO9_CLR                                         \
  ((uint32_t)0x00000000U) /* !< Event is masked */
#define GPIO_GEN_EVENT0_IMASK_DIO9_SET                                         \
  ((uint32_t)0x00000200U) /* !< Event is unmasked */
/* GPIO_GEN_EVENT0_IMASK[DIO10] Bits */
#define GPIO_GEN_EVENT0_IMASK_DIO10_OFS (10) /* !< DIO10 Offset */
#define GPIO_GEN_EVENT0_IMASK_DIO10_MASK                                       \
  ((uint32_t)0x00000400U) /* !< DIO10 event mask */
#define GPIO_GEN_EVENT0_IMASK_DIO10_CLR                                        \
  ((uint32_t)0x00000000U) /* !< Event is masked */
#define GPIO_GEN_EVENT0_IMASK_DIO10_SET                                        \
  ((uint32_t)0x00000400U) /* !< Event is unmasked */
/* GPIO_GEN_EVENT0_IMASK[DIO11] Bits */
#define GPIO_GEN_EVENT0_IMASK_DIO11_OFS (11) /* !< DIO11 Offset */
#define GPIO_GEN_EVENT0_IMASK_DIO11_MASK                                       \
  ((uint32_t)0x00000800U) /* !< DIO11 event mask */
#define GPIO_GEN_EVENT0_IMASK_DIO11_CLR                                        \
  ((uint32_t)0x00000000U) /* !< Event is masked */
#define GPIO_GEN_EVENT0_IMASK_DIO11_SET                                        \
  ((uint32_t)0x00000800U) /* !< Event is unmasked */
/* GPIO_GEN_EVENT0_IMASK[DIO12] Bits */
#define GPIO_GEN_EVENT0_IMASK_DIO12_OFS (12) /* !< DIO12 Offset */
#define GPIO_GEN_EVENT0_IMASK_DIO12_MASK                                       \
  ((uint32_t)0x00001000U) /* !< DIO12 event mask */
#define GPIO_GEN_EVENT0_IMASK_DIO12_CLR                                        \
  ((uint32_t)0x00000000U) /* !< Event is masked */
#define GPIO_GEN_EVENT0_IMASK_DIO12_SET                                        \
  ((uint32_t)0x00001000U) /* !< Event is unmasked */
/* GPIO_GEN_EVENT0_IMASK[DIO13] Bits */
#define GPIO_GEN_EVENT0_IMASK_DIO13_OFS (13) /* !< DIO13 Offset */
#define GPIO_GEN_EVENT0_IMASK_DIO13_MASK                                       \
  ((uint32_t)0x00002000U) /* !< DIO13 event mask */
#define GPIO_GEN_EVENT0_IMASK_DIO13_CLR                                        \
  ((uint32_t)0x00000000U) /* !< Event is masked */
#define GPIO_GEN_EVENT0_IMASK_DIO13_SET                                        \
  ((uint32_t)0x00002000U) /* !< Event is unmasked */
/* GPIO_GEN_EVENT0_IMASK[DIO14] Bits */
#define GPIO_GEN_EVENT0_IMASK_DIO14_OFS (14) /* !< DIO14 Offset */
#define GPIO_GEN_EVENT0_IMASK_DIO14_MASK                                       \
  ((uint32_t)0x00004000U) /* !< DIO14 event mask */
#define GPIO_GEN_EVENT0_IMASK_DIO14_CLR                                        \
  ((uint32_t)0x00000000U) /* !< Event is masked */
#define GPIO_GEN_EVENT0_IMASK_DIO14_SET                                        \
  ((uint32_t)0x00004000U) /* !< Event is unmasked */
/* GPIO_GEN_EVENT0_IMASK[DIO15] Bits */
#define GPIO_GEN_EVENT0_IMASK_DIO15_OFS (15) /* !< DIO15 Offset */
#define GPIO_GEN_EVENT0_IMASK_DIO15_MASK                                       \
  ((uint32_t)0x00008000U) /* !< DIO15 event mask */
#define GPIO_GEN_EVENT0_IMASK_DIO15_CLR                                        \
  ((uint32_t)0x00000000U) /* !< Event is masked */
#define GPIO_GEN_EVENT0_IMASK_DIO15_SET                                        \
  ((uint32_t)0x00008000U) /* !< Event is unmasked */

/* GPIO_GEN_EVENT0_RIS Bits */
/* GPIO_GEN_EVENT0_RIS[DIO0] Bits */
#define GPIO_GEN_EVENT0_RIS_DIO0_OFS (0) /* !< DIO0 Offset */
#define GPIO_GEN_EVENT0_RIS_DIO0_MASK                                          \
  ((uint32_t)0x00000001U) /* !< DIO0 event */
#define GPIO_GEN_EVENT0_RIS_DIO0_CLR                                           \
  ((uint32_t)0x00000000U) /* !< DIO0 event did not occur */
#define GPIO_GEN_EVENT0_RIS_DIO0_SET                                           \
  ((uint32_t)0x00000001U) /* !< DIO0 event occurred */
/* GPIO_GEN_EVENT0_RIS[DIO1] Bits */
#define GPIO_GEN_EVENT0_RIS_DIO1_OFS (1) /* !< DIO1 Offset */
#define GPIO_GEN_EVENT0_RIS_DIO1_MASK                                          \
  ((uint32_t)0x00000002U) /* !< DIO1 event */
#define GPIO_GEN_EVENT0_RIS_DIO1_CLR                                           \
  ((uint32_t)0x00000000U) /* !< DIO1 event did not occur */
#define GPIO_GEN_EVENT0_RIS_DIO1_SET                                           \
  ((uint32_t)0x00000002U) /* !< DIO1 event occurred */
/* GPIO_GEN_EVENT0_RIS[DIO2] Bits */
#define GPIO_GEN_EVENT0_RIS_DIO2_OFS (2) /* !< DIO2 Offset */
#define GPIO_GEN_EVENT0_RIS_DIO2_MASK                                          \
  ((uint32_t)0x00000004U) /* !< DIO2 event */
#define GPIO_GEN_EVENT0_RIS_DIO2_CLR                                           \
  ((uint32_t)0x00000000U) /* !< DIO2 event did not occur */
#define GPIO_GEN_EVENT0_RIS_DIO2_SET                                           \
  ((uint32_t)0x00000004U) /* !< DIO2 event occurred */
/* GPIO_GEN_EVENT0_RIS[DIO3] Bits */
#define GPIO_GEN_EVENT0_RIS_DIO3_OFS (3) /* !< DIO3 Offset */
#define GPIO_GEN_EVENT0_RIS_DIO3_MASK                                          \
  ((uint32_t)0x00000008U) /* !< DIO3 event */
#define GPIO_GEN_EVENT0_RIS_DIO3_CLR                                           \
  ((uint32_t)0x00000000U) /* !< DIO3 event did not occur */
#define GPIO_GEN_EVENT0_RIS_DIO3_SET                                           \
  ((uint32_t)0x00000008U) /* !< DIO3 event occurred */
/* GPIO_GEN_EVENT0_RIS[DIO4] Bits */
#define GPIO_GEN_EVENT0_RIS_DIO4_OFS (4) /* !< DIO4 Offset */
#define GPIO_GEN_EVENT0_RIS_DIO4_MASK                                          \
  ((uint32_t)0x00000010U) /* !< DIO4 event */
#define GPIO_GEN_EVENT0_RIS_DIO4_CLR                                           \
  ((uint32_t)0x00000000U) /* !< DIO4 event did not occur */
#define GPIO_GEN_EVENT0_RIS_DIO4_SET                                           \
  ((uint32_t)0x00000010U) /* !< DIO4 event occurred */
/* GPIO_GEN_EVENT0_RIS[DIO5] Bits */
#define GPIO_GEN_EVENT0_RIS_DIO5_OFS (5) /* !< DIO5 Offset */
#define GPIO_GEN_EVENT0_RIS_DIO5_MASK                                          \
  ((uint32_t)0x00000020U) /* !< DIO5 event */
#define GPIO_GEN_EVENT0_RIS_DIO5_CLR                                           \
  ((uint32_t)0x00000000U) /* !< DIO5 event did not occur */
#define GPIO_GEN_EVENT0_RIS_DIO5_SET                                           \
  ((uint32_t)0x00000020U) /* !< DIO5 event occurred */
/* GPIO_GEN_EVENT0_RIS[DIO6] Bits */
#define GPIO_GEN_EVENT0_RIS_DIO6_OFS (6) /* !< DIO6 Offset */
#define GPIO_GEN_EVENT0_RIS_DIO6_MASK                                          \
  ((uint32_t)0x00000040U) /* !< DIO6 event */
#define GPIO_GEN_EVENT0_RIS_DIO6_CLR                                           \
  ((uint32_t)0x00000000U) /* !< DIO6 event did not occur */
#define GPIO_GEN_EVENT0_RIS_DIO6_SET                                           \
  ((uint32_t)0x00000040U) /* !< DIO6 event occurred */
/* GPIO_GEN_EVENT0_RIS[DIO7] Bits */
#define GPIO_GEN_EVENT0_RIS_DIO7_OFS (7) /* !< DIO7 Offset */
#define GPIO_GEN_EVENT0_RIS_DIO7_MASK                                          \
  ((uint32_t)0x00000080U) /* !< DIO7 event */
#define GPIO_GEN_EVENT0_RIS_DIO7_CLR                                           \
  ((uint32_t)0x00000000U) /* !< DIO7 event did not occur */
#define GPIO_GEN_EVENT0_RIS_DIO7_SET                                           \
  ((uint32_t)0x00000080U) /* !< DIO7 event occurred */
/* GPIO_GEN_EVENT0_RIS[DIO8] Bits */
#define GPIO_GEN_EVENT0_RIS_DIO8_OFS (8) /* !< DIO8 Offset */
#define GPIO_GEN_EVENT0_RIS_DIO8_MASK                                          \
  ((uint32_t)0x00000100U) /* !< DIO8 event */
#define GPIO_GEN_EVENT0_RIS_DIO8_CLR                                           \
  ((uint32_t)0x00000000U) /* !< DIO8 event did not occur */
#define GPIO_GEN_EVENT0_RIS_DIO8_SET                                           \
  ((uint32_t)0x00000100U) /* !< DIO8 event occurred */
/* GPIO_GEN_EVENT0_RIS[DIO9] Bits */
#define GPIO_GEN_EVENT0_RIS_DIO9_OFS (9) /* !< DIO9 Offset */
#define GPIO_GEN_EVENT0_RIS_DIO9_MASK                                          \
  ((uint32_t)0x00000200U) /* !< DIO9 event */
#define GPIO_GEN_EVENT0_RIS_DIO9_CLR                                           \
  ((uint32_t)0x00000000U) /* !< DIO9 event did not occur */
#define GPIO_GEN_EVENT0_RIS_DIO9_SET                                           \
  ((uint32_t)0x00000200U) /* !< DIO9 event occurred */
/* GPIO_GEN_EVENT0_RIS[DIO10] Bits */
#define GPIO_GEN_EVENT0_RIS_DIO10_OFS (10) /* !< DIO10 Offset */
#define GPIO_GEN_EVENT0_RIS_DIO10_MASK                                         \
  ((uint32_t)0x00000400U) /* !< DIO10 event */
#define GPIO_GEN_EVENT0_RIS_DIO10_CLR                                          \
  ((uint32_t)0x00000000U) /* !< DIO10 event did not occur */
#define GPIO_GEN_EVENT0_RIS_DIO10_SET                                          \
  ((uint32_t)0x00000400U) /* !< DIO10 event occurred */
/* GPIO_GEN_EVENT0_RIS[DIO11] Bits */
#define GPIO_GEN_EVENT0_RIS_DIO11_OFS (11) /* !< DIO11 Offset */
#define GPIO_GEN_EVENT0_RIS_DIO11_MASK                                         \
  ((uint32_t)0x00000800U) /* !< DIO11 event */
#define GPIO_GEN_EVENT0_RIS_DIO11_CLR                                          \
  ((uint32_t)0x00000000U) /* !< DIO11 event did not occur */
#define GPIO_GEN_EVENT0_RIS_DIO11_SET                                          \
  ((uint32_t)0x00000800U) /* !< DIO11 event occurred */
/* GPIO_GEN_EVENT0_RIS[DIO12] Bits */
#define GPIO_GEN_EVENT0_RIS_DIO12_OFS (12) /* !< DIO12 Offset */
#define GPIO_GEN_EVENT0_RIS_DIO12_MASK                                         \
  ((uint32_t)0x00001000U) /* !< DIO12 event */
#define GPIO_GEN_EVENT0_RIS_DIO12_CLR                                          \
  ((uint32_t)0x00000000U) /* !< DIO12 event did not occur */
#define GPIO_GEN_EVENT0_RIS_DIO12_SET                                          \
  ((uint32_t)0x00001000U) /* !< DIO12 event occurred */
/* GPIO_GEN_EVENT0_RIS[DIO13] Bits */
#define GPIO_GEN_EVENT0_RIS_DIO13_OFS (13) /* !< DIO13 Offset */
#define GPIO_GEN_EVENT0_RIS_DIO13_MASK                                         \
  ((uint32_t)0x00002000U) /* !< DIO13 event */
#define GPIO_GEN_EVENT0_RIS_DIO13_CLR                                          \
  ((uint32_t)0x00000000U) /* !< DIO13 event did not occur */
#define GPIO_GEN_EVENT0_RIS_DIO13_SET                                          \
  ((uint32_t)0x00002000U) /* !< DIO13 event occurred */
/* GPIO_GEN_EVENT0_RIS[DIO14] Bits */
#define GPIO_GEN_EVENT0_RIS_DIO14_OFS (14) /* !< DIO14 Offset */
#define GPIO_GEN_EVENT0_RIS_DIO14_MASK                                         \
  ((uint32_t)0x00004000U) /* !< DIO14 event */
#define GPIO_GEN_EVENT0_RIS_DIO14_CLR                                          \
  ((uint32_t)0x00000000U) /* !< DIO14 event did not occur */
#define GPIO_GEN_EVENT0_RIS_DIO14_SET                                          \
  ((uint32_t)0x00004000U) /* !< DIO14 event occurred */
/* GPIO_GEN_EVENT0_RIS[DIO15] Bits */
#define GPIO_GEN_EVENT0_RIS_DIO15_OFS (15) /* !< DIO15 Offset */
#define GPIO_GEN_EVENT0_RIS_DIO15_MASK                                         \
  ((uint32_t)0x00008000U) /* !< DIO15 event */
#define GPIO_GEN_EVENT0_RIS_DIO15_CLR                                          \
  ((uint32_t)0x00000000U) /* !< DIO15 event did not occur */
#define GPIO_GEN_EVENT0_RIS_DIO15_SET                                          \
  ((uint32_t)0x00008000U) /* !< DIO15 event occurred */

