luckycyang/mspm0l1306-dev/include/ti/devices/msp/peripherals/hw_gpio.h
/* GPIO_GEN_EVENT0_MIS Bits */
/* GPIO_GEN_EVENT0_MIS[DIO0] Bits */
#define GPIO_GEN_EVENT0_MIS_DIO0_OFS (0) /* !< DIO0 Offset */
#define GPIO_GEN_EVENT0_MIS_DIO0_MASK                                          \
  ((uint32_t)0x00000001U) /* !< DIO0 event */
#define GPIO_GEN_EVENT0_MIS_DIO0_CLR                                           \
  ((uint32_t)0x00000000U) /* !< DIO0 event did not occur */
#define GPIO_GEN_EVENT0_MIS_DIO0_SET                                           \
  ((uint32_t)0x00000001U) /* !< DIO0 event occurred */
/* GPIO_GEN_EVENT0_MIS[DIO1] Bits */
#define GPIO_GEN_EVENT0_MIS_DIO1_OFS (1) /* !< DIO1 Offset */
#define GPIO_GEN_EVENT0_MIS_DIO1_MASK                                          \
  ((uint32_t)0x00000002U) /* !< DIO1 event */
#define GPIO_GEN_EVENT0_MIS_DIO1_CLR                                           \
  ((uint32_t)0x00000000U) /* !< DIO1 event did not occur */
#define GPIO_GEN_EVENT0_MIS_DIO1_SET                                           \
  ((uint32_t)0x00000002U) /* !< DIO1 event occurred */
/* GPIO_GEN_EVENT0_MIS[DIO2] Bits */
#define GPIO_GEN_EVENT0_MIS_DIO2_OFS (2) /* !< DIO2 Offset */
#define GPIO_GEN_EVENT0_MIS_DIO2_MASK                                          \
  ((uint32_t)0x00000004U) /* !< DIO2 event */
#define GPIO_GEN_EVENT0_MIS_DIO2_CLR                                           \
  ((uint32_t)0x00000000U) /* !< DIO2 event did not occur */
#define GPIO_GEN_EVENT0_MIS_DIO2_SET                                           \
  ((uint32_t)0x00000004U) /* !< DIO2 event occurred */
/* GPIO_GEN_EVENT0_MIS[DIO3] Bits */
#define GPIO_GEN_EVENT0_MIS_DIO3_OFS (3) /* !< DIO3 Offset */
#define GPIO_GEN_EVENT0_MIS_DIO3_MASK                                          \
  ((uint32_t)0x00000008U) /* !< DIO3 event */
#define GPIO_GEN_EVENT0_MIS_DIO3_CLR                                           \
  ((uint32_t)0x00000000U) /* !< DIO3 event did not occur */
#define GPIO_GEN_EVENT0_MIS_DIO3_SET                                           \
  ((uint32_t)0x00000008U) /* !< DIO3 event occurred */
/* GPIO_GEN_EVENT0_MIS[DIO4] Bits */
#define GPIO_GEN_EVENT0_MIS_DIO4_OFS (4) /* !< DIO4 Offset */
#define GPIO_GEN_EVENT0_MIS_DIO4_MASK                                          \
  ((uint32_t)0x00000010U) /* !< DIO4 event */
#define GPIO_GEN_EVENT0_MIS_DIO4_CLR                                           \
  ((uint32_t)0x00000000U) /* !< DIO4 event did not occur */
#define GPIO_GEN_EVENT0_MIS_DIO4_SET                                           \
  ((uint32_t)0x00000010U) /* !< DIO4 event occurred */
/* GPIO_GEN_EVENT0_MIS[DIO5] Bits */
#define GPIO_GEN_EVENT0_MIS_DIO5_OFS (5) /* !< DIO5 Offset */
#define GPIO_GEN_EVENT0_MIS_DIO5_MASK                                          \
  ((uint32_t)0x00000020U) /* !< DIO5 event */
#define GPIO_GEN_EVENT0_MIS_DIO5_CLR                                           \
  ((uint32_t)0x00000000U) /* !< DIO5 event did not occur */
#define GPIO_GEN_EVENT0_MIS_DIO5_SET                                           \
  ((uint32_t)0x00000020U) /* !< DIO5 event occurred */
/* GPIO_GEN_EVENT0_MIS[DIO6] Bits */
#define GPIO_GEN_EVENT0_MIS_DIO6_OFS (6) /* !< DIO6 Offset */
#define GPIO_GEN_EVENT0_MIS_DIO6_MASK                                          \
  ((uint32_t)0x00000040U) /* !< DIO6 event */
#define GPIO_GEN_EVENT0_MIS_DIO6_CLR                                           \
  ((uint32_t)0x00000000U) /* !< DIO6 event did not occur */
#define GPIO_GEN_EVENT0_MIS_DIO6_SET                                           \
  ((uint32_t)0x00000040U) /* !< DIO6 event occurred */
/* GPIO_GEN_EVENT0_MIS[DIO7] Bits */
#define GPIO_GEN_EVENT0_MIS_DIO7_OFS (7) /* !< DIO7 Offset */
#define GPIO_GEN_EVENT0_MIS_DIO7_MASK                                          \
  ((uint32_t)0x00000080U) /* !< DIO7 event */
#define GPIO_GEN_EVENT0_MIS_DIO7_CLR                                           \
  ((uint32_t)0x00000000U) /* !< DIO7 event did not occur */
#define GPIO_GEN_EVENT0_MIS_DIO7_SET                                           \
  ((uint32_t)0x00000080U) /* !< DIO7 event occurred */
/* GPIO_GEN_EVENT0_MIS[DIO8] Bits */
#define GPIO_GEN_EVENT0_MIS_DIO8_OFS (8) /* !< DIO8 Offset */
#define GPIO_GEN_EVENT0_MIS_DIO8_MASK                                          \
  ((uint32_t)0x00000100U) /* !< DIO8 event */
#define GPIO_GEN_EVENT0_MIS_DIO8_CLR                                           \
  ((uint32_t)0x00000000U) /* !< DIO8 event did not occur */
#define GPIO_GEN_EVENT0_MIS_DIO8_SET                                           \
  ((uint32_t)0x00000100U) /* !< DIO8 event occurred */
/* GPIO_GEN_EVENT0_MIS[DIO9] Bits */
#define GPIO_GEN_EVENT0_MIS_DIO9_OFS (9) /* !< DIO9 Offset */
#define GPIO_GEN_EVENT0_MIS_DIO9_MASK                                          \
  ((uint32_t)0x00000200U) /* !< DIO9 event */
#define GPIO_GEN_EVENT0_MIS_DIO9_CLR                                           \
  ((uint32_t)0x00000000U) /* !< DIO9 event did not occur */
#define GPIO_GEN_EVENT0_MIS_DIO9_SET                                           \
  ((uint32_t)0x00000200U) /* !< DIO9 event occurred */
/* GPIO_GEN_EVENT0_MIS[DIO10] Bits */
#define GPIO_GEN_EVENT0_MIS_DIO10_OFS (10) /* !< DIO10 Offset */
#define GPIO_GEN_EVENT0_MIS_DIO10_MASK                                         \
  ((uint32_t)0x00000400U) /* !< DIO10 event */
#define GPIO_GEN_EVENT0_MIS_DIO10_CLR                                          \
  ((uint32_t)0x00000000U) /* !< DIO10 event did not occur */
#define GPIO_GEN_EVENT0_MIS_DIO10_SET                                          \
  ((uint32_t)0x00000400U) /* !< DIO10 event occurred */
/* GPIO_GEN_EVENT0_MIS[DIO11] Bits */
#define GPIO_GEN_EVENT0_MIS_DIO11_OFS (11) /* !< DIO11 Offset */
#define GPIO_GEN_EVENT0_MIS_DIO11_MASK                                         \
  ((uint32_t)0x00000800U) /* !< DIO11 event */
#define GPIO_GEN_EVENT0_MIS_DIO11_CLR                                          \
  ((uint32_t)0x00000000U) /* !< DIO11 event did not occur */
#define GPIO_GEN_EVENT0_MIS_DIO11_SET                                          \
  ((uint32_t)0x00000800U) /* !< DIO11 event occurred */
/* GPIO_GEN_EVENT0_MIS[DIO12] Bits */
#define GPIO_GEN_EVENT0_MIS_DIO12_OFS (12) /* !< DIO12 Offset */
#define GPIO_GEN_EVENT0_MIS_DIO12_MASK                                         \
  ((uint32_t)0x00001000U) /* !< DIO12 event */
#define GPIO_GEN_EVENT0_MIS_DIO12_CLR                                          \
  ((uint32_t)0x00000000U) /* !< DIO12 event did not occur */
#define GPIO_GEN_EVENT0_MIS_DIO12_SET                                          \
  ((uint32_t)0x00001000U) /* !< DIO12 event occurred */
/* GPIO_GEN_EVENT0_MIS[DIO13] Bits */
#define GPIO_GEN_EVENT0_MIS_DIO13_OFS (13) /* !< DIO13 Offset */
#define GPIO_GEN_EVENT0_MIS_DIO13_MASK                                         \
  ((uint32_t)0x00002000U) /* !< DIO13 event */
#define GPIO_GEN_EVENT0_MIS_DIO13_CLR                                          \
  ((uint32_t)0x00000000U) /* !< DIO13 event did not occur */
#define GPIO_GEN_EVENT0_MIS_DIO13_SET                                          \
  ((uint32_t)0x00002000U) /* !< DIO13 event occurred */
/* GPIO_GEN_EVENT0_MIS[DIO14] Bits */
#define GPIO_GEN_EVENT0_MIS_DIO14_OFS (14) /* !< DIO14 Offset */
#define GPIO_GEN_EVENT0_MIS_DIO14_MASK                                         \
  ((uint32_t)0x00004000U) /* !< DIO14 event */
#define GPIO_GEN_EVENT0_MIS_DIO14_CLR                                          \
  ((uint32_t)0x00000000U) /* !< DIO14 event did not occur */
#define GPIO_GEN_EVENT0_MIS_DIO14_SET                                          \
  ((uint32_t)0x00004000U) /* !< DIO14 event occurred */
/* GPIO_GEN_EVENT0_MIS[DIO15] Bits */
#define GPIO_GEN_EVENT0_MIS_DIO15_OFS (15) /* !< DIO15 Offset */
#define GPIO_GEN_EVENT0_MIS_DIO15_MASK                                         \
  ((uint32_t)0x00008000U) /* !< DIO15 event */
#define GPIO_GEN_EVENT0_MIS_DIO15_CLR                                          \
  ((uint32_t)0x00000000U) /* !< DIO15 event did not occur */
#define GPIO_GEN_EVENT0_MIS_DIO15_SET                                          \
  ((uint32_t)0x00008000U) /* !< DIO15 event occurred */

/* GPIO_GEN_EVENT0_ISET Bits */
/* GPIO_GEN_EVENT0_ISET[DIO0] Bits */
#define GPIO_GEN_EVENT0_ISET_DIO0_OFS (0) /* !< DIO0 Offset */
#define GPIO_GEN_EVENT0_ISET_DIO0_MASK                                         \
  ((uint32_t)0x00000001U) /* !< DIO0 event */
#define GPIO_GEN_EVENT0_ISET_DIO0_NO_EFFECT                                    \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_GEN_EVENT0_ISET_DIO0_SET                                          \
  ((uint32_t)0x00000001U) /* !< Sets DIO0 in RIS register */
/* GPIO_GEN_EVENT0_ISET[DIO1] Bits */
#define GPIO_GEN_EVENT0_ISET_DIO1_OFS (1) /* !< DIO1 Offset */
#define GPIO_GEN_EVENT0_ISET_DIO1_MASK                                         \
  ((uint32_t)0x00000002U) /* !< DIO1 event */
#define GPIO_GEN_EVENT0_ISET_DIO1_NO_EFFECT                                    \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_GEN_EVENT0_ISET_DIO1_SET                                          \
  ((uint32_t)0x00000002U) /* !< Sets DIO1 in RIS register */
/* GPIO_GEN_EVENT0_ISET[DIO2] Bits */
#define GPIO_GEN_EVENT0_ISET_DIO2_OFS (2) /* !< DIO2 Offset */
#define GPIO_GEN_EVENT0_ISET_DIO2_MASK                                         \
  ((uint32_t)0x00000004U) /* !< DIO2 event */
#define GPIO_GEN_EVENT0_ISET_DIO2_NO_EFFECT                                    \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_GEN_EVENT0_ISET_DIO2_SET                                          \
  ((uint32_t)0x00000004U) /* !< Sets DIO2 in RIS register */
/* GPIO_GEN_EVENT0_ISET[DIO3] Bits */
#define GPIO_GEN_EVENT0_ISET_DIO3_OFS (3) /* !< DIO3 Offset */
#define GPIO_GEN_EVENT0_ISET_DIO3_MASK                                         \
  ((uint32_t)0x00000008U) /* !< DIO3 event */
#define GPIO_GEN_EVENT0_ISET_DIO3_NO_EFFECT                                    \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_GEN_EVENT0_ISET_DIO3_SET                                          \
  ((uint32_t)0x00000008U) /* !< Sets DIO3 in RIS register */
/* GPIO_GEN_EVENT0_ISET[DIO4] Bits */
#define GPIO_GEN_EVENT0_ISET_DIO4_OFS (4) /* !< DIO4 Offset */
#define GPIO_GEN_EVENT0_ISET_DIO4_MASK                                         \
  ((uint32_t)0x00000010U) /* !< DIO4 event */
#define GPIO_GEN_EVENT0_ISET_DIO4_NO_EFFECT                                    \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_GEN_EVENT0_ISET_DIO4_SET                                          \
  ((uint32_t)0x00000010U) /* !< Sets DIO4 in RIS register */
/* GPIO_GEN_EVENT0_ISET[DIO5] Bits */
#define GPIO_GEN_EVENT0_ISET_DIO5_OFS (5) /* !< DIO5 Offset */
#define GPIO_GEN_EVENT0_ISET_DIO5_MASK                                         \
  ((uint32_t)0x00000020U) /* !< DIO5 event */
#define GPIO_GEN_EVENT0_ISET_DIO5_NO_EFFECT                                    \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_GEN_EVENT0_ISET_DIO5_SET                                          \
  ((uint32_t)0x00000020U) /* !< Sets DIO5 in RIS register */
/* GPIO_GEN_EVENT0_ISET[DIO6] Bits */
#define GPIO_GEN_EVENT0_ISET_DIO6_OFS (6) /* !< DIO6 Offset */
#define GPIO_GEN_EVENT0_ISET_DIO6_MASK                                         \
  ((uint32_t)0x00000040U) /* !< DIO6 event */
#define GPIO_GEN_EVENT0_ISET_DIO6_NO_EFFECT                                    \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_GEN_EVENT0_ISET_DIO6_SET                                          \
  ((uint32_t)0x00000040U) /* !< Sets DIO6 in RIS register */
/* GPIO_GEN_EVENT0_ISET[DIO7] Bits */
#define GPIO_GEN_EVENT0_ISET_DIO7_OFS (7) /* !< DIO7 Offset */
#define GPIO_GEN_EVENT0_ISET_DIO7_MASK                                         \
  ((uint32_t)0x00000080U) /* !< DIO7 event */
#define GPIO_GEN_EVENT0_ISET_DIO7_NO_EFFECT                                    \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_GEN_EVENT0_ISET_DIO7_SET                                          \
  ((uint32_t)0x00000080U) /* !< Sets DIO7 in RIS register */
/* GPIO_GEN_EVENT0_ISET[DIO8] Bits */
#define GPIO_GEN_EVENT0_ISET_DIO8_OFS (8) /* !< DIO8 Offset */
#define GPIO_GEN_EVENT0_ISET_DIO8_MASK                                         \
  ((uint32_t)0x00000100U) /* !< DIO8 event */
#define GPIO_GEN_EVENT0_ISET_DIO8_NO_EFFECT                                    \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_GEN_EVENT0_ISET_DIO8_SET                                          \
  ((uint32_t)0x00000100U) /* !< Sets DIO8 in RIS register */
/* GPIO_GEN_EVENT0_ISET[DIO9] Bits */
#define GPIO_GEN_EVENT0_ISET_DIO9_OFS (9) /* !< DIO9 Offset */
#define GPIO_GEN_EVENT0_ISET_DIO9_MASK                                         \
  ((uint32_t)0x00000200U) /* !< DIO9 event */
#define GPIO_GEN_EVENT0_ISET_DIO9_NO_EFFECT                                    \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_GEN_EVENT0_ISET_DIO9_SET                                          \
  ((uint32_t)0x00000200U) /* !< Sets DIO9 in RIS register */
/* GPIO_GEN_EVENT0_ISET[DIO10] Bits */
#define GPIO_GEN_EVENT0_ISET_DIO10_OFS (10) /* !< DIO10 Offset */
#define GPIO_GEN_EVENT0_ISET_DIO10_MASK                                        \
  ((uint32_t)0x00000400U) /* !< DIO10 event */
#define GPIO_GEN_EVENT0_ISET_DIO10_NO_EFFECT                                   \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_GEN_EVENT0_ISET_DIO10_SET                                         \
  ((uint32_t)0x00000400U) /* !< Sets DIO10 in RIS register */
/* GPIO_GEN_EVENT0_ISET[DIO11] Bits */
#define GPIO_GEN_EVENT0_ISET_DIO11_OFS (11) /* !< DIO11 Offset */
#define GPIO_GEN_EVENT0_ISET_DIO11_MASK                                        \
  ((uint32_t)0x00000800U) /* !< DIO11 event */
#define GPIO_GEN_EVENT0_ISET_DIO11_NO_EFFECT                                   \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_GEN_EVENT0_ISET_DIO11_SET                                         \
  ((uint32_t)0x00000800U) /* !< Sets DIO11 in RIS register */
/* GPIO_GEN_EVENT0_ISET[DIO12] Bits */
#define GPIO_GEN_EVENT0_ISET_DIO12_OFS (12) /* !< DIO12 Offset */
#define GPIO_GEN_EVENT0_ISET_DIO12_MASK                                        \
  ((uint32_t)0x00001000U) /* !< DIO12 event */
#define GPIO_GEN_EVENT0_ISET_DIO12_NO_EFFECT                                   \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_GEN_EVENT0_ISET_DIO12_SET                                         \
  ((uint32_t)0x00001000U) /* !< Sets DIO12 in RIS register */
/* GPIO_GEN_EVENT0_ISET[DIO13] Bits */
#define GPIO_GEN_EVENT0_ISET_DIO13_OFS (13) /* !< DIO13 Offset */
#define GPIO_GEN_EVENT0_ISET_DIO13_MASK                                        \
  ((uint32_t)0x00002000U) /* !< DIO13 event */
#define GPIO_GEN_EVENT0_ISET_DIO13_NO_EFFECT                                   \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_GEN_EVENT0_ISET_DIO13_SET                                         \
  ((uint32_t)0x00002000U) /* !< Sets DIO13 in RIS register */
/* GPIO_GEN_EVENT0_ISET[DIO14] Bits */
#define GPIO_GEN_EVENT0_ISET_DIO14_OFS (14) /* !< DIO14 Offset */
#define GPIO_GEN_EVENT0_ISET_DIO14_MASK                                        \
  ((uint32_t)0x00004000U) /* !< DIO14 event */
#define GPIO_GEN_EVENT0_ISET_DIO14_NO_EFFECT                                   \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_GEN_EVENT0_ISET_DIO14_SET                                         \
  ((uint32_t)0x00004000U) /* !< Sets DIO14 in RIS register */
/* GPIO_GEN_EVENT0_ISET[DIO15] Bits */
#define GPIO_GEN_EVENT0_ISET_DIO15_OFS (15) /* !< DIO15 Offset */
#define GPIO_GEN_EVENT0_ISET_DIO15_MASK                                        \
  ((uint32_t)0x00008000U) /* !< DIO15 event */
#define GPIO_GEN_EVENT0_ISET_DIO15_NO_EFFECT                                   \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_GEN_EVENT0_ISET_DIO15_SET                                         \
  ((uint32_t)0x00008000U) /* !< Sets DIO15 in RIS register */

