luckycyang/mspm0l1306-dev/include/ti/devices/msp/peripherals/hw_gpio.h
/* GPIO_GEN_EVENT0_ICLR Bits */
/* GPIO_GEN_EVENT0_ICLR[DIO0] Bits */
#define GPIO_GEN_EVENT0_ICLR_DIO0_OFS (0) /* !< DIO0 Offset */
#define GPIO_GEN_EVENT0_ICLR_DIO0_MASK                                         \
  ((uint32_t)0x00000001U) /* !< DIO0 event */
#define GPIO_GEN_EVENT0_ICLR_DIO0_NO_EFFECT                                    \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_GEN_EVENT0_ICLR_DIO0_CLR                                          \
  ((uint32_t)0x00000001U) /* !< Clears DIO0 in RIS register */
/* GPIO_GEN_EVENT0_ICLR[DIO1] Bits */
#define GPIO_GEN_EVENT0_ICLR_DIO1_OFS (1) /* !< DIO1 Offset */
#define GPIO_GEN_EVENT0_ICLR_DIO1_MASK                                         \
  ((uint32_t)0x00000002U) /* !< DIO1 event */
#define GPIO_GEN_EVENT0_ICLR_DIO1_NO_EFFECT                                    \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_GEN_EVENT0_ICLR_DIO1_CLR                                          \
  ((uint32_t)0x00000002U) /* !< Clears DIO1 in RIS register */
/* GPIO_GEN_EVENT0_ICLR[DIO2] Bits */
#define GPIO_GEN_EVENT0_ICLR_DIO2_OFS (2) /* !< DIO2 Offset */
#define GPIO_GEN_EVENT0_ICLR_DIO2_MASK                                         \
  ((uint32_t)0x00000004U) /* !< DIO2 event */
#define GPIO_GEN_EVENT0_ICLR_DIO2_NO_EFFECT                                    \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_GEN_EVENT0_ICLR_DIO2_CLR                                          \
  ((uint32_t)0x00000004U) /* !< Clears DIO2 in RIS register */
/* GPIO_GEN_EVENT0_ICLR[DIO3] Bits */
#define GPIO_GEN_EVENT0_ICLR_DIO3_OFS (3) /* !< DIO3 Offset */
#define GPIO_GEN_EVENT0_ICLR_DIO3_MASK                                         \
  ((uint32_t)0x00000008U) /* !< DIO3 event */
#define GPIO_GEN_EVENT0_ICLR_DIO3_NO_EFFECT                                    \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_GEN_EVENT0_ICLR_DIO3_CLR                                          \
  ((uint32_t)0x00000008U) /* !< Clears DIO3 in RIS register */
/* GPIO_GEN_EVENT0_ICLR[DIO4] Bits */
#define GPIO_GEN_EVENT0_ICLR_DIO4_OFS (4) /* !< DIO4 Offset */
#define GPIO_GEN_EVENT0_ICLR_DIO4_MASK                                         \
  ((uint32_t)0x00000010U) /* !< DIO4 event */
#define GPIO_GEN_EVENT0_ICLR_DIO4_NO_EFFECT                                    \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_GEN_EVENT0_ICLR_DIO4_CLR                                          \
  ((uint32_t)0x00000010U) /* !< Clears DIO4 in RIS register */
/* GPIO_GEN_EVENT0_ICLR[DIO5] Bits */
#define GPIO_GEN_EVENT0_ICLR_DIO5_OFS (5) /* !< DIO5 Offset */
#define GPIO_GEN_EVENT0_ICLR_DIO5_MASK                                         \
  ((uint32_t)0x00000020U) /* !< DIO5 event */
#define GPIO_GEN_EVENT0_ICLR_DIO5_NO_EFFECT                                    \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_GEN_EVENT0_ICLR_DIO5_CLR                                          \
  ((uint32_t)0x00000020U) /* !< Clears DIO5 in RIS register */
/* GPIO_GEN_EVENT0_ICLR[DIO6] Bits */
#define GPIO_GEN_EVENT0_ICLR_DIO6_OFS (6) /* !< DIO6 Offset */
#define GPIO_GEN_EVENT0_ICLR_DIO6_MASK                                         \
  ((uint32_t)0x00000040U) /* !< DIO6 event */
#define GPIO_GEN_EVENT0_ICLR_DIO6_NO_EFFECT                                    \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_GEN_EVENT0_ICLR_DIO6_CLR                                          \
  ((uint32_t)0x00000040U) /* !< Clears DIO6 in RIS register */
/* GPIO_GEN_EVENT0_ICLR[DIO7] Bits */
#define GPIO_GEN_EVENT0_ICLR_DIO7_OFS (7) /* !< DIO7 Offset */
#define GPIO_GEN_EVENT0_ICLR_DIO7_MASK                                         \
  ((uint32_t)0x00000080U) /* !< DIO7 event */
#define GPIO_GEN_EVENT0_ICLR_DIO7_NO_EFFECT                                    \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_GEN_EVENT0_ICLR_DIO7_CLR                                          \
  ((uint32_t)0x00000080U) /* !< Clears DIO7 in RIS register */
/* GPIO_GEN_EVENT0_ICLR[DIO8] Bits */
#define GPIO_GEN_EVENT0_ICLR_DIO8_OFS (8) /* !< DIO8 Offset */
#define GPIO_GEN_EVENT0_ICLR_DIO8_MASK                                         \
  ((uint32_t)0x00000100U) /* !< DIO8 event */
#define GPIO_GEN_EVENT0_ICLR_DIO8_NO_EFFECT                                    \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_GEN_EVENT0_ICLR_DIO8_CLR                                          \
  ((uint32_t)0x00000100U) /* !< Clears DIO8 in RIS register */
/* GPIO_GEN_EVENT0_ICLR[DIO9] Bits */
#define GPIO_GEN_EVENT0_ICLR_DIO9_OFS (9) /* !< DIO9 Offset */
#define GPIO_GEN_EVENT0_ICLR_DIO9_MASK                                         \
  ((uint32_t)0x00000200U) /* !< DIO9 event */
#define GPIO_GEN_EVENT0_ICLR_DIO9_NO_EFFECT                                    \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_GEN_EVENT0_ICLR_DIO9_CLR                                          \
  ((uint32_t)0x00000200U) /* !< Clears DIO9 in RIS register */
/* GPIO_GEN_EVENT0_ICLR[DIO10] Bits */
#define GPIO_GEN_EVENT0_ICLR_DIO10_OFS (10) /* !< DIO10 Offset */
#define GPIO_GEN_EVENT0_ICLR_DIO10_MASK                                        \
  ((uint32_t)0x00000400U) /* !< DIO10 event */
#define GPIO_GEN_EVENT0_ICLR_DIO10_NO_EFFECT                                   \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_GEN_EVENT0_ICLR_DIO10_CLR                                         \
  ((uint32_t)0x00000400U) /* !< Clears DIO10 in RIS register */
/* GPIO_GEN_EVENT0_ICLR[DIO11] Bits */
#define GPIO_GEN_EVENT0_ICLR_DIO11_OFS (11) /* !< DIO11 Offset */
#define GPIO_GEN_EVENT0_ICLR_DIO11_MASK                                        \
  ((uint32_t)0x00000800U) /* !< DIO11 event */
#define GPIO_GEN_EVENT0_ICLR_DIO11_NO_EFFECT                                   \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_GEN_EVENT0_ICLR_DIO11_CLR                                         \
  ((uint32_t)0x00000800U) /* !< Clears DIO11 in RIS register */
/* GPIO_GEN_EVENT0_ICLR[DIO12] Bits */
#define GPIO_GEN_EVENT0_ICLR_DIO12_OFS (12) /* !< DIO12 Offset */
#define GPIO_GEN_EVENT0_ICLR_DIO12_MASK                                        \
  ((uint32_t)0x00001000U) /* !< DIO12 event */
#define GPIO_GEN_EVENT0_ICLR_DIO12_NO_EFFECT                                   \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_GEN_EVENT0_ICLR_DIO12_CLR                                         \
  ((uint32_t)0x00001000U) /* !< Clears DIO12 in RIS register */
/* GPIO_GEN_EVENT0_ICLR[DIO13] Bits */
#define GPIO_GEN_EVENT0_ICLR_DIO13_OFS (13) /* !< DIO13 Offset */
#define GPIO_GEN_EVENT0_ICLR_DIO13_MASK                                        \
  ((uint32_t)0x00002000U) /* !< DIO13 event */
#define GPIO_GEN_EVENT0_ICLR_DIO13_NO_EFFECT                                   \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_GEN_EVENT0_ICLR_DIO13_CLR                                         \
  ((uint32_t)0x00002000U) /* !< Clears DIO13 in RIS register */
/* GPIO_GEN_EVENT0_ICLR[DIO14] Bits */
#define GPIO_GEN_EVENT0_ICLR_DIO14_OFS (14) /* !< DIO14 Offset */
#define GPIO_GEN_EVENT0_ICLR_DIO14_MASK                                        \
  ((uint32_t)0x00004000U) /* !< DIO14 event */
#define GPIO_GEN_EVENT0_ICLR_DIO14_NO_EFFECT                                   \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_GEN_EVENT0_ICLR_DIO14_CLR                                         \
  ((uint32_t)0x00004000U) /* !< Clears DIO14 in RIS register */
/* GPIO_GEN_EVENT0_ICLR[DIO15] Bits */
#define GPIO_GEN_EVENT0_ICLR_DIO15_OFS (15) /* !< DIO15 Offset */
#define GPIO_GEN_EVENT0_ICLR_DIO15_MASK                                        \
  ((uint32_t)0x00008000U) /* !< DIO15 event */
#define GPIO_GEN_EVENT0_ICLR_DIO15_NO_EFFECT                                   \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_GEN_EVENT0_ICLR_DIO15_CLR                                         \
  ((uint32_t)0x00008000U) /* !< Clears DIO15 in RIS register */

/* GPIO_CPU_INT_IIDX Bits */
/* GPIO_CPU_INT_IIDX[STAT] Bits */
#define GPIO_CPU_INT_IIDX_STAT_OFS (0) /* !< STAT Offset */
#define GPIO_CPU_INT_IIDX_STAT_MASK                                            \
  ((uint32_t)0x000000FFU) /* !< Interrupt index status */
#define GPIO_CPU_INT_IIDX_STAT_NO_INTR                                         \
  ((uint32_t)0x00000000U) /* !< No bit is set means there is no                \
                             pending interrupt request */
#define GPIO_CPU_INT_IIDX_STAT_DIO0                                            \
  ((uint32_t)0x00000001U) /* !< DIO0 interrupt */
#define GPIO_CPU_INT_IIDX_STAT_DIO1                                            \
  ((uint32_t)0x00000002U) /* !< DIO1 interrupt */
#define GPIO_CPU_INT_IIDX_STAT_DIO2                                            \
  ((uint32_t)0x00000003U) /* !< DIO2 interrupt */
#define GPIO_CPU_INT_IIDX_STAT_DIO3                                            \
  ((uint32_t)0x00000004U) /* !< DIO3 interrupt */
#define GPIO_CPU_INT_IIDX_STAT_DIO4                                            \
  ((uint32_t)0x00000005U) /* !< DIO4 interrupt */
#define GPIO_CPU_INT_IIDX_STAT_DIO5                                            \
  ((uint32_t)0x00000006U) /* !< DIO5 interrupt */
#define GPIO_CPU_INT_IIDX_STAT_DIO6                                            \
  ((uint32_t)0x00000007U) /* !< DIO6 interrupt */
#define GPIO_CPU_INT_IIDX_STAT_DIO7                                            \
  ((uint32_t)0x00000008U) /* !< DIO7 interrupt */
#define GPIO_CPU_INT_IIDX_STAT_DIO8                                            \
  ((uint32_t)0x00000009U) /* !< DIO8 interrupt */
#define GPIO_CPU_INT_IIDX_STAT_DIO9                                            \
  ((uint32_t)0x0000000AU) /* !< DIO9 interrupt */
#define GPIO_CPU_INT_IIDX_STAT_DIO10                                           \
  ((uint32_t)0x0000000BU) /* !< DIO10 interrupt */
#define GPIO_CPU_INT_IIDX_STAT_DIO11                                           \
  ((uint32_t)0x0000000CU) /* !< DIO11 interrupt */
#define GPIO_CPU_INT_IIDX_STAT_DIO12                                           \
  ((uint32_t)0x0000000DU) /* !< DIO12 interrupt */
#define GPIO_CPU_INT_IIDX_STAT_DIO13                                           \
  ((uint32_t)0x0000000EU) /* !< DIO13 interrupt */
#define GPIO_CPU_INT_IIDX_STAT_DIO14                                           \
  ((uint32_t)0x0000000FU) /* !< DIO14 interrupt */
#define GPIO_CPU_INT_IIDX_STAT_DIO15                                           \
  ((uint32_t)0x00000010U) /* !< DIO15 interrupt */
#define GPIO_CPU_INT_IIDX_STAT_DIO16                                           \
  ((uint32_t)0x00000011U) /* !< DIO16 interrupt */
#define GPIO_CPU_INT_IIDX_STAT_DIO17                                           \
  ((uint32_t)0x00000012U) /* !< DIO17 interrupt */
#define GPIO_CPU_INT_IIDX_STAT_DIO18                                           \
  ((uint32_t)0x00000013U) /* !< DIO18 interrupt */
#define GPIO_CPU_INT_IIDX_STAT_DIO19                                           \
  ((uint32_t)0x00000014U) /* !< DIO19 interrupt */
#define GPIO_CPU_INT_IIDX_STAT_DIO20                                           \
  ((uint32_t)0x00000015U) /* !< DIO20 interrupt */
#define GPIO_CPU_INT_IIDX_STAT_DIO21                                           \
  ((uint32_t)0x00000016U) /* !< DIO21 interrupt */
#define GPIO_CPU_INT_IIDX_STAT_DIO22                                           \
  ((uint32_t)0x00000017U) /* !< DIO22 interrupt */
#define GPIO_CPU_INT_IIDX_STAT_DIO23                                           \
  ((uint32_t)0x00000018U) /* !< DIO23 interrupt */
#define GPIO_CPU_INT_IIDX_STAT_DIO24                                           \
  ((uint32_t)0x00000019U) /* !< DIO24 interrupt */
#define GPIO_CPU_INT_IIDX_STAT_DIO25                                           \
  ((uint32_t)0x0000001AU) /* !< DIO25 interrupt */
#define GPIO_CPU_INT_IIDX_STAT_DIO26                                           \
  ((uint32_t)0x0000001BU) /* !< DIO26 interrupt */
#define GPIO_CPU_INT_IIDX_STAT_DIO27                                           \
  ((uint32_t)0x0000001CU) /* !< DIO27 interrupt */
#define GPIO_CPU_INT_IIDX_STAT_DIO28                                           \
  ((uint32_t)0x0000001DU) /* !< DIO28 interrupt */
#define GPIO_CPU_INT_IIDX_STAT_DIO29                                           \
  ((uint32_t)0x0000001EU) /* !< DIO29 interrupt */
#define GPIO_CPU_INT_IIDX_STAT_DIO30                                           \
  ((uint32_t)0x0000001FU) /* !< DIO30 interrupt */
#define GPIO_CPU_INT_IIDX_STAT_DIO31                                           \
  ((uint32_t)0x00000020U) /* !< DIO31 interrupt */

