luckycyang/mspm0l1306-dev/include/ti/devices/msp/peripherals/hw_gpio.h
/* GPIO_CPU_INT_IMASK Bits */
/* GPIO_CPU_INT_IMASK[DIO0] Bits */
#define GPIO_CPU_INT_IMASK_DIO0_OFS (0) /* !< DIO0 Offset */
#define GPIO_CPU_INT_IMASK_DIO0_MASK                                           \
  ((uint32_t)0x00000001U) /* !< DIO0 event mask */
#define GPIO_CPU_INT_IMASK_DIO0_CLR                                            \
  ((uint32_t)0x00000000U) /* !< Event is masked */
#define GPIO_CPU_INT_IMASK_DIO0_SET                                            \
  ((uint32_t)0x00000001U) /* !< Event is unmasked */
/* GPIO_CPU_INT_IMASK[DIO1] Bits */
#define GPIO_CPU_INT_IMASK_DIO1_OFS (1) /* !< DIO1 Offset */
#define GPIO_CPU_INT_IMASK_DIO1_MASK                                           \
  ((uint32_t)0x00000002U) /* !< DIO1 event mask */
#define GPIO_CPU_INT_IMASK_DIO1_CLR                                            \
  ((uint32_t)0x00000000U) /* !< Event is masked */
#define GPIO_CPU_INT_IMASK_DIO1_SET                                            \
  ((uint32_t)0x00000002U) /* !< Event is unmasked */
/* GPIO_CPU_INT_IMASK[DIO2] Bits */
#define GPIO_CPU_INT_IMASK_DIO2_OFS (2) /* !< DIO2 Offset */
#define GPIO_CPU_INT_IMASK_DIO2_MASK                                           \
  ((uint32_t)0x00000004U) /* !< DIO2 event mask */
#define GPIO_CPU_INT_IMASK_DIO2_CLR                                            \
  ((uint32_t)0x00000000U) /* !< Event is masked */
#define GPIO_CPU_INT_IMASK_DIO2_SET                                            \
  ((uint32_t)0x00000004U) /* !< Event is unmasked */
/* GPIO_CPU_INT_IMASK[DIO3] Bits */
#define GPIO_CPU_INT_IMASK_DIO3_OFS (3) /* !< DIO3 Offset */
#define GPIO_CPU_INT_IMASK_DIO3_MASK                                           \
  ((uint32_t)0x00000008U) /* !< DIO3 event mask */
#define GPIO_CPU_INT_IMASK_DIO3_CLR                                            \
  ((uint32_t)0x00000000U) /* !< Event is masked */
#define GPIO_CPU_INT_IMASK_DIO3_SET                                            \
  ((uint32_t)0x00000008U) /* !< Event is unmasked */
/* GPIO_CPU_INT_IMASK[DIO4] Bits */
#define GPIO_CPU_INT_IMASK_DIO4_OFS (4) /* !< DIO4 Offset */
#define GPIO_CPU_INT_IMASK_DIO4_MASK                                           \
  ((uint32_t)0x00000010U) /* !< DIO4 event mask */
#define GPIO_CPU_INT_IMASK_DIO4_CLR                                            \
  ((uint32_t)0x00000000U) /* !< Event is masked */
#define GPIO_CPU_INT_IMASK_DIO4_SET                                            \
  ((uint32_t)0x00000010U) /* !< Event is unmasked */
/* GPIO_CPU_INT_IMASK[DIO5] Bits */
#define GPIO_CPU_INT_IMASK_DIO5_OFS (5) /* !< DIO5 Offset */
#define GPIO_CPU_INT_IMASK_DIO5_MASK                                           \
  ((uint32_t)0x00000020U) /* !< DIO5 event mask */
#define GPIO_CPU_INT_IMASK_DIO5_CLR                                            \
  ((uint32_t)0x00000000U) /* !< Event is masked */
#define GPIO_CPU_INT_IMASK_DIO5_SET                                            \
  ((uint32_t)0x00000020U) /* !< Event is unmasked */
/* GPIO_CPU_INT_IMASK[DIO6] Bits */
#define GPIO_CPU_INT_IMASK_DIO6_OFS (6) /* !< DIO6 Offset */
#define GPIO_CPU_INT_IMASK_DIO6_MASK                                           \
  ((uint32_t)0x00000040U) /* !< DIO6 event mask */
#define GPIO_CPU_INT_IMASK_DIO6_CLR                                            \
  ((uint32_t)0x00000000U) /* !< Event is masked */
#define GPIO_CPU_INT_IMASK_DIO6_SET                                            \
  ((uint32_t)0x00000040U) /* !< Event is unmasked */
/* GPIO_CPU_INT_IMASK[DIO7] Bits */
#define GPIO_CPU_INT_IMASK_DIO7_OFS (7) /* !< DIO7 Offset */
#define GPIO_CPU_INT_IMASK_DIO7_MASK                                           \
  ((uint32_t)0x00000080U) /* !< DIO7 event mask */
#define GPIO_CPU_INT_IMASK_DIO7_CLR                                            \
  ((uint32_t)0x00000000U) /* !< Event is masked */
#define GPIO_CPU_INT_IMASK_DIO7_SET                                            \
  ((uint32_t)0x00000080U) /* !< Event is unmasked */
/* GPIO_CPU_INT_IMASK[DIO8] Bits */
#define GPIO_CPU_INT_IMASK_DIO8_OFS (8) /* !< DIO8 Offset */
#define GPIO_CPU_INT_IMASK_DIO8_MASK                                           \
  ((uint32_t)0x00000100U) /* !< DIO8 event mask */
#define GPIO_CPU_INT_IMASK_DIO8_CLR                                            \
  ((uint32_t)0x00000000U) /* !< Event is masked */
#define GPIO_CPU_INT_IMASK_DIO8_SET                                            \
  ((uint32_t)0x00000100U) /* !< Event is unmasked */
/* GPIO_CPU_INT_IMASK[DIO9] Bits */
#define GPIO_CPU_INT_IMASK_DIO9_OFS (9) /* !< DIO9 Offset */
#define GPIO_CPU_INT_IMASK_DIO9_MASK                                           \
  ((uint32_t)0x00000200U) /* !< DIO9 event mask */
#define GPIO_CPU_INT_IMASK_DIO9_CLR                                            \
  ((uint32_t)0x00000000U) /* !< Event is masked */
#define GPIO_CPU_INT_IMASK_DIO9_SET                                            \
  ((uint32_t)0x00000200U) /* !< Event is unmasked */
/* GPIO_CPU_INT_IMASK[DIO10] Bits */
#define GPIO_CPU_INT_IMASK_DIO10_OFS (10) /* !< DIO10 Offset */
#define GPIO_CPU_INT_IMASK_DIO10_MASK                                          \
  ((uint32_t)0x00000400U) /* !< DIO10 event mask */
#define GPIO_CPU_INT_IMASK_DIO10_CLR                                           \
  ((uint32_t)0x00000000U) /* !< Event is masked */
#define GPIO_CPU_INT_IMASK_DIO10_SET                                           \
  ((uint32_t)0x00000400U) /* !< Event is unmasked */
/* GPIO_CPU_INT_IMASK[DIO11] Bits */
#define GPIO_CPU_INT_IMASK_DIO11_OFS (11) /* !< DIO11 Offset */
#define GPIO_CPU_INT_IMASK_DIO11_MASK                                          \
  ((uint32_t)0x00000800U) /* !< DIO11 event mask */
#define GPIO_CPU_INT_IMASK_DIO11_CLR                                           \
  ((uint32_t)0x00000000U) /* !< Event is masked */
#define GPIO_CPU_INT_IMASK_DIO11_SET                                           \
  ((uint32_t)0x00000800U) /* !< Event is unmasked */
/* GPIO_CPU_INT_IMASK[DIO12] Bits */
#define GPIO_CPU_INT_IMASK_DIO12_OFS (12) /* !< DIO12 Offset */
#define GPIO_CPU_INT_IMASK_DIO12_MASK                                          \
  ((uint32_t)0x00001000U) /* !< DIO12 event mask */
#define GPIO_CPU_INT_IMASK_DIO12_CLR                                           \
  ((uint32_t)0x00000000U) /* !< Event is masked */
#define GPIO_CPU_INT_IMASK_DIO12_SET                                           \
  ((uint32_t)0x00001000U) /* !< Event is unmasked */
/* GPIO_CPU_INT_IMASK[DIO13] Bits */
#define GPIO_CPU_INT_IMASK_DIO13_OFS (13) /* !< DIO13 Offset */
#define GPIO_CPU_INT_IMASK_DIO13_MASK                                          \
  ((uint32_t)0x00002000U) /* !< DIO13 event mask */
#define GPIO_CPU_INT_IMASK_DIO13_CLR                                           \
  ((uint32_t)0x00000000U) /* !< Event is masked */
#define GPIO_CPU_INT_IMASK_DIO13_SET                                           \
  ((uint32_t)0x00002000U) /* !< Event is unmasked */
/* GPIO_CPU_INT_IMASK[DIO14] Bits */
#define GPIO_CPU_INT_IMASK_DIO14_OFS (14) /* !< DIO14 Offset */
#define GPIO_CPU_INT_IMASK_DIO14_MASK                                          \
  ((uint32_t)0x00004000U) /* !< DIO14 event mask */
#define GPIO_CPU_INT_IMASK_DIO14_CLR                                           \
  ((uint32_t)0x00000000U) /* !< Event is masked */
#define GPIO_CPU_INT_IMASK_DIO14_SET                                           \
  ((uint32_t)0x00004000U) /* !< Event is unmasked */
/* GPIO_CPU_INT_IMASK[DIO15] Bits */
#define GPIO_CPU_INT_IMASK_DIO15_OFS (15) /* !< DIO15 Offset */
#define GPIO_CPU_INT_IMASK_DIO15_MASK                                          \
  ((uint32_t)0x00008000U) /* !< DIO15 event mask */
#define GPIO_CPU_INT_IMASK_DIO15_CLR                                           \
  ((uint32_t)0x00000000U) /* !< Event is masked */
#define GPIO_CPU_INT_IMASK_DIO15_SET                                           \
  ((uint32_t)0x00008000U) /* !< Event is unmasked */
/* GPIO_CPU_INT_IMASK[DIO16] Bits */
#define GPIO_CPU_INT_IMASK_DIO16_OFS (16) /* !< DIO16 Offset */
#define GPIO_CPU_INT_IMASK_DIO16_MASK                                          \
  ((uint32_t)0x00010000U) /* !< DIO16 event mask */
#define GPIO_CPU_INT_IMASK_DIO16_CLR                                           \
  ((uint32_t)0x00000000U) /* !< Event is masked */
#define GPIO_CPU_INT_IMASK_DIO16_SET                                           \
  ((uint32_t)0x00010000U) /* !< Event is unmasked */
/* GPIO_CPU_INT_IMASK[DIO17] Bits */
#define GPIO_CPU_INT_IMASK_DIO17_OFS (17) /* !< DIO17 Offset */
#define GPIO_CPU_INT_IMASK_DIO17_MASK                                          \
  ((uint32_t)0x00020000U) /* !< DIO17 event mask */
#define GPIO_CPU_INT_IMASK_DIO17_CLR                                           \
  ((uint32_t)0x00000000U) /* !< Event is masked */
#define GPIO_CPU_INT_IMASK_DIO17_SET                                           \
  ((uint32_t)0x00020000U) /* !< Event is unmasked */
/* GPIO_CPU_INT_IMASK[DIO18] Bits */
#define GPIO_CPU_INT_IMASK_DIO18_OFS (18) /* !< DIO18 Offset */
#define GPIO_CPU_INT_IMASK_DIO18_MASK                                          \
  ((uint32_t)0x00040000U) /* !< DIO18 event mask */
#define GPIO_CPU_INT_IMASK_DIO18_CLR                                           \
  ((uint32_t)0x00000000U) /* !< Event is masked */
#define GPIO_CPU_INT_IMASK_DIO18_SET                                           \
  ((uint32_t)0x00040000U) /* !< Event is unmasked */
/* GPIO_CPU_INT_IMASK[DIO19] Bits */
#define GPIO_CPU_INT_IMASK_DIO19_OFS (19) /* !< DIO19 Offset */
#define GPIO_CPU_INT_IMASK_DIO19_MASK                                          \
  ((uint32_t)0x00080000U) /* !< DIO19 event mask */
#define GPIO_CPU_INT_IMASK_DIO19_CLR                                           \
  ((uint32_t)0x00000000U) /* !< Event is masked */
#define GPIO_CPU_INT_IMASK_DIO19_SET                                           \
  ((uint32_t)0x00080000U) /* !< Event is unmasked */
/* GPIO_CPU_INT_IMASK[DIO20] Bits */
#define GPIO_CPU_INT_IMASK_DIO20_OFS (20) /* !< DIO20 Offset */
#define GPIO_CPU_INT_IMASK_DIO20_MASK                                          \
  ((uint32_t)0x00100000U) /* !< DIO20 event mask */
#define GPIO_CPU_INT_IMASK_DIO20_CLR                                           \
  ((uint32_t)0x00000000U) /* !< Event is masked */
#define GPIO_CPU_INT_IMASK_DIO20_SET                                           \
  ((uint32_t)0x00100000U) /* !< Event is unmasked */
/* GPIO_CPU_INT_IMASK[DIO21] Bits */
#define GPIO_CPU_INT_IMASK_DIO21_OFS (21) /* !< DIO21 Offset */
#define GPIO_CPU_INT_IMASK_DIO21_MASK                                          \
  ((uint32_t)0x00200000U) /* !< DIO21 event mask */
#define GPIO_CPU_INT_IMASK_DIO21_CLR                                           \
  ((uint32_t)0x00000000U) /* !< Event is masked */
#define GPIO_CPU_INT_IMASK_DIO21_SET                                           \
  ((uint32_t)0x00200000U) /* !< Event is unmasked */
/* GPIO_CPU_INT_IMASK[DIO22] Bits */
#define GPIO_CPU_INT_IMASK_DIO22_OFS (22) /* !< DIO22 Offset */
#define GPIO_CPU_INT_IMASK_DIO22_MASK                                          \
  ((uint32_t)0x00400000U) /* !< DIO22 event mask */
#define GPIO_CPU_INT_IMASK_DIO22_CLR                                           \
  ((uint32_t)0x00000000U) /* !< Event is masked */
#define GPIO_CPU_INT_IMASK_DIO22_SET                                           \
  ((uint32_t)0x00400000U) /* !< Event is unmasked */
/* GPIO_CPU_INT_IMASK[DIO23] Bits */
#define GPIO_CPU_INT_IMASK_DIO23_OFS (23) /* !< DIO23 Offset */
#define GPIO_CPU_INT_IMASK_DIO23_MASK                                          \
  ((uint32_t)0x00800000U) /* !< DIO23 event mask */
#define GPIO_CPU_INT_IMASK_DIO23_CLR                                           \
  ((uint32_t)0x00000000U) /* !< Event is masked */
#define GPIO_CPU_INT_IMASK_DIO23_SET                                           \
  ((uint32_t)0x00800000U) /* !< Event is unmasked */
/* GPIO_CPU_INT_IMASK[DIO24] Bits */
#define GPIO_CPU_INT_IMASK_DIO24_OFS (24) /* !< DIO24 Offset */
#define GPIO_CPU_INT_IMASK_DIO24_MASK                                          \
  ((uint32_t)0x01000000U) /* !< DIO24 event mask */
#define GPIO_CPU_INT_IMASK_DIO24_CLR                                           \
  ((uint32_t)0x00000000U) /* !< Event is masked */
#define GPIO_CPU_INT_IMASK_DIO24_SET                                           \
  ((uint32_t)0x01000000U) /* !< Event is unmasked */
/* GPIO_CPU_INT_IMASK[DIO25] Bits */
#define GPIO_CPU_INT_IMASK_DIO25_OFS (25) /* !< DIO25 Offset */
#define GPIO_CPU_INT_IMASK_DIO25_MASK                                          \
  ((uint32_t)0x02000000U) /* !< DIO25 event mask */
#define GPIO_CPU_INT_IMASK_DIO25_CLR                                           \
  ((uint32_t)0x00000000U) /* !< Event is masked */
#define GPIO_CPU_INT_IMASK_DIO25_SET                                           \
  ((uint32_t)0x02000000U) /* !< Event is unmasked */
/* GPIO_CPU_INT_IMASK[DIO26] Bits */
#define GPIO_CPU_INT_IMASK_DIO26_OFS (26) /* !< DIO26 Offset */
#define GPIO_CPU_INT_IMASK_DIO26_MASK                                          \
  ((uint32_t)0x04000000U) /* !< DIO26 event mask */
#define GPIO_CPU_INT_IMASK_DIO26_CLR                                           \
  ((uint32_t)0x00000000U) /* !< Event is masked */
#define GPIO_CPU_INT_IMASK_DIO26_SET                                           \
  ((uint32_t)0x04000000U) /* !< Event is unmasked */
/* GPIO_CPU_INT_IMASK[DIO27] Bits */
#define GPIO_CPU_INT_IMASK_DIO27_OFS (27) /* !< DIO27 Offset */
#define GPIO_CPU_INT_IMASK_DIO27_MASK                                          \
  ((uint32_t)0x08000000U) /* !< DIO27 event mask */
#define GPIO_CPU_INT_IMASK_DIO27_CLR                                           \
  ((uint32_t)0x00000000U) /* !< Event is masked */
#define GPIO_CPU_INT_IMASK_DIO27_SET                                           \
  ((uint32_t)0x08000000U) /* !< Event is unmasked */
/* GPIO_CPU_INT_IMASK[DIO28] Bits */
#define GPIO_CPU_INT_IMASK_DIO28_OFS (28) /* !< DIO28 Offset */
#define GPIO_CPU_INT_IMASK_DIO28_MASK                                          \
  ((uint32_t)0x10000000U) /* !< DIO28 event mask */
#define GPIO_CPU_INT_IMASK_DIO28_CLR                                           \
  ((uint32_t)0x00000000U) /* !< Event is masked */
#define GPIO_CPU_INT_IMASK_DIO28_SET                                           \
  ((uint32_t)0x10000000U) /* !< Event is unmasked */
/* GPIO_CPU_INT_IMASK[DIO29] Bits */
#define GPIO_CPU_INT_IMASK_DIO29_OFS (29) /* !< DIO29 Offset */
#define GPIO_CPU_INT_IMASK_DIO29_MASK                                          \
  ((uint32_t)0x20000000U) /* !< DIO29 event mask */
#define GPIO_CPU_INT_IMASK_DIO29_CLR                                           \
  ((uint32_t)0x00000000U) /* !< Event is masked */
#define GPIO_CPU_INT_IMASK_DIO29_SET                                           \
  ((uint32_t)0x20000000U) /* !< Event is unmasked */
/* GPIO_CPU_INT_IMASK[DIO30] Bits */
#define GPIO_CPU_INT_IMASK_DIO30_OFS (30) /* !< DIO30 Offset */
#define GPIO_CPU_INT_IMASK_DIO30_MASK                                          \
  ((uint32_t)0x40000000U) /* !< DIO30 event mask */
#define GPIO_CPU_INT_IMASK_DIO30_CLR                                           \
  ((uint32_t)0x00000000U) /* !< Event is masked */
#define GPIO_CPU_INT_IMASK_DIO30_SET                                           \
  ((uint32_t)0x40000000U) /* !< Event is unmasked */
/* GPIO_CPU_INT_IMASK[DIO31] Bits */
#define GPIO_CPU_INT_IMASK_DIO31_OFS (31) /* !< DIO31 Offset */
#define GPIO_CPU_INT_IMASK_DIO31_MASK                                          \
  ((uint32_t)0x80000000U) /* !< DIO31 event mask */
#define GPIO_CPU_INT_IMASK_DIO31_CLR                                           \
  ((uint32_t)0x00000000U) /* !< Event is masked */
#define GPIO_CPU_INT_IMASK_DIO31_SET                                           \
  ((uint32_t)0x80000000U) /* !< Event is unmasked */

