luckycyang/mspm0l1306-dev/include/ti/devices/msp/peripherals/hw_gpio.h
/* GPIO_CPU_INT_ISET Bits */
/* GPIO_CPU_INT_ISET[DIO0] Bits */
#define GPIO_CPU_INT_ISET_DIO0_OFS (0) /* !< DIO0 Offset */
#define GPIO_CPU_INT_ISET_DIO0_MASK                                            \
  ((uint32_t)0x00000001U) /* !< DIO0 event                                     \
                           */
#define GPIO_CPU_INT_ISET_DIO0_NO_EFFECT                                       \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_CPU_INT_ISET_DIO0_SET                                             \
  ((uint32_t)0x00000001U) /* !< Sets DIO0 in RIS register */
/* GPIO_CPU_INT_ISET[DIO1] Bits */
#define GPIO_CPU_INT_ISET_DIO1_OFS (1) /* !< DIO1 Offset */
#define GPIO_CPU_INT_ISET_DIO1_MASK                                            \
  ((uint32_t)0x00000002U) /* !< DIO1 event                                     \
                           */
#define GPIO_CPU_INT_ISET_DIO1_NO_EFFECT                                       \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_CPU_INT_ISET_DIO1_SET                                             \
  ((uint32_t)0x00000002U) /* !< Sets DIO1 in RIS register */
/* GPIO_CPU_INT_ISET[DIO2] Bits */
#define GPIO_CPU_INT_ISET_DIO2_OFS (2) /* !< DIO2 Offset */
#define GPIO_CPU_INT_ISET_DIO2_MASK                                            \
  ((uint32_t)0x00000004U) /* !< DIO2 event                                     \
                           */
#define GPIO_CPU_INT_ISET_DIO2_NO_EFFECT                                       \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_CPU_INT_ISET_DIO2_SET                                             \
  ((uint32_t)0x00000004U) /* !< Sets DIO2 in RIS register */
/* GPIO_CPU_INT_ISET[DIO3] Bits */
#define GPIO_CPU_INT_ISET_DIO3_OFS (3) /* !< DIO3 Offset */
#define GPIO_CPU_INT_ISET_DIO3_MASK                                            \
  ((uint32_t)0x00000008U) /* !< DIO3 event                                     \
                           */
#define GPIO_CPU_INT_ISET_DIO3_NO_EFFECT                                       \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_CPU_INT_ISET_DIO3_SET                                             \
  ((uint32_t)0x00000008U) /* !< Sets DIO3 in RIS register */
/* GPIO_CPU_INT_ISET[DIO4] Bits */
#define GPIO_CPU_INT_ISET_DIO4_OFS (4) /* !< DIO4 Offset */
#define GPIO_CPU_INT_ISET_DIO4_MASK                                            \
  ((uint32_t)0x00000010U) /* !< DIO4 event                                     \
                           */
#define GPIO_CPU_INT_ISET_DIO4_NO_EFFECT                                       \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_CPU_INT_ISET_DIO4_SET                                             \
  ((uint32_t)0x00000010U) /* !< Sets DIO4 in RIS register */
/* GPIO_CPU_INT_ISET[DIO5] Bits */
#define GPIO_CPU_INT_ISET_DIO5_OFS (5) /* !< DIO5 Offset */
#define GPIO_CPU_INT_ISET_DIO5_MASK                                            \
  ((uint32_t)0x00000020U) /* !< DIO5 event                                     \
                           */
#define GPIO_CPU_INT_ISET_DIO5_NO_EFFECT                                       \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_CPU_INT_ISET_DIO5_SET                                             \
  ((uint32_t)0x00000020U) /* !< Sets DIO5 in RIS register */
/* GPIO_CPU_INT_ISET[DIO6] Bits */
#define GPIO_CPU_INT_ISET_DIO6_OFS (6) /* !< DIO6 Offset */
#define GPIO_CPU_INT_ISET_DIO6_MASK                                            \
  ((uint32_t)0x00000040U) /* !< DIO6 event                                     \
                           */
#define GPIO_CPU_INT_ISET_DIO6_NO_EFFECT                                       \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_CPU_INT_ISET_DIO6_SET                                             \
  ((uint32_t)0x00000040U) /* !< Sets DIO6 in RIS register */
/* GPIO_CPU_INT_ISET[DIO7] Bits */
#define GPIO_CPU_INT_ISET_DIO7_OFS (7) /* !< DIO7 Offset */
#define GPIO_CPU_INT_ISET_DIO7_MASK                                            \
  ((uint32_t)0x00000080U) /* !< DIO7 event                                     \
                           */
#define GPIO_CPU_INT_ISET_DIO7_NO_EFFECT                                       \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_CPU_INT_ISET_DIO7_SET                                             \
  ((uint32_t)0x00000080U) /* !< Sets DIO7 in RIS register */
/* GPIO_CPU_INT_ISET[DIO8] Bits */
#define GPIO_CPU_INT_ISET_DIO8_OFS (8) /* !< DIO8 Offset */
#define GPIO_CPU_INT_ISET_DIO8_MASK                                            \
  ((uint32_t)0x00000100U) /* !< DIO8 event                                     \
                           */
#define GPIO_CPU_INT_ISET_DIO8_NO_EFFECT                                       \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_CPU_INT_ISET_DIO8_SET                                             \
  ((uint32_t)0x00000100U) /* !< Sets DIO8 in RIS register */
/* GPIO_CPU_INT_ISET[DIO9] Bits */
#define GPIO_CPU_INT_ISET_DIO9_OFS (9) /* !< DIO9 Offset */
#define GPIO_CPU_INT_ISET_DIO9_MASK                                            \
  ((uint32_t)0x00000200U) /* !< DIO9 event                                     \
                           */
#define GPIO_CPU_INT_ISET_DIO9_NO_EFFECT                                       \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_CPU_INT_ISET_DIO9_SET                                             \
  ((uint32_t)0x00000200U) /* !< Sets DIO9 in RIS register */
/* GPIO_CPU_INT_ISET[DIO10] Bits */
#define GPIO_CPU_INT_ISET_DIO10_OFS (10) /* !< DIO10 Offset */
#define GPIO_CPU_INT_ISET_DIO10_MASK                                           \
  ((uint32_t)0x00000400U) /* !< DIO10 event */
#define GPIO_CPU_INT_ISET_DIO10_NO_EFFECT                                      \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_CPU_INT_ISET_DIO10_SET                                            \
  ((uint32_t)0x00000400U) /* !< Sets DIO10 in RIS register */
/* GPIO_CPU_INT_ISET[DIO11] Bits */
#define GPIO_CPU_INT_ISET_DIO11_OFS (11) /* !< DIO11 Offset */
#define GPIO_CPU_INT_ISET_DIO11_MASK                                           \
  ((uint32_t)0x00000800U) /* !< DIO11 event */
#define GPIO_CPU_INT_ISET_DIO11_NO_EFFECT                                      \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_CPU_INT_ISET_DIO11_SET                                            \
  ((uint32_t)0x00000800U) /* !< Sets DIO11 in RIS register */
/* GPIO_CPU_INT_ISET[DIO12] Bits */
#define GPIO_CPU_INT_ISET_DIO12_OFS (12) /* !< DIO12 Offset */
#define GPIO_CPU_INT_ISET_DIO12_MASK                                           \
  ((uint32_t)0x00001000U) /* !< DIO12 event */
#define GPIO_CPU_INT_ISET_DIO12_NO_EFFECT                                      \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_CPU_INT_ISET_DIO12_SET                                            \
  ((uint32_t)0x00001000U) /* !< Sets DIO12 in RIS register */
/* GPIO_CPU_INT_ISET[DIO13] Bits */
#define GPIO_CPU_INT_ISET_DIO13_OFS (13) /* !< DIO13 Offset */
#define GPIO_CPU_INT_ISET_DIO13_MASK                                           \
  ((uint32_t)0x00002000U) /* !< DIO13 event */
#define GPIO_CPU_INT_ISET_DIO13_NO_EFFECT                                      \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_CPU_INT_ISET_DIO13_SET                                            \
  ((uint32_t)0x00002000U) /* !< Sets DIO13 in RIS register */
/* GPIO_CPU_INT_ISET[DIO14] Bits */
#define GPIO_CPU_INT_ISET_DIO14_OFS (14) /* !< DIO14 Offset */
#define GPIO_CPU_INT_ISET_DIO14_MASK                                           \
  ((uint32_t)0x00004000U) /* !< DIO14 event */
#define GPIO_CPU_INT_ISET_DIO14_NO_EFFECT                                      \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_CPU_INT_ISET_DIO14_SET                                            \
  ((uint32_t)0x00004000U) /* !< Sets DIO14 in RIS register */
/* GPIO_CPU_INT_ISET[DIO15] Bits */
#define GPIO_CPU_INT_ISET_DIO15_OFS (15) /* !< DIO15 Offset */
#define GPIO_CPU_INT_ISET_DIO15_MASK                                           \
  ((uint32_t)0x00008000U) /* !< DIO15 event */
#define GPIO_CPU_INT_ISET_DIO15_NO_EFFECT                                      \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_CPU_INT_ISET_DIO15_SET                                            \
  ((uint32_t)0x00008000U) /* !< Sets DIO15 in RIS register */
/* GPIO_CPU_INT_ISET[DIO16] Bits */
#define GPIO_CPU_INT_ISET_DIO16_OFS (16) /* !< DIO16 Offset */
#define GPIO_CPU_INT_ISET_DIO16_MASK                                           \
  ((uint32_t)0x00010000U) /* !< DIO16 event */
#define GPIO_CPU_INT_ISET_DIO16_NO_EFFECT                                      \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_CPU_INT_ISET_DIO16_SET                                            \
  ((uint32_t)0x00010000U) /* !< Sets DIO16 in RIS register */
/* GPIO_CPU_INT_ISET[DIO17] Bits */
#define GPIO_CPU_INT_ISET_DIO17_OFS (17) /* !< DIO17 Offset */
#define GPIO_CPU_INT_ISET_DIO17_MASK                                           \
  ((uint32_t)0x00020000U) /* !< DIO17 event */
#define GPIO_CPU_INT_ISET_DIO17_NO_EFFECT                                      \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_CPU_INT_ISET_DIO17_SET                                            \
  ((uint32_t)0x00020000U) /* !< Sets DIO17 in RIS register */
/* GPIO_CPU_INT_ISET[DIO18] Bits */
#define GPIO_CPU_INT_ISET_DIO18_OFS (18) /* !< DIO18 Offset */
#define GPIO_CPU_INT_ISET_DIO18_MASK                                           \
  ((uint32_t)0x00040000U) /* !< DIO18 event */
#define GPIO_CPU_INT_ISET_DIO18_NO_EFFECT                                      \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_CPU_INT_ISET_DIO18_SET                                            \
  ((uint32_t)0x00040000U) /* !< Sets DIO18 in RIS register */
/* GPIO_CPU_INT_ISET[DIO19] Bits */
#define GPIO_CPU_INT_ISET_DIO19_OFS (19) /* !< DIO19 Offset */
#define GPIO_CPU_INT_ISET_DIO19_MASK                                           \
  ((uint32_t)0x00080000U) /* !< DIO19 event */
#define GPIO_CPU_INT_ISET_DIO19_NO_EFFECT                                      \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_CPU_INT_ISET_DIO19_SET                                            \
  ((uint32_t)0x00080000U) /* !< Sets DIO19 in RIS register */
/* GPIO_CPU_INT_ISET[DIO20] Bits */
#define GPIO_CPU_INT_ISET_DIO20_OFS (20) /* !< DIO20 Offset */
#define GPIO_CPU_INT_ISET_DIO20_MASK                                           \
  ((uint32_t)0x00100000U) /* !< DIO20 event */
#define GPIO_CPU_INT_ISET_DIO20_NO_EFFECT                                      \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_CPU_INT_ISET_DIO20_SET                                            \
  ((uint32_t)0x00100000U) /* !< Sets DIO20 in RIS register */
/* GPIO_CPU_INT_ISET[DIO21] Bits */
#define GPIO_CPU_INT_ISET_DIO21_OFS (21) /* !< DIO21 Offset */
#define GPIO_CPU_INT_ISET_DIO21_MASK                                           \
  ((uint32_t)0x00200000U) /* !< DIO21 event */
#define GPIO_CPU_INT_ISET_DIO21_NO_EFFECT                                      \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_CPU_INT_ISET_DIO21_SET                                            \
  ((uint32_t)0x00200000U) /* !< Sets DIO21 in RIS register */
/* GPIO_CPU_INT_ISET[DIO22] Bits */
#define GPIO_CPU_INT_ISET_DIO22_OFS (22) /* !< DIO22 Offset */
#define GPIO_CPU_INT_ISET_DIO22_MASK                                           \
  ((uint32_t)0x00400000U) /* !< DIO22 event */
#define GPIO_CPU_INT_ISET_DIO22_NO_EFFECT                                      \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_CPU_INT_ISET_DIO22_SET                                            \
  ((uint32_t)0x00400000U) /* !< Sets DIO22 in RIS register */
/* GPIO_CPU_INT_ISET[DIO23] Bits */
#define GPIO_CPU_INT_ISET_DIO23_OFS (23) /* !< DIO23 Offset */
#define GPIO_CPU_INT_ISET_DIO23_MASK                                           \
  ((uint32_t)0x00800000U) /* !< DIO23 event */
#define GPIO_CPU_INT_ISET_DIO23_NO_EFFECT                                      \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_CPU_INT_ISET_DIO23_SET                                            \
  ((uint32_t)0x00800000U) /* !< Sets DIO23 in RIS register */
/* GPIO_CPU_INT_ISET[DIO24] Bits */
#define GPIO_CPU_INT_ISET_DIO24_OFS (24) /* !< DIO24 Offset */
#define GPIO_CPU_INT_ISET_DIO24_MASK                                           \
  ((uint32_t)0x01000000U) /* !< DIO24 event */
#define GPIO_CPU_INT_ISET_DIO24_NO_EFFECT                                      \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_CPU_INT_ISET_DIO24_SET                                            \
  ((uint32_t)0x01000000U) /* !< Sets DIO24 in RIS register */
/* GPIO_CPU_INT_ISET[DIO25] Bits */
#define GPIO_CPU_INT_ISET_DIO25_OFS (25) /* !< DIO25 Offset */
#define GPIO_CPU_INT_ISET_DIO25_MASK                                           \
  ((uint32_t)0x02000000U) /* !< DIO25 event */
#define GPIO_CPU_INT_ISET_DIO25_NO_EFFECT                                      \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_CPU_INT_ISET_DIO25_SET                                            \
  ((uint32_t)0x02000000U) /* !< Sets DIO25 in RIS register */
/* GPIO_CPU_INT_ISET[DIO26] Bits */
#define GPIO_CPU_INT_ISET_DIO26_OFS (26) /* !< DIO26 Offset */
#define GPIO_CPU_INT_ISET_DIO26_MASK                                           \
  ((uint32_t)0x04000000U) /* !< DIO26 event */
#define GPIO_CPU_INT_ISET_DIO26_NO_EFFECT                                      \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_CPU_INT_ISET_DIO26_SET                                            \
  ((uint32_t)0x04000000U) /* !< Sets DIO26 in RIS register */
/* GPIO_CPU_INT_ISET[DIO27] Bits */
#define GPIO_CPU_INT_ISET_DIO27_OFS (27) /* !< DIO27 Offset */
#define GPIO_CPU_INT_ISET_DIO27_MASK                                           \
  ((uint32_t)0x08000000U) /* !< DIO27 event */
#define GPIO_CPU_INT_ISET_DIO27_NO_EFFECT                                      \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_CPU_INT_ISET_DIO27_SET                                            \
  ((uint32_t)0x08000000U) /* !< Sets DIO27 in RIS register */
/* GPIO_CPU_INT_ISET[DIO28] Bits */
#define GPIO_CPU_INT_ISET_DIO28_OFS (28) /* !< DIO28 Offset */
#define GPIO_CPU_INT_ISET_DIO28_MASK                                           \
  ((uint32_t)0x10000000U) /* !< DIO28 event */
#define GPIO_CPU_INT_ISET_DIO28_NO_EFFECT                                      \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_CPU_INT_ISET_DIO28_SET                                            \
  ((uint32_t)0x10000000U) /* !< Sets DIO28 in RIS register */
/* GPIO_CPU_INT_ISET[DIO29] Bits */
#define GPIO_CPU_INT_ISET_DIO29_OFS (29) /* !< DIO29 Offset */
#define GPIO_CPU_INT_ISET_DIO29_MASK                                           \
  ((uint32_t)0x20000000U) /* !< DIO29 event */
#define GPIO_CPU_INT_ISET_DIO29_NO_EFFECT                                      \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_CPU_INT_ISET_DIO29_SET                                            \
  ((uint32_t)0x20000000U) /* !< Sets DIO29 in RIS register */
/* GPIO_CPU_INT_ISET[DIO30] Bits */
#define GPIO_CPU_INT_ISET_DIO30_OFS (30) /* !< DIO30 Offset */
#define GPIO_CPU_INT_ISET_DIO30_MASK                                           \
  ((uint32_t)0x40000000U) /* !< DIO30 event */
#define GPIO_CPU_INT_ISET_DIO30_NO_EFFECT                                      \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_CPU_INT_ISET_DIO30_SET                                            \
  ((uint32_t)0x40000000U) /* !< Sets DIO30 in RIS register */
/* GPIO_CPU_INT_ISET[DIO31] Bits */
#define GPIO_CPU_INT_ISET_DIO31_OFS (31) /* !< DIO31 Offset */
#define GPIO_CPU_INT_ISET_DIO31_MASK                                           \
  ((uint32_t)0x80000000U) /* !< DIO31 event */
#define GPIO_CPU_INT_ISET_DIO31_NO_EFFECT                                      \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_CPU_INT_ISET_DIO31_SET                                            \
  ((uint32_t)0x80000000U) /* !< Sets DIO31 in RIS register */

