luckycyang/mspm0l1306-dev/include/ti/devices/msp/peripherals/hw_gpio.h
/* GPIO_CPU_INT_ICLR Bits */
/* GPIO_CPU_INT_ICLR[DIO0] Bits */
#define GPIO_CPU_INT_ICLR_DIO0_OFS (0) /* !< DIO0 Offset */
#define GPIO_CPU_INT_ICLR_DIO0_MASK                                            \
  ((uint32_t)0x00000001U) /* !< DIO0 event                                     \
                           */
#define GPIO_CPU_INT_ICLR_DIO0_NO_EFFECT                                       \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_CPU_INT_ICLR_DIO0_CLR                                             \
  ((uint32_t)0x00000001U) /* !< Clears DIO0 in RIS register */
/* GPIO_CPU_INT_ICLR[DIO1] Bits */
#define GPIO_CPU_INT_ICLR_DIO1_OFS (1) /* !< DIO1 Offset */
#define GPIO_CPU_INT_ICLR_DIO1_MASK                                            \
  ((uint32_t)0x00000002U) /* !< DIO1 event                                     \
                           */
#define GPIO_CPU_INT_ICLR_DIO1_NO_EFFECT                                       \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_CPU_INT_ICLR_DIO1_CLR                                             \
  ((uint32_t)0x00000002U) /* !< Clears DIO1 in RIS register */
/* GPIO_CPU_INT_ICLR[DIO2] Bits */
#define GPIO_CPU_INT_ICLR_DIO2_OFS (2) /* !< DIO2 Offset */
#define GPIO_CPU_INT_ICLR_DIO2_MASK                                            \
  ((uint32_t)0x00000004U) /* !< DIO2 event                                     \
                           */
#define GPIO_CPU_INT_ICLR_DIO2_NO_EFFECT                                       \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_CPU_INT_ICLR_DIO2_CLR                                             \
  ((uint32_t)0x00000004U) /* !< Clears DIO2 in RIS register */
/* GPIO_CPU_INT_ICLR[DIO3] Bits */
#define GPIO_CPU_INT_ICLR_DIO3_OFS (3) /* !< DIO3 Offset */
#define GPIO_CPU_INT_ICLR_DIO3_MASK                                            \
  ((uint32_t)0x00000008U) /* !< DIO3 event                                     \
                           */
#define GPIO_CPU_INT_ICLR_DIO3_NO_EFFECT                                       \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_CPU_INT_ICLR_DIO3_CLR                                             \
  ((uint32_t)0x00000008U) /* !< Clears DIO3 in RIS register */
/* GPIO_CPU_INT_ICLR[DIO4] Bits */
#define GPIO_CPU_INT_ICLR_DIO4_OFS (4) /* !< DIO4 Offset */
#define GPIO_CPU_INT_ICLR_DIO4_MASK                                            \
  ((uint32_t)0x00000010U) /* !< DIO4 event                                     \
                           */
#define GPIO_CPU_INT_ICLR_DIO4_NO_EFFECT                                       \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_CPU_INT_ICLR_DIO4_CLR                                             \
  ((uint32_t)0x00000010U) /* !< Clears DIO4 in RIS register */
/* GPIO_CPU_INT_ICLR[DIO5] Bits */
#define GPIO_CPU_INT_ICLR_DIO5_OFS (5) /* !< DIO5 Offset */
#define GPIO_CPU_INT_ICLR_DIO5_MASK                                            \
  ((uint32_t)0x00000020U) /* !< DIO5 event                                     \
                           */
#define GPIO_CPU_INT_ICLR_DIO5_NO_EFFECT                                       \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_CPU_INT_ICLR_DIO5_CLR                                             \
  ((uint32_t)0x00000020U) /* !< Clears DIO5 in RIS register */
/* GPIO_CPU_INT_ICLR[DIO6] Bits */
#define GPIO_CPU_INT_ICLR_DIO6_OFS (6) /* !< DIO6 Offset */
#define GPIO_CPU_INT_ICLR_DIO6_MASK                                            \
  ((uint32_t)0x00000040U) /* !< DIO6 event                                     \
                           */
#define GPIO_CPU_INT_ICLR_DIO6_NO_EFFECT                                       \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_CPU_INT_ICLR_DIO6_CLR                                             \
  ((uint32_t)0x00000040U) /* !< Clears DIO6 in RIS register */
/* GPIO_CPU_INT_ICLR[DIO7] Bits */
#define GPIO_CPU_INT_ICLR_DIO7_OFS (7) /* !< DIO7 Offset */
#define GPIO_CPU_INT_ICLR_DIO7_MASK                                            \
  ((uint32_t)0x00000080U) /* !< DIO7 event                                     \
                           */
#define GPIO_CPU_INT_ICLR_DIO7_NO_EFFECT                                       \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_CPU_INT_ICLR_DIO7_CLR                                             \
  ((uint32_t)0x00000080U) /* !< Clears DIO7 in RIS register */
/* GPIO_CPU_INT_ICLR[DIO8] Bits */
#define GPIO_CPU_INT_ICLR_DIO8_OFS (8) /* !< DIO8 Offset */
#define GPIO_CPU_INT_ICLR_DIO8_MASK                                            \
  ((uint32_t)0x00000100U) /* !< DIO8 event                                     \
                           */
#define GPIO_CPU_INT_ICLR_DIO8_NO_EFFECT                                       \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_CPU_INT_ICLR_DIO8_CLR                                             \
  ((uint32_t)0x00000100U) /* !< Clears DIO8 in RIS register */
/* GPIO_CPU_INT_ICLR[DIO9] Bits */
#define GPIO_CPU_INT_ICLR_DIO9_OFS (9) /* !< DIO9 Offset */
#define GPIO_CPU_INT_ICLR_DIO9_MASK                                            \
  ((uint32_t)0x00000200U) /* !< DIO9 event                                     \
                           */
#define GPIO_CPU_INT_ICLR_DIO9_NO_EFFECT                                       \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_CPU_INT_ICLR_DIO9_CLR                                             \
  ((uint32_t)0x00000200U) /* !< Clears DIO9 in RIS register */
/* GPIO_CPU_INT_ICLR[DIO10] Bits */
#define GPIO_CPU_INT_ICLR_DIO10_OFS (10) /* !< DIO10 Offset */
#define GPIO_CPU_INT_ICLR_DIO10_MASK                                           \
  ((uint32_t)0x00000400U) /* !< DIO10 event */
#define GPIO_CPU_INT_ICLR_DIO10_NO_EFFECT                                      \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_CPU_INT_ICLR_DIO10_CLR                                            \
  ((uint32_t)0x00000400U) /* !< Clears DIO10 in RIS register */
/* GPIO_CPU_INT_ICLR[DIO11] Bits */
#define GPIO_CPU_INT_ICLR_DIO11_OFS (11) /* !< DIO11 Offset */
#define GPIO_CPU_INT_ICLR_DIO11_MASK                                           \
  ((uint32_t)0x00000800U) /* !< DIO11 event */
#define GPIO_CPU_INT_ICLR_DIO11_NO_EFFECT                                      \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_CPU_INT_ICLR_DIO11_CLR                                            \
  ((uint32_t)0x00000800U) /* !< Clears DIO11 in RIS register */
/* GPIO_CPU_INT_ICLR[DIO12] Bits */
#define GPIO_CPU_INT_ICLR_DIO12_OFS (12) /* !< DIO12 Offset */
#define GPIO_CPU_INT_ICLR_DIO12_MASK                                           \
  ((uint32_t)0x00001000U) /* !< DIO12 event */
#define GPIO_CPU_INT_ICLR_DIO12_NO_EFFECT                                      \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_CPU_INT_ICLR_DIO12_CLR                                            \
  ((uint32_t)0x00001000U) /* !< Clears DIO12 in RIS register */
/* GPIO_CPU_INT_ICLR[DIO13] Bits */
#define GPIO_CPU_INT_ICLR_DIO13_OFS (13) /* !< DIO13 Offset */
#define GPIO_CPU_INT_ICLR_DIO13_MASK                                           \
  ((uint32_t)0x00002000U) /* !< DIO13 event */
#define GPIO_CPU_INT_ICLR_DIO13_NO_EFFECT                                      \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_CPU_INT_ICLR_DIO13_CLR                                            \
  ((uint32_t)0x00002000U) /* !< Clears DIO13 in RIS register */
/* GPIO_CPU_INT_ICLR[DIO14] Bits */
#define GPIO_CPU_INT_ICLR_DIO14_OFS (14) /* !< DIO14 Offset */
#define GPIO_CPU_INT_ICLR_DIO14_MASK                                           \
  ((uint32_t)0x00004000U) /* !< DIO14 event */
#define GPIO_CPU_INT_ICLR_DIO14_NO_EFFECT                                      \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_CPU_INT_ICLR_DIO14_CLR                                            \
  ((uint32_t)0x00004000U) /* !< Clears DIO14 in RIS register */
/* GPIO_CPU_INT_ICLR[DIO15] Bits */
#define GPIO_CPU_INT_ICLR_DIO15_OFS (15) /* !< DIO15 Offset */
#define GPIO_CPU_INT_ICLR_DIO15_MASK                                           \
  ((uint32_t)0x00008000U) /* !< DIO15 event */
#define GPIO_CPU_INT_ICLR_DIO15_NO_EFFECT                                      \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_CPU_INT_ICLR_DIO15_CLR                                            \
  ((uint32_t)0x00008000U) /* !< Clears DIO15 in RIS register */
/* GPIO_CPU_INT_ICLR[DIO16] Bits */
#define GPIO_CPU_INT_ICLR_DIO16_OFS (16) /* !< DIO16 Offset */
#define GPIO_CPU_INT_ICLR_DIO16_MASK                                           \
  ((uint32_t)0x00010000U) /* !< DIO16 event */
#define GPIO_CPU_INT_ICLR_DIO16_NO_EFFECT                                      \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_CPU_INT_ICLR_DIO16_CLR                                            \
  ((uint32_t)0x00010000U) /* !< Clears DIO16 in RIS register */
/* GPIO_CPU_INT_ICLR[DIO17] Bits */
#define GPIO_CPU_INT_ICLR_DIO17_OFS (17) /* !< DIO17 Offset */
#define GPIO_CPU_INT_ICLR_DIO17_MASK                                           \
  ((uint32_t)0x00020000U) /* !< DIO17 event */
#define GPIO_CPU_INT_ICLR_DIO17_NO_EFFECT                                      \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_CPU_INT_ICLR_DIO17_CLR                                            \
  ((uint32_t)0x00020000U) /* !< Clears DIO17 in RIS register */
/* GPIO_CPU_INT_ICLR[DIO18] Bits */
#define GPIO_CPU_INT_ICLR_DIO18_OFS (18) /* !< DIO18 Offset */
#define GPIO_CPU_INT_ICLR_DIO18_MASK                                           \
  ((uint32_t)0x00040000U) /* !< DIO18 event */
#define GPIO_CPU_INT_ICLR_DIO18_NO_EFFECT                                      \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_CPU_INT_ICLR_DIO18_CLR                                            \
  ((uint32_t)0x00040000U) /* !< Clears DIO18 in RIS register */
/* GPIO_CPU_INT_ICLR[DIO19] Bits */
#define GPIO_CPU_INT_ICLR_DIO19_OFS (19) /* !< DIO19 Offset */
#define GPIO_CPU_INT_ICLR_DIO19_MASK                                           \
  ((uint32_t)0x00080000U) /* !< DIO19 event */
#define GPIO_CPU_INT_ICLR_DIO19_NO_EFFECT                                      \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_CPU_INT_ICLR_DIO19_CLR                                            \
  ((uint32_t)0x00080000U) /* !< Clears DIO19 in RIS register */
/* GPIO_CPU_INT_ICLR[DIO20] Bits */
#define GPIO_CPU_INT_ICLR_DIO20_OFS (20) /* !< DIO20 Offset */
#define GPIO_CPU_INT_ICLR_DIO20_MASK                                           \
  ((uint32_t)0x00100000U) /* !< DIO20 event */
#define GPIO_CPU_INT_ICLR_DIO20_NO_EFFECT                                      \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_CPU_INT_ICLR_DIO20_CLR                                            \
  ((uint32_t)0x00100000U) /* !< Clears DIO20 in RIS register */
/* GPIO_CPU_INT_ICLR[DIO21] Bits */
#define GPIO_CPU_INT_ICLR_DIO21_OFS (21) /* !< DIO21 Offset */
#define GPIO_CPU_INT_ICLR_DIO21_MASK                                           \
  ((uint32_t)0x00200000U) /* !< DIO21 event */
#define GPIO_CPU_INT_ICLR_DIO21_NO_EFFECT                                      \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_CPU_INT_ICLR_DIO21_CLR                                            \
  ((uint32_t)0x00200000U) /* !< Clears DIO21 in RIS register */
/* GPIO_CPU_INT_ICLR[DIO22] Bits */
#define GPIO_CPU_INT_ICLR_DIO22_OFS (22) /* !< DIO22 Offset */
#define GPIO_CPU_INT_ICLR_DIO22_MASK                                           \
  ((uint32_t)0x00400000U) /* !< DIO22 event */
#define GPIO_CPU_INT_ICLR_DIO22_NO_EFFECT                                      \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_CPU_INT_ICLR_DIO22_CLR                                            \
  ((uint32_t)0x00400000U) /* !< Clears DIO22 in RIS register */
/* GPIO_CPU_INT_ICLR[DIO23] Bits */
#define GPIO_CPU_INT_ICLR_DIO23_OFS (23) /* !< DIO23 Offset */
#define GPIO_CPU_INT_ICLR_DIO23_MASK                                           \
  ((uint32_t)0x00800000U) /* !< DIO23 event */
#define GPIO_CPU_INT_ICLR_DIO23_NO_EFFECT                                      \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_CPU_INT_ICLR_DIO23_CLR                                            \
  ((uint32_t)0x00800000U) /* !< Clears DIO23 in RIS register */
/* GPIO_CPU_INT_ICLR[DIO24] Bits */
#define GPIO_CPU_INT_ICLR_DIO24_OFS (24) /* !< DIO24 Offset */
#define GPIO_CPU_INT_ICLR_DIO24_MASK                                           \
  ((uint32_t)0x01000000U) /* !< DIO24 event */
#define GPIO_CPU_INT_ICLR_DIO24_NO_EFFECT                                      \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_CPU_INT_ICLR_DIO24_CLR                                            \
  ((uint32_t)0x01000000U) /* !< Clears DIO24 in RIS register */
/* GPIO_CPU_INT_ICLR[DIO25] Bits */
#define GPIO_CPU_INT_ICLR_DIO25_OFS (25) /* !< DIO25 Offset */
#define GPIO_CPU_INT_ICLR_DIO25_MASK                                           \
  ((uint32_t)0x02000000U) /* !< DIO25 event */
#define GPIO_CPU_INT_ICLR_DIO25_NO_EFFECT                                      \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_CPU_INT_ICLR_DIO25_CLR                                            \
  ((uint32_t)0x02000000U) /* !< Clears DIO25 in RIS register */
/* GPIO_CPU_INT_ICLR[DIO26] Bits */
#define GPIO_CPU_INT_ICLR_DIO26_OFS (26) /* !< DIO26 Offset */
#define GPIO_CPU_INT_ICLR_DIO26_MASK                                           \
  ((uint32_t)0x04000000U) /* !< DIO26 event */
#define GPIO_CPU_INT_ICLR_DIO26_NO_EFFECT                                      \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_CPU_INT_ICLR_DIO26_CLR                                            \
  ((uint32_t)0x04000000U) /* !< Clears DIO26 in RIS register */
/* GPIO_CPU_INT_ICLR[DIO27] Bits */
#define GPIO_CPU_INT_ICLR_DIO27_OFS (27) /* !< DIO27 Offset */
#define GPIO_CPU_INT_ICLR_DIO27_MASK                                           \
  ((uint32_t)0x08000000U) /* !< DIO27 event */
#define GPIO_CPU_INT_ICLR_DIO27_NO_EFFECT                                      \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_CPU_INT_ICLR_DIO27_CLR                                            \
  ((uint32_t)0x08000000U) /* !< Clears DIO27 in RIS register */
/* GPIO_CPU_INT_ICLR[DIO28] Bits */
#define GPIO_CPU_INT_ICLR_DIO28_OFS (28) /* !< DIO28 Offset */
#define GPIO_CPU_INT_ICLR_DIO28_MASK                                           \
  ((uint32_t)0x10000000U) /* !< DIO28 event */
#define GPIO_CPU_INT_ICLR_DIO28_NO_EFFECT                                      \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_CPU_INT_ICLR_DIO28_CLR                                            \
  ((uint32_t)0x10000000U) /* !< Clears DIO28 in RIS register */
/* GPIO_CPU_INT_ICLR[DIO29] Bits */
#define GPIO_CPU_INT_ICLR_DIO29_OFS (29) /* !< DIO29 Offset */
#define GPIO_CPU_INT_ICLR_DIO29_MASK                                           \
  ((uint32_t)0x20000000U) /* !< DIO29 event */
#define GPIO_CPU_INT_ICLR_DIO29_NO_EFFECT                                      \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_CPU_INT_ICLR_DIO29_CLR                                            \
  ((uint32_t)0x20000000U) /* !< Clears DIO29 in RIS register */
/* GPIO_CPU_INT_ICLR[DIO30] Bits */
#define GPIO_CPU_INT_ICLR_DIO30_OFS (30) /* !< DIO30 Offset */
#define GPIO_CPU_INT_ICLR_DIO30_MASK                                           \
  ((uint32_t)0x40000000U) /* !< DIO30 event */
#define GPIO_CPU_INT_ICLR_DIO30_NO_EFFECT                                      \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_CPU_INT_ICLR_DIO30_CLR                                            \
  ((uint32_t)0x40000000U) /* !< Clears DIO30 in RIS register */
/* GPIO_CPU_INT_ICLR[DIO31] Bits */
#define GPIO_CPU_INT_ICLR_DIO31_OFS (31) /* !< DIO31 Offset */
#define GPIO_CPU_INT_ICLR_DIO31_MASK                                           \
  ((uint32_t)0x80000000U) /* !< DIO31 event */
#define GPIO_CPU_INT_ICLR_DIO31_NO_EFFECT                                      \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_CPU_INT_ICLR_DIO31_CLR                                            \
  ((uint32_t)0x80000000U) /* !< Clears DIO31 in RIS register */

