luckycyang/mspm0l1306-dev/include/ti/devices/msp/peripherals/hw_gpio.h
/* GPIO_PWREN Bits */
/* GPIO_PWREN[ENABLE] Bits */
#define GPIO_PWREN_ENABLE_OFS (0) /* !< ENABLE Offset */
#define GPIO_PWREN_ENABLE_MASK                                                 \
  ((uint32_t)0x00000001U) /* !< Enable the power                               \
                           */
#define GPIO_PWREN_ENABLE_DISABLE                                              \
  ((uint32_t)0x00000000U)                                /* !< Disable Power   \
                                                          */
#define GPIO_PWREN_ENABLE_ENABLE ((uint32_t)0x00000001U) /* !< Enable Power */
/* GPIO_PWREN[KEY] Bits */
#define GPIO_PWREN_KEY_OFS (24) /* !< KEY Offset */
#define GPIO_PWREN_KEY_MASK                                                    \
  ((uint32_t)0xFF000000U) /* !< KEY to allow Power State Change */
#define GPIO_PWREN_KEY_UNLOCK_W                                                \
  ((uint32_t)0x26000000U) /* !< KEY to allow write access to this              \
                             register */

/* GPIO_RSTCTL Bits */
/* GPIO_RSTCTL[RESETSTKYCLR] Bits */
#define GPIO_RSTCTL_RESETSTKYCLR_OFS (1) /* !< RESETSTKYCLR Offset */
#define GPIO_RSTCTL_RESETSTKYCLR_MASK                                          \
  ((uint32_t)0x00000002U) /* !< Clear the RESETSTKY bit in the STAT            \
                             register */
#define GPIO_RSTCTL_RESETSTKYCLR_NOP                                           \
  ((uint32_t)0x00000000U) /* !< Writing 0 has no effect */
#define GPIO_RSTCTL_RESETSTKYCLR_CLR                                           \
  ((uint32_t)0x00000002U) /* !< Clear reset sticky bit */
/* GPIO_RSTCTL[RESETASSERT] Bits */
#define GPIO_RSTCTL_RESETASSERT_OFS (0) /* !< RESETASSERT Offset */
#define GPIO_RSTCTL_RESETASSERT_MASK                                           \
  ((uint32_t)0x00000001U) /* !< Assert reset to the peripheral */
#define GPIO_RSTCTL_RESETASSERT_NOP                                            \
  ((uint32_t)0x00000000U) /* !< Writing 0 has no effect */
#define GPIO_RSTCTL_RESETASSERT_ASSERT                                         \
  ((uint32_t)0x00000001U) /* !< Assert reset */
/* GPIO_RSTCTL[KEY] Bits */
#define GPIO_RSTCTL_KEY_OFS (24)                     /* !< KEY Offset */
#define GPIO_RSTCTL_KEY_MASK ((uint32_t)0xFF000000U) /* !< Unlock key */
#define GPIO_RSTCTL_KEY_UNLOCK_W                                               \
  ((uint32_t)0xB1000000U) /* !< KEY to allow write access to this              \
                             register */

/* GPIO_STAT Bits */
/* GPIO_STAT[RESETSTKY] Bits */
#define GPIO_STAT_RESETSTKY_OFS (16) /* !< RESETSTKY Offset */
#define GPIO_STAT_RESETSTKY_MASK                                               \
  ((uint32_t)0x00010000U) /* !< This bit indicates, if the                     \
                             peripheral was reset, since this bit              \
                             was cleared by RESETSTKYCLR in the                \
                             RSTCTL register */
#define GPIO_STAT_RESETSTKY_NORES                                              \
  ((uint32_t)0x00000000U) /* !< The peripheral has not been reset              \
                             since this bit was last cleared by                \
                             RESETSTKYCLR in the RSTCTL register */
#define GPIO_STAT_RESETSTKY_RESET                                              \
  ((uint32_t)0x00010000U) /* !< The peripheral was reset since the             \
                             last bit clear */

/* GPIO_FSUB_0 Bits */
/* GPIO_FSUB_0[CHANID] Bits */
#define GPIO_FSUB_0_CHANID_OFS (0) /* !< CHANID Offset */
#define GPIO_FSUB_0_CHANID_MASK                                                \
  ((uint32_t)0x000000FFU) /* !< 0 = disconnected. 1-15 = connected             \
                             to channelID = CHANID. */
#define GPIO_FSUB_0_CHANID_MNIMUM                                              \
  ((uint32_t)0x00000000U) /* !< 0 is an allowed value, signifying              \
                             that the event is unconnected */
#define GPIO_FSUB_0_CHANID_UNCONNECTED                                         \
  ((uint32_t)0x00000000U) /* !< A value of 0 specifies that the                \
                             event is not connected */
#define GPIO_FSUB_0_CHANID_MAXIMUM                                             \
  ((uint32_t)0x0000000FU) /* !< Consult your device datasheet as               \
                             the actual allowed maximum may be                 \
                             less than 15. */

/* GPIO_FSUB_1 Bits */
/* GPIO_FSUB_1[CHANID] Bits */
#define GPIO_FSUB_1_CHANID_OFS (0) /* !< CHANID Offset */
#define GPIO_FSUB_1_CHANID_MASK                                                \
  ((uint32_t)0x000000FFU) /* !< 0 = disconnected. 1-15 = connected             \
                             to channelID = CHANID. */
#define GPIO_FSUB_1_CHANID_MNIMUM                                              \
  ((uint32_t)0x00000000U) /* !< 0 is an allowed value, signifying              \
                             that the event is unconnected */
#define GPIO_FSUB_1_CHANID_UNCONNECTED                                         \
  ((uint32_t)0x00000000U) /* !< A value of 0 specifies that the                \
                             event is not connected */
#define GPIO_FSUB_1_CHANID_MAXIMUM                                             \
  ((uint32_t)0x0000000FU) /* !< Consult your device datasheet as               \
                             the actual allowed maximum may be                 \
                             less than 15. */

/* GPIO_FPUB_0 Bits */
/* GPIO_FPUB_0[CHANID] Bits */
#define GPIO_FPUB_0_CHANID_OFS (0) /* !< CHANID Offset */
#define GPIO_FPUB_0_CHANID_MASK                                                \
  ((uint32_t)0x000000FFU) /* !< 0 = disconnected. 1-15 = connected             \
                             to channelID = CHANID. */
#define GPIO_FPUB_0_CHANID_MNIMUM                                              \
  ((uint32_t)0x00000000U) /* !< 0 is an allowed value, signifying              \
                             that the event is unconnected */
#define GPIO_FPUB_0_CHANID_UNCONNECTED                                         \
  ((uint32_t)0x00000000U) /* !< A value of 0 specifies that the                \
                             event is not connected */
#define GPIO_FPUB_0_CHANID_MAXIMUM                                             \
  ((uint32_t)0x0000000FU) /* !< Consult your device datasheet as               \
                             the actual allowed maximum may be                 \
                             less than 15. */

/* GPIO_FPUB_1 Bits */
/* GPIO_FPUB_1[CHANID] Bits */
#define GPIO_FPUB_1_CHANID_OFS (0) /* !< CHANID Offset */
#define GPIO_FPUB_1_CHANID_MASK                                                \
  ((uint32_t)0x000000FFU) /* !< 0 = disconnected. 1-15 = connected             \
                             to channelID = CHANID. */
#define GPIO_FPUB_1_CHANID_MNIMUM                                              \
  ((uint32_t)0x00000000U) /* !< 0 is an allowed value, signifying              \
                             that the event is unconnected */
#define GPIO_FPUB_1_CHANID_UNCONNECTED                                         \
  ((uint32_t)0x00000000U) /* !< A value of 0 specifies that the                \
                             event is not connected */
#define GPIO_FPUB_1_CHANID_MAXIMUM                                             \
  ((uint32_t)0x0000000FU) /* !< Consult your device datasheet as               \
                             the actual allowed maximum may be                 \
                             less than 15. */

