luckycyang/mspm0l1306-dev/include/ti/devices/msp/peripherals/hw_gpio.h
/* GPIO_CLKOVR Bits */
/* GPIO_CLKOVR[OVERRIDE] Bits */
#define GPIO_CLKOVR_OVERRIDE_OFS (0) /* !< OVERRIDE Offset */
#define GPIO_CLKOVR_OVERRIDE_MASK                                              \
  ((uint32_t)0x00000001U) /* !< Unlocks the functionality of                   \
                             [RUN_STOP] to override the automatic              \
                             peripheral clock request */
#define GPIO_CLKOVR_OVERRIDE_DISABLED                                          \
  ((uint32_t)0x00000000U) /* !< Override disabled */
#define GPIO_CLKOVR_OVERRIDE_ENABLED                                           \
  ((uint32_t)0x00000001U) /* !< Override enabled */
/* GPIO_CLKOVR[RUN_STOP] Bits */
#define GPIO_CLKOVR_RUN_STOP_OFS (1) /* !< RUN_STOP Offset */
#define GPIO_CLKOVR_RUN_STOP_MASK                                              \
  ((uint32_t)0x00000002U) /* !< If [OVERRIDE] is enabled, this                 \
                             register is used to manually control              \
                             the peripheral's clock request to the             \
                             system */
#define GPIO_CLKOVR_RUN_STOP_RUN                                               \
  ((uint32_t)0x00000000U) /* !< Run/ungate functional clock */
#define GPIO_CLKOVR_RUN_STOP_STOP                                              \
  ((uint32_t)0x00000002U) /* !< Stop/gate functional clock */

/* GPIO_PDBGCTL Bits */
/* GPIO_PDBGCTL[FREE] Bits */
#define GPIO_PDBGCTL_FREE_OFS (0) /* !< FREE Offset */
#define GPIO_PDBGCTL_FREE_MASK                                                 \
  ((uint32_t)0x00000001U) /* !< Free run control                               \
                           */
#define GPIO_PDBGCTL_FREE_STOP                                                 \
  ((uint32_t)0x00000000U) /* !< The peripheral freezes                         \
                             functionality while the Core Halted               \
                             input is asserted and resumes when it             \
                             is deasserted. */
#define GPIO_PDBGCTL_FREE_RUN                                                  \
  ((uint32_t)0x00000001U) /* !< The peripheral ignores the state of            \
                             the Core Halted input */

/* GPIO_EVT_MODE Bits */
/* GPIO_EVT_MODE[INT0_CFG] Bits */
#define GPIO_EVT_MODE_INT0_CFG_OFS (0) /* !< INT0_CFG Offset */
#define GPIO_EVT_MODE_INT0_CFG_MASK                                            \
  ((uint32_t)0x00000003U) /* !< Event line mode select for event               \
                             corresponding to [IPSTANDARD.CPU_INT] */
#define GPIO_EVT_MODE_INT0_CFG_DISABLE                                         \
  ((uint32_t)0x00000000U) /* !< The interrupt or event line is                 \
                             disabled. */
#define GPIO_EVT_MODE_INT0_CFG_SOFTWARE                                        \
  ((uint32_t)0x00000001U) /* !< The interrupt or event line is in              \
                             software mode. Software must clear                \
                             the RIS. */
#define GPIO_EVT_MODE_INT0_CFG_HARDWARE                                        \
  ((uint32_t)0x00000002U) /* !< The interrupt or event line is in              \
                             hardware mode. The hardware (another              \
                             module) clears automatically the                  \
                             associated RIS flag. */
/* GPIO_EVT_MODE[EVT1_CFG] Bits */
#define GPIO_EVT_MODE_EVT1_CFG_OFS (2) /* !< EVT1_CFG Offset */
#define GPIO_EVT_MODE_EVT1_CFG_MASK                                            \
  ((uint32_t)0x0000000CU) /* !< Event line mode select for event               \
                             corresponding to                                  \
                             [IPSTANDARD.GEN_EVENT0] */
#define GPIO_EVT_MODE_EVT1_CFG_DISABLE                                         \
  ((uint32_t)0x00000000U) /* !< The interrupt or event line is                 \
                             disabled. */
#define GPIO_EVT_MODE_EVT1_CFG_SOFTWARE                                        \
  ((uint32_t)0x00000004U) /* !< The interrupt or event line is in              \
                             software mode. Software must clear                \
                             the RIS. */
#define GPIO_EVT_MODE_EVT1_CFG_HARDWARE                                        \
  ((uint32_t)0x00000008U) /* !< The interrupt or event line is in              \
                             hardware mode. The hardware (another              \
                             module) clears automatically the                  \
                             associated RIS flag. */
/* GPIO_EVT_MODE[EVT2_CFG] Bits */
#define GPIO_EVT_MODE_EVT2_CFG_OFS (4) /* !< EVT2_CFG Offset */
#define GPIO_EVT_MODE_EVT2_CFG_MASK                                            \
  ((uint32_t)0x00000030U) /* !< Event line mode select for event               \
                             corresponding to                                  \
                             [IPSTANDARD.GEN_EVENT1] */
#define GPIO_EVT_MODE_EVT2_CFG_DISABLE                                         \
  ((uint32_t)0x00000000U) /* !< The interrupt or event line is                 \
                             disabled. */
#define GPIO_EVT_MODE_EVT2_CFG_SOFTWARE                                        \
  ((uint32_t)0x00000010U) /* !< The interrupt or event line is in              \
                             software mode. Software must clear                \
                             the RIS. */
#define GPIO_EVT_MODE_EVT2_CFG_HARDWARE                                        \
  ((uint32_t)0x00000020U) /* !< The interrupt or event line is in              \
                             hardware mode. The hardware (another              \
                             module) clears automatically the                  \
                             associated RIS flag. */

/* GPIO_DESC Bits */
/* GPIO_DESC[MINREV] Bits */
#define GPIO_DESC_MINREV_OFS (0) /* !< MINREV Offset */
#define GPIO_DESC_MINREV_MASK                                                  \
  ((uint32_t)0x0000000FU) /* !< Minor rev of the IP */
#define GPIO_DESC_MINREV_MINIMUM                                               \
  ((uint32_t)0x00000000U) /* !< Smallest value                                 \
                           */
#define GPIO_DESC_MINREV_MAXIMUM                                               \
  ((uint32_t)0x0000000FU) /* !< Highest possible value */
/* GPIO_DESC[MAJREV] Bits */
#define GPIO_DESC_MAJREV_OFS (4) /* !< MAJREV Offset */
#define GPIO_DESC_MAJREV_MASK                                                  \
  ((uint32_t)0x000000F0U) /* !< Major rev of the IP */
#define GPIO_DESC_MAJREV_MINIMUM                                               \
  ((uint32_t)0x00000000U) /* !< Smallest value                                 \
                           */
#define GPIO_DESC_MAJREV_MAXIMUM                                               \
  ((uint32_t)0x000000F0U) /* !< Highest possible value */
/* GPIO_DESC[FEATUREVER] Bits */
#define GPIO_DESC_FEATUREVER_OFS (12) /* !< FEATUREVER Offset */
#define GPIO_DESC_FEATUREVER_MASK                                              \
  ((uint32_t)0x0000F000U) /* !< Feature Set for the module                     \
                           *instance* */
#define GPIO_DESC_FEATUREVER_MINIMUM                                           \
  ((uint32_t)0x00000000U) /* !< Smallest value */
#define GPIO_DESC_FEATUREVER_MAXIMUM                                           \
  ((uint32_t)0x0000F000U) /* !< Highest possible value */
/* GPIO_DESC[MODULEID] Bits */
#define GPIO_DESC_MODULEID_OFS (16) /* !< MODULEID Offset */
#define GPIO_DESC_MODULEID_MASK                                                \
  ((uint32_t)0xFFFF0000U) /* !< Module identification contains a               \
                             unique peripheral identification                  \
                             number. The assignments are                       \
                             maintained in a central database for              \
                             all of the platform modules to ensure             \
                             uniqueness. */
#define GPIO_DESC_MODULEID_MINIMUM                                             \
  ((uint32_t)0x00000000U) /* !< Smallest value */
#define GPIO_DESC_MODULEID_MAXIMUM                                             \
  ((uint32_t)0xFFFF0000U) /* !< Highest possible value */

