luckycyang/mspm0l1306-dev/include/ti/devices/msp/peripherals/hw_gpio.h
/* GPIO_DOUT31_0 Bits */
/* GPIO_DOUT31_0[DIO0] Bits */
#define GPIO_DOUT31_0_DIO0_OFS (0) /* !< DIO0 Offset */
#define GPIO_DOUT31_0_DIO0_MASK                                                \
  ((uint32_t)0x00000001U) /* !< This bit sets the value of the pin             \
                             configured as DIO0 when the output is             \
                             enabled through DOE31_0 register. */
#define GPIO_DOUT31_0_DIO0_ZERO                                                \
  ((uint32_t)0x00000000U) /* !< Output is set to 0 */
#define GPIO_DOUT31_0_DIO0_ONE                                                 \
  ((uint32_t)0x00000001U) /* !< Output is set to 1 */
/* GPIO_DOUT31_0[DIO1] Bits */
#define GPIO_DOUT31_0_DIO1_OFS (1) /* !< DIO1 Offset */
#define GPIO_DOUT31_0_DIO1_MASK                                                \
  ((uint32_t)0x00000002U) /* !< This bit sets the value of the pin             \
                             configured as DIO1 when the output is             \
                             enabled through DOE31_0 register. */
#define GPIO_DOUT31_0_DIO1_ZERO                                                \
  ((uint32_t)0x00000000U) /* !< Output is set to 0 */
#define GPIO_DOUT31_0_DIO1_ONE                                                 \
  ((uint32_t)0x00000002U) /* !< Output is set to 1 */
/* GPIO_DOUT31_0[DIO2] Bits */
#define GPIO_DOUT31_0_DIO2_OFS (2) /* !< DIO2 Offset */
#define GPIO_DOUT31_0_DIO2_MASK                                                \
  ((uint32_t)0x00000004U) /* !< This bit sets the value of the pin             \
                             configured as DIO2 when the output is             \
                             enabled through DOE31_0 register. */
#define GPIO_DOUT31_0_DIO2_ZERO                                                \
  ((uint32_t)0x00000000U) /* !< Output is set to 0 */
#define GPIO_DOUT31_0_DIO2_ONE                                                 \
  ((uint32_t)0x00000004U) /* !< Output is set to 1 */
/* GPIO_DOUT31_0[DIO3] Bits */
#define GPIO_DOUT31_0_DIO3_OFS (3) /* !< DIO3 Offset */
#define GPIO_DOUT31_0_DIO3_MASK                                                \
  ((uint32_t)0x00000008U) /* !< This bit sets the value of the pin             \
                             configured as DIO3 when the output is             \
                             enabled through DOE31_0 register. */
#define GPIO_DOUT31_0_DIO3_ZERO                                                \
  ((uint32_t)0x00000000U) /* !< Output is set to 0 */
#define GPIO_DOUT31_0_DIO3_ONE                                                 \
  ((uint32_t)0x00000008U) /* !< Output is set to 1 */
/* GPIO_DOUT31_0[DIO4] Bits */
#define GPIO_DOUT31_0_DIO4_OFS (4) /* !< DIO4 Offset */
#define GPIO_DOUT31_0_DIO4_MASK                                                \
  ((uint32_t)0x00000010U) /* !< This bit sets the value of the pin             \
                             configured as DIO4 when the output is             \
                             enabled through DOE31_0 register. */
#define GPIO_DOUT31_0_DIO4_ZERO                                                \
  ((uint32_t)0x00000000U) /* !< Output is set to 0 */
#define GPIO_DOUT31_0_DIO4_ONE                                                 \
  ((uint32_t)0x00000010U) /* !< Output is set to 1 */
/* GPIO_DOUT31_0[DIO5] Bits */
#define GPIO_DOUT31_0_DIO5_OFS (5) /* !< DIO5 Offset */
#define GPIO_DOUT31_0_DIO5_MASK                                                \
  ((uint32_t)0x00000020U) /* !< This bit sets the value of the pin             \
                             configured as DIO5 when the output is             \
                             enabled through DOE31_0 register. */
#define GPIO_DOUT31_0_DIO5_ZERO                                                \
  ((uint32_t)0x00000000U) /* !< Output is set to 0 */
#define GPIO_DOUT31_0_DIO5_ONE                                                 \
  ((uint32_t)0x00000020U) /* !< Output is set to 1 */
/* GPIO_DOUT31_0[DIO6] Bits */
#define GPIO_DOUT31_0_DIO6_OFS (6) /* !< DIO6 Offset */
#define GPIO_DOUT31_0_DIO6_MASK                                                \
  ((uint32_t)0x00000040U) /* !< This bit sets the value of the pin             \
                             configured as DIO6 when the output is             \
                             enabled through DOE31_0 register. */
#define GPIO_DOUT31_0_DIO6_ZERO                                                \
  ((uint32_t)0x00000000U) /* !< Output is set to 0 */
#define GPIO_DOUT31_0_DIO6_ONE                                                 \
  ((uint32_t)0x00000040U) /* !< Output is set to 1 */
/* GPIO_DOUT31_0[DIO7] Bits */
#define GPIO_DOUT31_0_DIO7_OFS (7) /* !< DIO7 Offset */
#define GPIO_DOUT31_0_DIO7_MASK                                                \
  ((uint32_t)0x00000080U) /* !< This bit sets the value of the pin             \
                             configured as DIO7 when the output is             \
                             enabled through DOE31_0 register. */
#define GPIO_DOUT31_0_DIO7_ZERO                                                \
  ((uint32_t)0x00000000U) /* !< Output is set to 0 */
#define GPIO_DOUT31_0_DIO7_ONE                                                 \
  ((uint32_t)0x00000080U) /* !< Output is set to 1 */
/* GPIO_DOUT31_0[DIO8] Bits */
#define GPIO_DOUT31_0_DIO8_OFS (8) /* !< DIO8 Offset */
#define GPIO_DOUT31_0_DIO8_MASK                                                \
  ((uint32_t)0x00000100U) /* !< This bit sets the value of the pin             \
                             configured as DIO8 when the output is             \
                             enabled through DOE31_0 register. */
#define GPIO_DOUT31_0_DIO8_ZERO                                                \
  ((uint32_t)0x00000000U) /* !< Output is set to 0 */
#define GPIO_DOUT31_0_DIO8_ONE                                                 \
  ((uint32_t)0x00000100U) /* !< Output is set to 1 */
/* GPIO_DOUT31_0[DIO9] Bits */
#define GPIO_DOUT31_0_DIO9_OFS (9) /* !< DIO9 Offset */
#define GPIO_DOUT31_0_DIO9_MASK                                                \
  ((uint32_t)0x00000200U) /* !< This bit sets the value of the pin             \
                             configured as DIO9 when the output is             \
                             enabled through DOE31_0 register. */
#define GPIO_DOUT31_0_DIO9_ZERO                                                \
  ((uint32_t)0x00000000U) /* !< Output is set to 0 */
#define GPIO_DOUT31_0_DIO9_ONE                                                 \
  ((uint32_t)0x00000200U) /* !< Output is set to 1 */
/* GPIO_DOUT31_0[DIO10] Bits */
#define GPIO_DOUT31_0_DIO10_OFS (10) /* !< DIO10 Offset */
#define GPIO_DOUT31_0_DIO10_MASK                                               \
  ((uint32_t)0x00000400U) /* !< This bit sets the value of the pin             \
                             configured as DIO10 when the output               \
                             is enabled through DOE31_0 register. */
#define GPIO_DOUT31_0_DIO10_ZERO                                               \
  ((uint32_t)0x00000000U) /* !< Output is set to 0 */
#define GPIO_DOUT31_0_DIO10_ONE                                                \
  ((uint32_t)0x00000400U) /* !< Output is set to 1 */
/* GPIO_DOUT31_0[DIO11] Bits */
#define GPIO_DOUT31_0_DIO11_OFS (11) /* !< DIO11 Offset */
#define GPIO_DOUT31_0_DIO11_MASK                                               \
  ((uint32_t)0x00000800U) /* !< This bit sets the value of the pin             \
                             configured as DIO11 when the output               \
                             is enabled through DOE31_0 register. */
#define GPIO_DOUT31_0_DIO11_ZERO                                               \
  ((uint32_t)0x00000000U) /* !< Output is set to 0 */
#define GPIO_DOUT31_0_DIO11_ONE                                                \
  ((uint32_t)0x00000800U) /* !< Output is set to 1 */
/* GPIO_DOUT31_0[DIO12] Bits */
#define GPIO_DOUT31_0_DIO12_OFS (12) /* !< DIO12 Offset */
#define GPIO_DOUT31_0_DIO12_MASK                                               \
  ((uint32_t)0x00001000U) /* !< This bit sets the value of the pin             \
                             configured as DIO12 when the output               \
                             is enabled through DOE31_0 register. */
#define GPIO_DOUT31_0_DIO12_ZERO                                               \
  ((uint32_t)0x00000000U) /* !< Output is set to 0 */
#define GPIO_DOUT31_0_DIO12_ONE                                                \
  ((uint32_t)0x00001000U) /* !< Output is set to 1 */
/* GPIO_DOUT31_0[DIO13] Bits */
#define GPIO_DOUT31_0_DIO13_OFS (13) /* !< DIO13 Offset */
#define GPIO_DOUT31_0_DIO13_MASK                                               \
  ((uint32_t)0x00002000U) /* !< This bit sets the value of the pin             \
                             configured as DIO13 when the output               \
                             is enabled through DOE31_0 register. */
#define GPIO_DOUT31_0_DIO13_ZERO                                               \
  ((uint32_t)0x00000000U) /* !< Output is set to 0 */
#define GPIO_DOUT31_0_DIO13_ONE                                                \
  ((uint32_t)0x00002000U) /* !< Output is set to 1 */
/* GPIO_DOUT31_0[DIO14] Bits */
#define GPIO_DOUT31_0_DIO14_OFS (14) /* !< DIO14 Offset */
#define GPIO_DOUT31_0_DIO14_MASK                                               \
  ((uint32_t)0x00004000U) /* !< This bit sets the value of the pin             \
                             configured as DIO14 when the output               \
                             is enabled through DOE31_0 register. */
#define GPIO_DOUT31_0_DIO14_ZERO                                               \
  ((uint32_t)0x00000000U) /* !< Output is set to 0 */
#define GPIO_DOUT31_0_DIO14_ONE                                                \
  ((uint32_t)0x00004000U) /* !< Output is set to 1 */
/* GPIO_DOUT31_0[DIO15] Bits */
#define GPIO_DOUT31_0_DIO15_OFS (15) /* !< DIO15 Offset */
#define GPIO_DOUT31_0_DIO15_MASK                                               \
  ((uint32_t)0x00008000U) /* !< This bit sets the value of the pin             \
                             configured as DIO15 when the output               \
                             is enabled through DOE31_0 register. */
#define GPIO_DOUT31_0_DIO15_ZERO                                               \
  ((uint32_t)0x00000000U) /* !< Output is set to 0 */
#define GPIO_DOUT31_0_DIO15_ONE                                                \
  ((uint32_t)0x00008000U) /* !< Output is set to 1 */
/* GPIO_DOUT31_0[DIO16] Bits */
#define GPIO_DOUT31_0_DIO16_OFS (16) /* !< DIO16 Offset */
#define GPIO_DOUT31_0_DIO16_MASK                                               \
  ((uint32_t)0x00010000U) /* !< This bit sets the value of the pin             \
                             configured as DIO16 when the output               \
                             is enabled through DOE31_0 register. */
#define GPIO_DOUT31_0_DIO16_ZERO                                               \
  ((uint32_t)0x00000000U) /* !< Output is set to 0 */
#define GPIO_DOUT31_0_DIO16_ONE                                                \
  ((uint32_t)0x00010000U) /* !< Output is set to 1 */
/* GPIO_DOUT31_0[DIO17] Bits */
#define GPIO_DOUT31_0_DIO17_OFS (17) /* !< DIO17 Offset */
#define GPIO_DOUT31_0_DIO17_MASK                                               \
  ((uint32_t)0x00020000U) /* !< This bit sets the value of the pin             \
                             configured as DIO17 when the output               \
                             is enabled through DOE31_0 register. */
#define GPIO_DOUT31_0_DIO17_ZERO                                               \
  ((uint32_t)0x00000000U) /* !< Output is set to 0 */
#define GPIO_DOUT31_0_DIO17_ONE                                                \
  ((uint32_t)0x00020000U) /* !< Output is set to 1 */
/* GPIO_DOUT31_0[DIO18] Bits */
#define GPIO_DOUT31_0_DIO18_OFS (18) /* !< DIO18 Offset */
#define GPIO_DOUT31_0_DIO18_MASK                                               \
  ((uint32_t)0x00040000U) /* !< This bit sets the value of the pin             \
                             configured as DIO18 when the output               \
                             is enabled through DOE31_0 register. */
#define GPIO_DOUT31_0_DIO18_ZERO                                               \
  ((uint32_t)0x00000000U) /* !< Output is set to 0 */
#define GPIO_DOUT31_0_DIO18_ONE                                                \
  ((uint32_t)0x00040000U) /* !< Output is set to 1 */
/* GPIO_DOUT31_0[DIO19] Bits */
#define GPIO_DOUT31_0_DIO19_OFS (19) /* !< DIO19 Offset */
#define GPIO_DOUT31_0_DIO19_MASK                                               \
  ((uint32_t)0x00080000U) /* !< This bit sets the value of the pin             \
                             configured as DIO19 when the output               \
                             is enabled through DOE31_0 register. */
#define GPIO_DOUT31_0_DIO19_ZERO                                               \
  ((uint32_t)0x00000000U) /* !< Output is set to 0 */
#define GPIO_DOUT31_0_DIO19_ONE                                                \
  ((uint32_t)0x00080000U) /* !< Output is set to 1 */
/* GPIO_DOUT31_0[DIO20] Bits */
#define GPIO_DOUT31_0_DIO20_OFS (20) /* !< DIO20 Offset */
#define GPIO_DOUT31_0_DIO20_MASK                                               \
  ((uint32_t)0x00100000U) /* !< This bit sets the value of the pin             \
                             configured as DIO20 when the output               \
                             is enabled through DOE31_0 register. */
#define GPIO_DOUT31_0_DIO20_ZERO                                               \
  ((uint32_t)0x00000000U) /* !< Output is set to 0 */
#define GPIO_DOUT31_0_DIO20_ONE                                                \
  ((uint32_t)0x00100000U) /* !< Output is set to 1 */
/* GPIO_DOUT31_0[DIO21] Bits */
#define GPIO_DOUT31_0_DIO21_OFS (21) /* !< DIO21 Offset */
#define GPIO_DOUT31_0_DIO21_MASK                                               \
  ((uint32_t)0x00200000U) /* !< This bit sets the value of the pin             \
                             configured as DIO21 when the output               \
                             is enabled through DOE31_0 register. */
#define GPIO_DOUT31_0_DIO21_ZERO                                               \
  ((uint32_t)0x00000000U) /* !< Output is set to 0 */
#define GPIO_DOUT31_0_DIO21_ONE                                                \
  ((uint32_t)0x00200000U) /* !< Output is set to 1 */
/* GPIO_DOUT31_0[DIO22] Bits */
#define GPIO_DOUT31_0_DIO22_OFS (22) /* !< DIO22 Offset */
#define GPIO_DOUT31_0_DIO22_MASK                                               \
  ((uint32_t)0x00400000U) /* !< This bit sets the value of the pin             \
                             configured as DIO22 when the output               \
                             is enabled through DOE31_0 register. */
#define GPIO_DOUT31_0_DIO22_ZERO                                               \
  ((uint32_t)0x00000000U) /* !< Output is set to 0 */
#define GPIO_DOUT31_0_DIO22_ONE                                                \
  ((uint32_t)0x00400000U) /* !< Output is set to 1 */
/* GPIO_DOUT31_0[DIO23] Bits */
#define GPIO_DOUT31_0_DIO23_OFS (23) /* !< DIO23 Offset */
#define GPIO_DOUT31_0_DIO23_MASK                                               \
  ((uint32_t)0x00800000U) /* !< This bit sets the value of the pin             \
                             configured as DIO23 when the output               \
                             is enabled through DOE31_0 register. */
#define GPIO_DOUT31_0_DIO23_ZERO                                               \
  ((uint32_t)0x00000000U) /* !< Output is set to 0 */
#define GPIO_DOUT31_0_DIO23_ONE                                                \
  ((uint32_t)0x00800000U) /* !< Output is set to 1 */
/* GPIO_DOUT31_0[DIO24] Bits */
#define GPIO_DOUT31_0_DIO24_OFS (24) /* !< DIO24 Offset */
#define GPIO_DOUT31_0_DIO24_MASK                                               \
  ((uint32_t)0x01000000U) /* !< This bit sets the value of the pin             \
                             configured as DIO24 when the output               \
                             is enabled through DOE31_0 register. */
#define GPIO_DOUT31_0_DIO24_ZERO                                               \
  ((uint32_t)0x00000000U) /* !< Output is set to 0 */
#define GPIO_DOUT31_0_DIO24_ONE                                                \
  ((uint32_t)0x01000000U) /* !< Output is set to 1 */
/* GPIO_DOUT31_0[DIO25] Bits */
#define GPIO_DOUT31_0_DIO25_OFS (25) /* !< DIO25 Offset */
#define GPIO_DOUT31_0_DIO25_MASK                                               \
  ((uint32_t)0x02000000U) /* !< This bit sets the value of the pin             \
                             configured as DIO25 when the output               \
                             is enabled through DOE31_0 register. */
#define GPIO_DOUT31_0_DIO25_ZERO                                               \
  ((uint32_t)0x00000000U) /* !< Output is set to 0 */
#define GPIO_DOUT31_0_DIO25_ONE                                                \
  ((uint32_t)0x02000000U) /* !< Output is set to 1 */
/* GPIO_DOUT31_0[DIO26] Bits */
#define GPIO_DOUT31_0_DIO26_OFS (26) /* !< DIO26 Offset */
#define GPIO_DOUT31_0_DIO26_MASK                                               \
  ((uint32_t)0x04000000U) /* !< This bit sets the value of the pin             \
                             configured as DIO26 when the output               \
                             is enabled through DOE31_0 register. */
#define GPIO_DOUT31_0_DIO26_ZERO                                               \
  ((uint32_t)0x00000000U) /* !< Output is set to 0 */
#define GPIO_DOUT31_0_DIO26_ONE                                                \
  ((uint32_t)0x04000000U) /* !< Output is set to 1 */
/* GPIO_DOUT31_0[DIO27] Bits */
#define GPIO_DOUT31_0_DIO27_OFS (27) /* !< DIO27 Offset */
#define GPIO_DOUT31_0_DIO27_MASK                                               \
  ((uint32_t)0x08000000U) /* !< This bit sets the value of the pin             \
                             configured as DIO27 when the output               \
                             is enabled through DOE31_0 register. */
#define GPIO_DOUT31_0_DIO27_ZERO                                               \
  ((uint32_t)0x00000000U) /* !< Output is set to 0 */
#define GPIO_DOUT31_0_DIO27_ONE                                                \
  ((uint32_t)0x08000000U) /* !< Output is set to 1 */
/* GPIO_DOUT31_0[DIO28] Bits */
#define GPIO_DOUT31_0_DIO28_OFS (28) /* !< DIO28 Offset */
#define GPIO_DOUT31_0_DIO28_MASK                                               \
  ((uint32_t)0x10000000U) /* !< This bit sets the value of the pin             \
                             configured as DIO28 when the output               \
                             is enabled through DOE31_0 register. */
#define GPIO_DOUT31_0_DIO28_ZERO                                               \
  ((uint32_t)0x00000000U) /* !< Output is set to 0 */
#define GPIO_DOUT31_0_DIO28_ONE                                                \
  ((uint32_t)0x10000000U) /* !< Output is set to 1 */
/* GPIO_DOUT31_0[DIO29] Bits */
#define GPIO_DOUT31_0_DIO29_OFS (29) /* !< DIO29 Offset */
#define GPIO_DOUT31_0_DIO29_MASK                                               \
  ((uint32_t)0x20000000U) /* !< This bit sets the value of the pin             \
                             configured as DIO29 when the output               \
                             is enabled through DOE31_0 register. */
#define GPIO_DOUT31_0_DIO29_ZERO                                               \
  ((uint32_t)0x00000000U) /* !< Output is set to 0 */
#define GPIO_DOUT31_0_DIO29_ONE                                                \
  ((uint32_t)0x20000000U) /* !< Output is set to 1 */
/* GPIO_DOUT31_0[DIO30] Bits */
#define GPIO_DOUT31_0_DIO30_OFS (30) /* !< DIO30 Offset */
#define GPIO_DOUT31_0_DIO30_MASK                                               \
  ((uint32_t)0x40000000U) /* !< This bit sets the value of the pin             \
                             configured as DIO30 when the output               \
                             is enabled through DOE31_0 register. */
#define GPIO_DOUT31_0_DIO30_ZERO                                               \
  ((uint32_t)0x00000000U) /* !< Output is set to 0 */
#define GPIO_DOUT31_0_DIO30_ONE                                                \
  ((uint32_t)0x40000000U) /* !< Output is set to 1 */
/* GPIO_DOUT31_0[DIO31] Bits */
#define GPIO_DOUT31_0_DIO31_OFS (31) /* !< DIO31 Offset */
#define GPIO_DOUT31_0_DIO31_MASK                                               \
  ((uint32_t)0x80000000U) /* !< This bit sets the value of the pin             \
                             configured as DIO31 when the output               \
                             is enabled through DOE31_0 register. */
#define GPIO_DOUT31_0_DIO31_ZERO                                               \
  ((uint32_t)0x00000000U) /* !< Output is set to 0 */
#define GPIO_DOUT31_0_DIO31_ONE                                                \
  ((uint32_t)0x80000000U) /* !< Output is set to 1 */

