luckycyang/mspm0l1306-dev/include/ti/devices/msp/peripherals/hw_gpio.h
/* GPIO_DOUTTGL31_0 Bits */
/* GPIO_DOUTTGL31_0[DIO0] Bits */
#define GPIO_DOUTTGL31_0_DIO0_OFS (0) /* !< DIO0 Offset */
#define GPIO_DOUTTGL31_0_DIO0_MASK                                             \
  ((uint32_t)0x00000001U) /* !< This bit is used to toggle DIO0                \
                             output. */
#define GPIO_DOUTTGL31_0_DIO0_NO_EFFECT                                        \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_DOUTTGL31_0_DIO0_TOGGLE                                           \
  ((uint32_t)0x00000001U) /* !< Toggle output */
/* GPIO_DOUTTGL31_0[DIO1] Bits */
#define GPIO_DOUTTGL31_0_DIO1_OFS (1) /* !< DIO1 Offset */
#define GPIO_DOUTTGL31_0_DIO1_MASK                                             \
  ((uint32_t)0x00000002U) /* !< This bit is used to toggle DIO1                \
                             output. */
#define GPIO_DOUTTGL31_0_DIO1_NO_EFFECT                                        \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_DOUTTGL31_0_DIO1_TOGGLE                                           \
  ((uint32_t)0x00000002U) /* !< Toggle output */
/* GPIO_DOUTTGL31_0[DIO2] Bits */
#define GPIO_DOUTTGL31_0_DIO2_OFS (2) /* !< DIO2 Offset */
#define GPIO_DOUTTGL31_0_DIO2_MASK                                             \
  ((uint32_t)0x00000004U) /* !< This bit is used to toggle DIO2                \
                             output. */
#define GPIO_DOUTTGL31_0_DIO2_NO_EFFECT                                        \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_DOUTTGL31_0_DIO2_TOGGLE                                           \
  ((uint32_t)0x00000004U) /* !< Toggle output */
/* GPIO_DOUTTGL31_0[DIO3] Bits */
#define GPIO_DOUTTGL31_0_DIO3_OFS (3) /* !< DIO3 Offset */
#define GPIO_DOUTTGL31_0_DIO3_MASK                                             \
  ((uint32_t)0x00000008U) /* !< This bit is used to toggle DIO3                \
                             output. */
#define GPIO_DOUTTGL31_0_DIO3_NO_EFFECT                                        \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_DOUTTGL31_0_DIO3_TOGGLE                                           \
  ((uint32_t)0x00000008U) /* !< Toggle output */
/* GPIO_DOUTTGL31_0[DIO4] Bits */
#define GPIO_DOUTTGL31_0_DIO4_OFS (4) /* !< DIO4 Offset */
#define GPIO_DOUTTGL31_0_DIO4_MASK                                             \
  ((uint32_t)0x00000010U) /* !< This bit is used to toggle DIO4                \
                             output. */
#define GPIO_DOUTTGL31_0_DIO4_NO_EFFECT                                        \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_DOUTTGL31_0_DIO4_TOGGLE                                           \
  ((uint32_t)0x00000010U) /* !< Toggle output */
/* GPIO_DOUTTGL31_0[DIO5] Bits */
#define GPIO_DOUTTGL31_0_DIO5_OFS (5) /* !< DIO5 Offset */
#define GPIO_DOUTTGL31_0_DIO5_MASK                                             \
  ((uint32_t)0x00000020U) /* !< This bit is used to toggle DIO5                \
                             output. */
#define GPIO_DOUTTGL31_0_DIO5_NO_EFFECT                                        \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_DOUTTGL31_0_DIO5_TOGGLE                                           \
  ((uint32_t)0x00000020U) /* !< Toggle output */
/* GPIO_DOUTTGL31_0[DIO6] Bits */
#define GPIO_DOUTTGL31_0_DIO6_OFS (6) /* !< DIO6 Offset */
#define GPIO_DOUTTGL31_0_DIO6_MASK                                             \
  ((uint32_t)0x00000040U) /* !< This bit is used to toggle DIO6                \
                             output. */
#define GPIO_DOUTTGL31_0_DIO6_NO_EFFECT                                        \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_DOUTTGL31_0_DIO6_TOGGLE                                           \
  ((uint32_t)0x00000040U) /* !< Toggle output */
/* GPIO_DOUTTGL31_0[DIO7] Bits */
#define GPIO_DOUTTGL31_0_DIO7_OFS (7) /* !< DIO7 Offset */
#define GPIO_DOUTTGL31_0_DIO7_MASK                                             \
  ((uint32_t)0x00000080U) /* !< This bit is used to toggle DIO7                \
                             output. */
#define GPIO_DOUTTGL31_0_DIO7_NO_EFFECT                                        \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_DOUTTGL31_0_DIO7_TOGGLE                                           \
  ((uint32_t)0x00000080U) /* !< Toggle output */
/* GPIO_DOUTTGL31_0[DIO8] Bits */
#define GPIO_DOUTTGL31_0_DIO8_OFS (8) /* !< DIO8 Offset */
#define GPIO_DOUTTGL31_0_DIO8_MASK                                             \
  ((uint32_t)0x00000100U) /* !< This bit is used to toggle DIO8                \
                             output. */
#define GPIO_DOUTTGL31_0_DIO8_NO_EFFECT                                        \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_DOUTTGL31_0_DIO8_TOGGLE                                           \
  ((uint32_t)0x00000100U) /* !< Toggle output */
/* GPIO_DOUTTGL31_0[DIO9] Bits */
#define GPIO_DOUTTGL31_0_DIO9_OFS (9) /* !< DIO9 Offset */
#define GPIO_DOUTTGL31_0_DIO9_MASK                                             \
  ((uint32_t)0x00000200U) /* !< This bit is used to toggle DIO9                \
                             output. */
#define GPIO_DOUTTGL31_0_DIO9_NO_EFFECT                                        \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_DOUTTGL31_0_DIO9_TOGGLE                                           \
  ((uint32_t)0x00000200U) /* !< Toggle output */
/* GPIO_DOUTTGL31_0[DIO10] Bits */
#define GPIO_DOUTTGL31_0_DIO10_OFS (10) /* !< DIO10 Offset */
#define GPIO_DOUTTGL31_0_DIO10_MASK                                            \
  ((uint32_t)0x00000400U) /* !< This bit is used to toggle DIO10               \
                             output. */
#define GPIO_DOUTTGL31_0_DIO10_NO_EFFECT                                       \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_DOUTTGL31_0_DIO10_TOGGLE                                          \
  ((uint32_t)0x00000400U) /* !< Toggle output */
/* GPIO_DOUTTGL31_0[DIO11] Bits */
#define GPIO_DOUTTGL31_0_DIO11_OFS (11) /* !< DIO11 Offset */
#define GPIO_DOUTTGL31_0_DIO11_MASK                                            \
  ((uint32_t)0x00000800U) /* !< This bit is used to toggle DIO11               \
                             output. */
#define GPIO_DOUTTGL31_0_DIO11_NO_EFFECT                                       \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_DOUTTGL31_0_DIO11_TOGGLE                                          \
  ((uint32_t)0x00000800U) /* !< Toggle output */
/* GPIO_DOUTTGL31_0[DIO12] Bits */
#define GPIO_DOUTTGL31_0_DIO12_OFS (12) /* !< DIO12 Offset */
#define GPIO_DOUTTGL31_0_DIO12_MASK                                            \
  ((uint32_t)0x00001000U) /* !< This bit is used to toggle DIO12               \
                             output. */
#define GPIO_DOUTTGL31_0_DIO12_NO_EFFECT                                       \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_DOUTTGL31_0_DIO12_TOGGLE                                          \
  ((uint32_t)0x00001000U) /* !< Toggle output */
/* GPIO_DOUTTGL31_0[DIO13] Bits */
#define GPIO_DOUTTGL31_0_DIO13_OFS (13) /* !< DIO13 Offset */
#define GPIO_DOUTTGL31_0_DIO13_MASK                                            \
  ((uint32_t)0x00002000U) /* !< This bit is used to toggle DIO13               \
                             output. */
#define GPIO_DOUTTGL31_0_DIO13_NO_EFFECT                                       \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_DOUTTGL31_0_DIO13_TOGGLE                                          \
  ((uint32_t)0x00002000U) /* !< Toggle output */
/* GPIO_DOUTTGL31_0[DIO14] Bits */
#define GPIO_DOUTTGL31_0_DIO14_OFS (14) /* !< DIO14 Offset */
#define GPIO_DOUTTGL31_0_DIO14_MASK                                            \
  ((uint32_t)0x00004000U) /* !< This bit is used to toggle DIO14               \
                             output. */
#define GPIO_DOUTTGL31_0_DIO14_NO_EFFECT                                       \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_DOUTTGL31_0_DIO14_TOGGLE                                          \
  ((uint32_t)0x00004000U) /* !< Toggle output */
/* GPIO_DOUTTGL31_0[DIO15] Bits */
#define GPIO_DOUTTGL31_0_DIO15_OFS (15) /* !< DIO15 Offset */
#define GPIO_DOUTTGL31_0_DIO15_MASK                                            \
  ((uint32_t)0x00008000U) /* !< This bit is used to toggle DIO15               \
                             output. */
#define GPIO_DOUTTGL31_0_DIO15_NO_EFFECT                                       \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_DOUTTGL31_0_DIO15_TOGGLE                                          \
  ((uint32_t)0x00008000U) /* !< Toggle output */
/* GPIO_DOUTTGL31_0[DIO16] Bits */
#define GPIO_DOUTTGL31_0_DIO16_OFS (16) /* !< DIO16 Offset */
#define GPIO_DOUTTGL31_0_DIO16_MASK                                            \
  ((uint32_t)0x00010000U) /* !< This bit is used to toggle DIO16               \
                             output. */
#define GPIO_DOUTTGL31_0_DIO16_NO_EFFECT                                       \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_DOUTTGL31_0_DIO16_TOGGLE                                          \
  ((uint32_t)0x00010000U) /* !< Toggle output */
/* GPIO_DOUTTGL31_0[DIO17] Bits */
#define GPIO_DOUTTGL31_0_DIO17_OFS (17) /* !< DIO17 Offset */
#define GPIO_DOUTTGL31_0_DIO17_MASK                                            \
  ((uint32_t)0x00020000U) /* !< This bit is used to toggle DIO17               \
                             output. */
#define GPIO_DOUTTGL31_0_DIO17_NO_EFFECT                                       \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_DOUTTGL31_0_DIO17_TOGGLE                                          \
  ((uint32_t)0x00020000U) /* !< Toggle output */
/* GPIO_DOUTTGL31_0[DIO18] Bits */
#define GPIO_DOUTTGL31_0_DIO18_OFS (18) /* !< DIO18 Offset */
#define GPIO_DOUTTGL31_0_DIO18_MASK                                            \
  ((uint32_t)0x00040000U) /* !< This bit is used to toggle DIO18               \
                             output. */
#define GPIO_DOUTTGL31_0_DIO18_NO_EFFECT                                       \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_DOUTTGL31_0_DIO18_TOGGLE                                          \
  ((uint32_t)0x00040000U) /* !< Toggle output */
/* GPIO_DOUTTGL31_0[DIO19] Bits */
#define GPIO_DOUTTGL31_0_DIO19_OFS (19) /* !< DIO19 Offset */
#define GPIO_DOUTTGL31_0_DIO19_MASK                                            \
  ((uint32_t)0x00080000U) /* !< This bit is used to toggle DIO19               \
                             output. */
#define GPIO_DOUTTGL31_0_DIO19_NO_EFFECT                                       \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_DOUTTGL31_0_DIO19_TOGGLE                                          \
  ((uint32_t)0x00080000U) /* !< Toggle output */
/* GPIO_DOUTTGL31_0[DIO20] Bits */
#define GPIO_DOUTTGL31_0_DIO20_OFS (20) /* !< DIO20 Offset */
#define GPIO_DOUTTGL31_0_DIO20_MASK                                            \
  ((uint32_t)0x00100000U) /* !< This bit is used to toggle DIO20               \
                             output. */
#define GPIO_DOUTTGL31_0_DIO20_NO_EFFECT                                       \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_DOUTTGL31_0_DIO20_TOGGLE                                          \
  ((uint32_t)0x00100000U) /* !< Toggle output */
/* GPIO_DOUTTGL31_0[DIO21] Bits */
#define GPIO_DOUTTGL31_0_DIO21_OFS (21) /* !< DIO21 Offset */
#define GPIO_DOUTTGL31_0_DIO21_MASK                                            \
  ((uint32_t)0x00200000U) /* !< This bit is used to toggle DIO21               \
                             output. */
#define GPIO_DOUTTGL31_0_DIO21_NO_EFFECT                                       \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_DOUTTGL31_0_DIO21_TOGGLE                                          \
  ((uint32_t)0x00200000U) /* !< Toggle output */
/* GPIO_DOUTTGL31_0[DIO22] Bits */
#define GPIO_DOUTTGL31_0_DIO22_OFS (22) /* !< DIO22 Offset */
#define GPIO_DOUTTGL31_0_DIO22_MASK                                            \
  ((uint32_t)0x00400000U) /* !< This bit is used to toggle DIO22               \
                             output. */
#define GPIO_DOUTTGL31_0_DIO22_NO_EFFECT                                       \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_DOUTTGL31_0_DIO22_TOGGLE                                          \
  ((uint32_t)0x00400000U) /* !< Toggle output */
/* GPIO_DOUTTGL31_0[DIO23] Bits */
#define GPIO_DOUTTGL31_0_DIO23_OFS (23) /* !< DIO23 Offset */
#define GPIO_DOUTTGL31_0_DIO23_MASK                                            \
  ((uint32_t)0x00800000U) /* !< This bit is used to toggle DIO23               \
                             output. */
#define GPIO_DOUTTGL31_0_DIO23_NO_EFFECT                                       \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_DOUTTGL31_0_DIO23_TOGGLE                                          \
  ((uint32_t)0x00800000U) /* !< Toggle output */
/* GPIO_DOUTTGL31_0[DIO24] Bits */
#define GPIO_DOUTTGL31_0_DIO24_OFS (24) /* !< DIO24 Offset */
#define GPIO_DOUTTGL31_0_DIO24_MASK                                            \
  ((uint32_t)0x01000000U) /* !< This bit is used to toggle DIO24               \
                             output. */
#define GPIO_DOUTTGL31_0_DIO24_NO_EFFECT                                       \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_DOUTTGL31_0_DIO24_TOGGLE                                          \
  ((uint32_t)0x01000000U) /* !< Toggle output */
/* GPIO_DOUTTGL31_0[DIO25] Bits */
#define GPIO_DOUTTGL31_0_DIO25_OFS (25) /* !< DIO25 Offset */
#define GPIO_DOUTTGL31_0_DIO25_MASK                                            \
  ((uint32_t)0x02000000U) /* !< This bit is used to toggle DIO25               \
                             output. */
#define GPIO_DOUTTGL31_0_DIO25_NO_EFFECT                                       \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_DOUTTGL31_0_DIO25_TOGGLE                                          \
  ((uint32_t)0x02000000U) /* !< Toggle output */
/* GPIO_DOUTTGL31_0[DIO26] Bits */
#define GPIO_DOUTTGL31_0_DIO26_OFS (26) /* !< DIO26 Offset */
#define GPIO_DOUTTGL31_0_DIO26_MASK                                            \
  ((uint32_t)0x04000000U) /* !< This bit is used to toggle DIO26               \
                             output. */
#define GPIO_DOUTTGL31_0_DIO26_NO_EFFECT                                       \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_DOUTTGL31_0_DIO26_TOGGLE                                          \
  ((uint32_t)0x04000000U) /* !< Toggle output */
/* GPIO_DOUTTGL31_0[DIO27] Bits */
#define GPIO_DOUTTGL31_0_DIO27_OFS (27) /* !< DIO27 Offset */
#define GPIO_DOUTTGL31_0_DIO27_MASK                                            \
  ((uint32_t)0x08000000U) /* !< This bit is used to toggle DIO27               \
                             output. */
#define GPIO_DOUTTGL31_0_DIO27_NO_EFFECT                                       \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_DOUTTGL31_0_DIO27_TOGGLE                                          \
  ((uint32_t)0x08000000U) /* !< Toggle output */
/* GPIO_DOUTTGL31_0[DIO28] Bits */
#define GPIO_DOUTTGL31_0_DIO28_OFS (28) /* !< DIO28 Offset */
#define GPIO_DOUTTGL31_0_DIO28_MASK                                            \
  ((uint32_t)0x10000000U) /* !< This bit is used to toggle DIO28               \
                             output. */
#define GPIO_DOUTTGL31_0_DIO28_NO_EFFECT                                       \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_DOUTTGL31_0_DIO28_TOGGLE                                          \
  ((uint32_t)0x10000000U) /* !< Toggle output */
/* GPIO_DOUTTGL31_0[DIO29] Bits */
#define GPIO_DOUTTGL31_0_DIO29_OFS (29) /* !< DIO29 Offset */
#define GPIO_DOUTTGL31_0_DIO29_MASK                                            \
  ((uint32_t)0x20000000U) /* !< This bit is used to toggle DIO29               \
                             output. */
#define GPIO_DOUTTGL31_0_DIO29_NO_EFFECT                                       \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_DOUTTGL31_0_DIO29_TOGGLE                                          \
  ((uint32_t)0x20000000U) /* !< Toggle output */
/* GPIO_DOUTTGL31_0[DIO30] Bits */
#define GPIO_DOUTTGL31_0_DIO30_OFS (30) /* !< DIO30 Offset */
#define GPIO_DOUTTGL31_0_DIO30_MASK                                            \
  ((uint32_t)0x40000000U) /* !< This bit is used to toggle DIO30               \
                             output. */
#define GPIO_DOUTTGL31_0_DIO30_NO_EFFECT                                       \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_DOUTTGL31_0_DIO30_TOGGLE                                          \
  ((uint32_t)0x40000000U) /* !< Toggle output */
/* GPIO_DOUTTGL31_0[DIO31] Bits */
#define GPIO_DOUTTGL31_0_DIO31_OFS (31) /* !< DIO31 Offset */
#define GPIO_DOUTTGL31_0_DIO31_MASK                                            \
  ((uint32_t)0x80000000U) /* !< This bit is used to toggle DIO31               \
                             output. */
#define GPIO_DOUTTGL31_0_DIO31_NO_EFFECT                                       \
  ((uint32_t)0x00000000U) /* !< No effect */
#define GPIO_DOUTTGL31_0_DIO31_TOGGLE                                          \
  ((uint32_t)0x80000000U) /* !< Toggle output */

