luckycyang/mspm0l1306-dev/include/ti/devices/msp/peripherals/hw_gpio.h
/* GPIO_DOE31_0 Bits */
/* GPIO_DOE31_0[DIO0] Bits */
#define GPIO_DOE31_0_DIO0_OFS (0) /* !< DIO0 Offset */
#define GPIO_DOE31_0_DIO0_MASK                                                 \
  ((uint32_t)0x00000001U) /* !< Enables data output for DIO0. */
#define GPIO_DOE31_0_DIO0_DISABLE                                              \
  ((uint32_t)0x00000000U) /* !< Output disabled */
#define GPIO_DOE31_0_DIO0_ENABLE                                               \
  ((uint32_t)0x00000001U) /* !< Output enabled                                 \
                           */
/* GPIO_DOE31_0[DIO1] Bits */
#define GPIO_DOE31_0_DIO1_OFS (1) /* !< DIO1 Offset */
#define GPIO_DOE31_0_DIO1_MASK                                                 \
  ((uint32_t)0x00000002U) /* !< Enables data output for DIO1. */
#define GPIO_DOE31_0_DIO1_DISABLE                                              \
  ((uint32_t)0x00000000U) /* !< Output disabled */
#define GPIO_DOE31_0_DIO1_ENABLE                                               \
  ((uint32_t)0x00000002U) /* !< Output enabled                                 \
                           */
/* GPIO_DOE31_0[DIO2] Bits */
#define GPIO_DOE31_0_DIO2_OFS (2) /* !< DIO2 Offset */
#define GPIO_DOE31_0_DIO2_MASK                                                 \
  ((uint32_t)0x00000004U) /* !< Enables data output for DIO2. */
#define GPIO_DOE31_0_DIO2_DISABLE                                              \
  ((uint32_t)0x00000000U) /* !< Output disabled */
#define GPIO_DOE31_0_DIO2_ENABLE                                               \
  ((uint32_t)0x00000004U) /* !< Output enabled                                 \
                           */
/* GPIO_DOE31_0[DIO3] Bits */
#define GPIO_DOE31_0_DIO3_OFS (3) /* !< DIO3 Offset */
#define GPIO_DOE31_0_DIO3_MASK                                                 \
  ((uint32_t)0x00000008U) /* !< Enables data output for DIO3. */
#define GPIO_DOE31_0_DIO3_DISABLE                                              \
  ((uint32_t)0x00000000U) /* !< Output disabled */
#define GPIO_DOE31_0_DIO3_ENABLE                                               \
  ((uint32_t)0x00000008U) /* !< Output enabled                                 \
                           */
/* GPIO_DOE31_0[DIO4] Bits */
#define GPIO_DOE31_0_DIO4_OFS (4) /* !< DIO4 Offset */
#define GPIO_DOE31_0_DIO4_MASK                                                 \
  ((uint32_t)0x00000010U) /* !< Enables data output for DIO4. */
#define GPIO_DOE31_0_DIO4_DISABLE                                              \
  ((uint32_t)0x00000000U) /* !< Output disabled */
#define GPIO_DOE31_0_DIO4_ENABLE                                               \
  ((uint32_t)0x00000010U) /* !< Output enabled                                 \
                           */
/* GPIO_DOE31_0[DIO5] Bits */
#define GPIO_DOE31_0_DIO5_OFS (5) /* !< DIO5 Offset */
#define GPIO_DOE31_0_DIO5_MASK                                                 \
  ((uint32_t)0x00000020U) /* !< Enables data output for DIO5. */
#define GPIO_DOE31_0_DIO5_DISABLE                                              \
  ((uint32_t)0x00000000U) /* !< Output disabled */
#define GPIO_DOE31_0_DIO5_ENABLE                                               \
  ((uint32_t)0x00000020U) /* !< Output enabled                                 \
                           */
/* GPIO_DOE31_0[DIO6] Bits */
#define GPIO_DOE31_0_DIO6_OFS (6) /* !< DIO6 Offset */
#define GPIO_DOE31_0_DIO6_MASK                                                 \
  ((uint32_t)0x00000040U) /* !< Enables data output for DIO6. */
#define GPIO_DOE31_0_DIO6_DISABLE                                              \
  ((uint32_t)0x00000000U) /* !< Output disabled */
#define GPIO_DOE31_0_DIO6_ENABLE                                               \
  ((uint32_t)0x00000040U) /* !< Output enabled                                 \
                           */
/* GPIO_DOE31_0[DIO7] Bits */
#define GPIO_DOE31_0_DIO7_OFS (7) /* !< DIO7 Offset */
#define GPIO_DOE31_0_DIO7_MASK                                                 \
  ((uint32_t)0x00000080U) /* !< Enables data output for DIO7. */
#define GPIO_DOE31_0_DIO7_DISABLE                                              \
  ((uint32_t)0x00000000U) /* !< Output disabled */
#define GPIO_DOE31_0_DIO7_ENABLE                                               \
  ((uint32_t)0x00000080U) /* !< Output enabled                                 \
                           */
/* GPIO_DOE31_0[DIO8] Bits */
#define GPIO_DOE31_0_DIO8_OFS (8) /* !< DIO8 Offset */
#define GPIO_DOE31_0_DIO8_MASK                                                 \
  ((uint32_t)0x00000100U) /* !< Enables data output for DIO8. */
#define GPIO_DOE31_0_DIO8_DISABLE                                              \
  ((uint32_t)0x00000000U) /* !< Output disabled */
#define GPIO_DOE31_0_DIO8_ENABLE                                               \
  ((uint32_t)0x00000100U) /* !< Output enabled                                 \
                           */
/* GPIO_DOE31_0[DIO9] Bits */
#define GPIO_DOE31_0_DIO9_OFS (9) /* !< DIO9 Offset */
#define GPIO_DOE31_0_DIO9_MASK                                                 \
  ((uint32_t)0x00000200U) /* !< Enables data output for DIO9. */
#define GPIO_DOE31_0_DIO9_DISABLE                                              \
  ((uint32_t)0x00000000U) /* !< Output disabled */
#define GPIO_DOE31_0_DIO9_ENABLE                                               \
  ((uint32_t)0x00000200U) /* !< Output enabled                                 \
                           */
/* GPIO_DOE31_0[DIO10] Bits */
#define GPIO_DOE31_0_DIO10_OFS (10) /* !< DIO10 Offset */
#define GPIO_DOE31_0_DIO10_MASK                                                \
  ((uint32_t)0x00000400U) /* !< Enables data output for DIO10. */
#define GPIO_DOE31_0_DIO10_DISABLE                                             \
  ((uint32_t)0x00000000U) /* !< Output disabled */
#define GPIO_DOE31_0_DIO10_ENABLE                                              \
  ((uint32_t)0x00000400U) /* !< Output enabled */
/* GPIO_DOE31_0[DIO11] Bits */
#define GPIO_DOE31_0_DIO11_OFS (11) /* !< DIO11 Offset */
#define GPIO_DOE31_0_DIO11_MASK                                                \
  ((uint32_t)0x00000800U) /* !< Enables data output for DIO11. */
#define GPIO_DOE31_0_DIO11_DISABLE                                             \
  ((uint32_t)0x00000000U) /* !< Output disabled */
#define GPIO_DOE31_0_DIO11_ENABLE                                              \
  ((uint32_t)0x00000800U) /* !< Output enabled */
/* GPIO_DOE31_0[DIO12] Bits */
#define GPIO_DOE31_0_DIO12_OFS (12) /* !< DIO12 Offset */
#define GPIO_DOE31_0_DIO12_MASK                                                \
  ((uint32_t)0x00001000U) /* !< Enables data output for DIO12. */
#define GPIO_DOE31_0_DIO12_DISABLE                                             \
  ((uint32_t)0x00000000U) /* !< Output disabled */
#define GPIO_DOE31_0_DIO12_ENABLE                                              \
  ((uint32_t)0x00001000U) /* !< Output enabled */
/* GPIO_DOE31_0[DIO13] Bits */
#define GPIO_DOE31_0_DIO13_OFS (13) /* !< DIO13 Offset */
#define GPIO_DOE31_0_DIO13_MASK                                                \
  ((uint32_t)0x00002000U) /* !< Enables data output for DIO13. */
#define GPIO_DOE31_0_DIO13_DISABLE                                             \
  ((uint32_t)0x00000000U) /* !< Output disabled */
#define GPIO_DOE31_0_DIO13_ENABLE                                              \
  ((uint32_t)0x00002000U) /* !< Output enabled */
/* GPIO_DOE31_0[DIO14] Bits */
#define GPIO_DOE31_0_DIO14_OFS (14) /* !< DIO14 Offset */
#define GPIO_DOE31_0_DIO14_MASK                                                \
  ((uint32_t)0x00004000U) /* !< Enables data output for DIO14. */
#define GPIO_DOE31_0_DIO14_DISABLE                                             \
  ((uint32_t)0x00000000U) /* !< Output disabled */
#define GPIO_DOE31_0_DIO14_ENABLE                                              \
  ((uint32_t)0x00004000U) /* !< Output enabled */
/* GPIO_DOE31_0[DIO15] Bits */
#define GPIO_DOE31_0_DIO15_OFS (15) /* !< DIO15 Offset */
#define GPIO_DOE31_0_DIO15_MASK                                                \
  ((uint32_t)0x00008000U) /* !< Enables data output for DIO15. */
#define GPIO_DOE31_0_DIO15_DISABLE                                             \
  ((uint32_t)0x00000000U) /* !< Output disabled */
#define GPIO_DOE31_0_DIO15_ENABLE                                              \
  ((uint32_t)0x00008000U) /* !< Output enabled */
/* GPIO_DOE31_0[DIO16] Bits */
#define GPIO_DOE31_0_DIO16_OFS (16) /* !< DIO16 Offset */
#define GPIO_DOE31_0_DIO16_MASK                                                \
  ((uint32_t)0x00010000U) /* !< Enables data output for DIO16. */
#define GPIO_DOE31_0_DIO16_DISABLE                                             \
  ((uint32_t)0x00000000U) /* !< Output disabled */
#define GPIO_DOE31_0_DIO16_ENABLE                                              \
  ((uint32_t)0x00010000U) /* !< Output enabled */
/* GPIO_DOE31_0[DIO17] Bits */
#define GPIO_DOE31_0_DIO17_OFS (17) /* !< DIO17 Offset */
#define GPIO_DOE31_0_DIO17_MASK                                                \
  ((uint32_t)0x00020000U) /* !< Enables data output for DIO17. */
#define GPIO_DOE31_0_DIO17_DISABLE                                             \
  ((uint32_t)0x00000000U) /* !< Output disabled */
#define GPIO_DOE31_0_DIO17_ENABLE                                              \
  ((uint32_t)0x00020000U) /* !< Output enabled */
/* GPIO_DOE31_0[DIO18] Bits */
#define GPIO_DOE31_0_DIO18_OFS (18) /* !< DIO18 Offset */
#define GPIO_DOE31_0_DIO18_MASK                                                \
  ((uint32_t)0x00040000U) /* !< Enables data output for DIO18. */
#define GPIO_DOE31_0_DIO18_DISABLE                                             \
  ((uint32_t)0x00000000U) /* !< Output disabled */
#define GPIO_DOE31_0_DIO18_ENABLE                                              \
  ((uint32_t)0x00040000U) /* !< Output enabled */
/* GPIO_DOE31_0[DIO19] Bits */
#define GPIO_DOE31_0_DIO19_OFS (19) /* !< DIO19 Offset */
#define GPIO_DOE31_0_DIO19_MASK                                                \
  ((uint32_t)0x00080000U) /* !< Enables data output for DIO19. */
#define GPIO_DOE31_0_DIO19_DISABLE                                             \
  ((uint32_t)0x00000000U) /* !< Output disabled */
#define GPIO_DOE31_0_DIO19_ENABLE                                              \
  ((uint32_t)0x00080000U) /* !< Output enabled */
/* GPIO_DOE31_0[DIO20] Bits */
#define GPIO_DOE31_0_DIO20_OFS (20) /* !< DIO20 Offset */
#define GPIO_DOE31_0_DIO20_MASK                                                \
  ((uint32_t)0x00100000U) /* !< Enables data output for DIO20. */
#define GPIO_DOE31_0_DIO20_DISABLE                                             \
  ((uint32_t)0x00000000U) /* !< Output disabled */
#define GPIO_DOE31_0_DIO20_ENABLE                                              \
  ((uint32_t)0x00100000U) /* !< Output enabled */
/* GPIO_DOE31_0[DIO21] Bits */
#define GPIO_DOE31_0_DIO21_OFS (21) /* !< DIO21 Offset */
#define GPIO_DOE31_0_DIO21_MASK                                                \
  ((uint32_t)0x00200000U) /* !< Enables data output for DIO21. */
#define GPIO_DOE31_0_DIO21_DISABLE                                             \
  ((uint32_t)0x00000000U) /* !< Output disabled */
#define GPIO_DOE31_0_DIO21_ENABLE                                              \
  ((uint32_t)0x00200000U) /* !< Output enabled */
/* GPIO_DOE31_0[DIO22] Bits */
#define GPIO_DOE31_0_DIO22_OFS (22) /* !< DIO22 Offset */
#define GPIO_DOE31_0_DIO22_MASK                                                \
  ((uint32_t)0x00400000U) /* !< Enables data output for DIO22. */
#define GPIO_DOE31_0_DIO22_DISABLE                                             \
  ((uint32_t)0x00000000U) /* !< Output disabled */
#define GPIO_DOE31_0_DIO22_ENABLE                                              \
  ((uint32_t)0x00400000U) /* !< Output enabled */
/* GPIO_DOE31_0[DIO23] Bits */
#define GPIO_DOE31_0_DIO23_OFS (23) /* !< DIO23 Offset */
#define GPIO_DOE31_0_DIO23_MASK                                                \
  ((uint32_t)0x00800000U) /* !< Enables data output for DIO23. */
#define GPIO_DOE31_0_DIO23_DISABLE                                             \
  ((uint32_t)0x00000000U) /* !< Output disabled */
#define GPIO_DOE31_0_DIO23_ENABLE                                              \
  ((uint32_t)0x00800000U) /* !< Output enabled */
/* GPIO_DOE31_0[DIO24] Bits */
#define GPIO_DOE31_0_DIO24_OFS (24) /* !< DIO24 Offset */
#define GPIO_DOE31_0_DIO24_MASK                                                \
  ((uint32_t)0x01000000U) /* !< Enables data output for DIO24. */
#define GPIO_DOE31_0_DIO24_DISABLE                                             \
  ((uint32_t)0x00000000U) /* !< Output disabled */
#define GPIO_DOE31_0_DIO24_ENABLE                                              \
  ((uint32_t)0x01000000U) /* !< Output enabled */
/* GPIO_DOE31_0[DIO25] Bits */
#define GPIO_DOE31_0_DIO25_OFS (25) /* !< DIO25 Offset */
#define GPIO_DOE31_0_DIO25_MASK                                                \
  ((uint32_t)0x02000000U) /* !< Enables data output for DIO25. */
#define GPIO_DOE31_0_DIO25_DISABLE                                             \
  ((uint32_t)0x00000000U) /* !< Output disabled */
#define GPIO_DOE31_0_DIO25_ENABLE                                              \
  ((uint32_t)0x02000000U) /* !< Output enabled */
/* GPIO_DOE31_0[DIO26] Bits */
#define GPIO_DOE31_0_DIO26_OFS (26) /* !< DIO26 Offset */
#define GPIO_DOE31_0_DIO26_MASK                                                \
  ((uint32_t)0x04000000U) /* !< Enables data output for DIO26. */
#define GPIO_DOE31_0_DIO26_DISABLE                                             \
  ((uint32_t)0x00000000U) /* !< Output disabled */
#define GPIO_DOE31_0_DIO26_ENABLE                                              \
  ((uint32_t)0x04000000U) /* !< Output enabled */
/* GPIO_DOE31_0[DIO27] Bits */
#define GPIO_DOE31_0_DIO27_OFS (27) /* !< DIO27 Offset */
#define GPIO_DOE31_0_DIO27_MASK                                                \
  ((uint32_t)0x08000000U) /* !< Enables data output for DIO27. */
#define GPIO_DOE31_0_DIO27_DISABLE                                             \
  ((uint32_t)0x00000000U) /* !< Output disabled */
#define GPIO_DOE31_0_DIO27_ENABLE                                              \
  ((uint32_t)0x08000000U) /* !< Output enabled */
/* GPIO_DOE31_0[DIO28] Bits */
#define GPIO_DOE31_0_DIO28_OFS (28) /* !< DIO28 Offset */
#define GPIO_DOE31_0_DIO28_MASK                                                \
  ((uint32_t)0x10000000U) /* !< Enables data output for DIO28. */
#define GPIO_DOE31_0_DIO28_DISABLE                                             \
  ((uint32_t)0x00000000U) /* !< Output disabled */
#define GPIO_DOE31_0_DIO28_ENABLE                                              \
  ((uint32_t)0x10000000U) /* !< Output enabled */
/* GPIO_DOE31_0[DIO29] Bits */
#define GPIO_DOE31_0_DIO29_OFS (29) /* !< DIO29 Offset */
#define GPIO_DOE31_0_DIO29_MASK                                                \
  ((uint32_t)0x20000000U) /* !< Enables data output for DIO29. */
#define GPIO_DOE31_0_DIO29_DISABLE                                             \
  ((uint32_t)0x00000000U) /* !< Output disabled */
#define GPIO_DOE31_0_DIO29_ENABLE                                              \
  ((uint32_t)0x20000000U) /* !< Output enabled */
/* GPIO_DOE31_0[DIO30] Bits */
#define GPIO_DOE31_0_DIO30_OFS (30) /* !< DIO30 Offset */
#define GPIO_DOE31_0_DIO30_MASK                                                \
  ((uint32_t)0x40000000U) /* !< Enables data output for DIO30. */
#define GPIO_DOE31_0_DIO30_DISABLE                                             \
  ((uint32_t)0x00000000U) /* !< Output disabled */
#define GPIO_DOE31_0_DIO30_ENABLE                                              \
  ((uint32_t)0x40000000U) /* !< Output enabled */
/* GPIO_DOE31_0[DIO31] Bits */
#define GPIO_DOE31_0_DIO31_OFS (31) /* !< DIO31 Offset */
#define GPIO_DOE31_0_DIO31_MASK                                                \
  ((uint32_t)0x80000000U) /* !< Enables data output for DIO31. */
#define GPIO_DOE31_0_DIO31_DISABLE                                             \
  ((uint32_t)0x00000000U) /* !< Output disabled */
#define GPIO_DOE31_0_DIO31_ENABLE                                              \
  ((uint32_t)0x80000000U) /* !< Output enabled */

