luckycyang/mspm0l1306-dev/include/ti/devices/msp/peripherals/hw_gpio.h
/* GPIO_DMAMASK Bits */
/* GPIO_DMAMASK[DOUT0] Bits */
#define GPIO_DMAMASK_DOUT0_OFS (0) /* !< DOUT0 Offset */
#define GPIO_DMAMASK_DOUT0_MASK                                                \
  ((uint32_t)0x00000001U) /* !< DMA is allowed to modify DOUT0 */
#define GPIO_DMAMASK_DOUT0_DISABLE                                             \
  ((uint32_t)0x00000000U) /* !< DMA is not allowed to modify this              \
                             bit lane */
#define GPIO_DMAMASK_DOUT0_ENABLE                                              \
  ((uint32_t)0x00000001U) /* !< DMA is allowed to modify this bit              \
                             lane */
/* GPIO_DMAMASK[DOUT1] Bits */
#define GPIO_DMAMASK_DOUT1_OFS (1) /* !< DOUT1 Offset */
#define GPIO_DMAMASK_DOUT1_MASK                                                \
  ((uint32_t)0x00000002U) /* !< DMA is allowed to modify DOUT1 */
#define GPIO_DMAMASK_DOUT1_DISABLE                                             \
  ((uint32_t)0x00000000U) /* !< DMA is not allowed to modify this              \
                             bit lane */
#define GPIO_DMAMASK_DOUT1_ENABLE                                              \
  ((uint32_t)0x00000002U) /* !< DMA is allowed to modify this bit              \
                             lane */
/* GPIO_DMAMASK[DOUT2] Bits */
#define GPIO_DMAMASK_DOUT2_OFS (2) /* !< DOUT2 Offset */
#define GPIO_DMAMASK_DOUT2_MASK                                                \
  ((uint32_t)0x00000004U) /* !< DMA is allowed to modify DOUT2 */
#define GPIO_DMAMASK_DOUT2_DISABLE                                             \
  ((uint32_t)0x00000000U) /* !< DMA is not allowed to modify this              \
                             bit lane */
#define GPIO_DMAMASK_DOUT2_ENABLE                                              \
  ((uint32_t)0x00000004U) /* !< DMA is allowed to modify this bit              \
                             lane */
/* GPIO_DMAMASK[DOUT3] Bits */
#define GPIO_DMAMASK_DOUT3_OFS (3) /* !< DOUT3 Offset */
#define GPIO_DMAMASK_DOUT3_MASK                                                \
  ((uint32_t)0x00000008U) /* !< DMA is allowed to modify DOUT3 */
#define GPIO_DMAMASK_DOUT3_DISABLE                                             \
  ((uint32_t)0x00000000U) /* !< DMA is not allowed to modify this              \
                             bit lane */
#define GPIO_DMAMASK_DOUT3_ENABLE                                              \
  ((uint32_t)0x00000008U) /* !< DMA is allowed to modify this bit              \
                             lane */
/* GPIO_DMAMASK[DOUT4] Bits */
#define GPIO_DMAMASK_DOUT4_OFS (4) /* !< DOUT4 Offset */
#define GPIO_DMAMASK_DOUT4_MASK                                                \
  ((uint32_t)0x00000010U) /* !< DMA is allowed to modify DOUT4 */
#define GPIO_DMAMASK_DOUT4_DISABLE                                             \
  ((uint32_t)0x00000000U) /* !< DMA is not allowed to modify this              \
                             bit lane */
#define GPIO_DMAMASK_DOUT4_ENABLE                                              \
  ((uint32_t)0x00000010U) /* !< DMA is allowed to modify this bit              \
                             lane */
/* GPIO_DMAMASK[DOUT5] Bits */
#define GPIO_DMAMASK_DOUT5_OFS (5) /* !< DOUT5 Offset */
#define GPIO_DMAMASK_DOUT5_MASK                                                \
  ((uint32_t)0x00000020U) /* !< DMA is allowed to modify DOUT5 */
#define GPIO_DMAMASK_DOUT5_DISABLE                                             \
  ((uint32_t)0x00000000U) /* !< DMA is not allowed to modify this              \
                             bit lane */
#define GPIO_DMAMASK_DOUT5_ENABLE                                              \
  ((uint32_t)0x00000020U) /* !< DMA is allowed to modify this bit              \
                             lane */
/* GPIO_DMAMASK[DOUT6] Bits */
#define GPIO_DMAMASK_DOUT6_OFS (6) /* !< DOUT6 Offset */
#define GPIO_DMAMASK_DOUT6_MASK                                                \
  ((uint32_t)0x00000040U) /* !< DMA is allowed to modify DOUT6 */
#define GPIO_DMAMASK_DOUT6_DISABLE                                             \
  ((uint32_t)0x00000000U) /* !< DMA is not allowed to modify this              \
                             bit lane */
#define GPIO_DMAMASK_DOUT6_ENABLE                                              \
  ((uint32_t)0x00000040U) /* !< DMA is allowed to modify this bit              \
                             lane */
/* GPIO_DMAMASK[DOUT7] Bits */
#define GPIO_DMAMASK_DOUT7_OFS (7) /* !< DOUT7 Offset */
#define GPIO_DMAMASK_DOUT7_MASK                                                \
  ((uint32_t)0x00000080U) /* !< DMA is allowed to modify DOUT7 */
#define GPIO_DMAMASK_DOUT7_DISABLE                                             \
  ((uint32_t)0x00000000U) /* !< DMA is not allowed to modify this              \
                             bit lane */
#define GPIO_DMAMASK_DOUT7_ENABLE                                              \
  ((uint32_t)0x00000080U) /* !< DMA is allowed to modify this bit              \
                             lane */
/* GPIO_DMAMASK[DOUT8] Bits */
#define GPIO_DMAMASK_DOUT8_OFS (8) /* !< DOUT8 Offset */
#define GPIO_DMAMASK_DOUT8_MASK                                                \
  ((uint32_t)0x00000100U) /* !< DMA is allowed to modify DOUT8 */
#define GPIO_DMAMASK_DOUT8_DISABLE                                             \
  ((uint32_t)0x00000000U) /* !< DMA is not allowed to modify this              \
                             bit lane */
#define GPIO_DMAMASK_DOUT8_ENABLE                                              \
  ((uint32_t)0x00000100U) /* !< DMA is allowed to modify this bit              \
                             lane */
/* GPIO_DMAMASK[DOUT9] Bits */
#define GPIO_DMAMASK_DOUT9_OFS (9) /* !< DOUT9 Offset */
#define GPIO_DMAMASK_DOUT9_MASK                                                \
  ((uint32_t)0x00000200U) /* !< DMA is allowed to modify DOUT9 */
#define GPIO_DMAMASK_DOUT9_DISABLE                                             \
  ((uint32_t)0x00000000U) /* !< DMA is not allowed to modify this              \
                             bit lane */
#define GPIO_DMAMASK_DOUT9_ENABLE                                              \
  ((uint32_t)0x00000200U) /* !< DMA is allowed to modify this bit              \
                             lane */
/* GPIO_DMAMASK[DOUT10] Bits */
#define GPIO_DMAMASK_DOUT10_OFS (10) /* !< DOUT10 Offset */
#define GPIO_DMAMASK_DOUT10_MASK                                               \
  ((uint32_t)0x00000400U) /* !< DMA is allowed to modify DOUT10 */
#define GPIO_DMAMASK_DOUT10_DISABLE                                            \
  ((uint32_t)0x00000000U) /* !< DMA is not allowed to modify this              \
                             bit lane */
#define GPIO_DMAMASK_DOUT10_ENABLE                                             \
  ((uint32_t)0x00000400U) /* !< DMA is allowed to modify this bit              \
                             lane */
/* GPIO_DMAMASK[DOUT11] Bits */
#define GPIO_DMAMASK_DOUT11_OFS (11) /* !< DOUT11 Offset */
#define GPIO_DMAMASK_DOUT11_MASK                                               \
  ((uint32_t)0x00000800U) /* !< DMA is allowed to modify DOUT11 */
#define GPIO_DMAMASK_DOUT11_DISABLE                                            \
  ((uint32_t)0x00000000U) /* !< DMA is not allowed to modify this              \
                             bit lane */
#define GPIO_DMAMASK_DOUT11_ENABLE                                             \
  ((uint32_t)0x00000800U) /* !< DMA is allowed to modify this bit              \
                             lane */
/* GPIO_DMAMASK[DOUT12] Bits */
#define GPIO_DMAMASK_DOUT12_OFS (12) /* !< DOUT12 Offset */
#define GPIO_DMAMASK_DOUT12_MASK                                               \
  ((uint32_t)0x00001000U) /* !< DMA is allowed to modify DOUT12 */
#define GPIO_DMAMASK_DOUT12_DISABLE                                            \
  ((uint32_t)0x00000000U) /* !< DMA is not allowed to modify this              \
                             bit lane */
#define GPIO_DMAMASK_DOUT12_ENABLE                                             \
  ((uint32_t)0x00001000U) /* !< DMA is allowed to modify this bit              \
                             lane */
/* GPIO_DMAMASK[DOUT13] Bits */
#define GPIO_DMAMASK_DOUT13_OFS (13) /* !< DOUT13 Offset */
#define GPIO_DMAMASK_DOUT13_MASK                                               \
  ((uint32_t)0x00002000U) /* !< DMA is allowed to modify DOUT13 */
#define GPIO_DMAMASK_DOUT13_DISABLE                                            \
  ((uint32_t)0x00000000U) /* !< DMA is not allowed to modify this              \
                             bit lane */
#define GPIO_DMAMASK_DOUT13_ENABLE                                             \
  ((uint32_t)0x00002000U) /* !< DMA is allowed to modify this bit              \
                             lane */
/* GPIO_DMAMASK[DOUT14] Bits */
#define GPIO_DMAMASK_DOUT14_OFS (14) /* !< DOUT14 Offset */
#define GPIO_DMAMASK_DOUT14_MASK                                               \
  ((uint32_t)0x00004000U) /* !< DMA is allowed to modify DOUT14 */
#define GPIO_DMAMASK_DOUT14_DISABLE                                            \
  ((uint32_t)0x00000000U) /* !< DMA is not allowed to modify this              \
                             bit lane */
#define GPIO_DMAMASK_DOUT14_ENABLE                                             \
  ((uint32_t)0x00004000U) /* !< DMA is allowed to modify this bit              \
                             lane */
/* GPIO_DMAMASK[DOUT15] Bits */
#define GPIO_DMAMASK_DOUT15_OFS (15) /* !< DOUT15 Offset */
#define GPIO_DMAMASK_DOUT15_MASK                                               \
  ((uint32_t)0x00008000U) /* !< DMA is allowed to modify DOUT15 */
#define GPIO_DMAMASK_DOUT15_DISABLE                                            \
  ((uint32_t)0x00000000U) /* !< DMA is not allowed to modify this              \
                             bit lane */
#define GPIO_DMAMASK_DOUT15_ENABLE                                             \
  ((uint32_t)0x00008000U) /* !< DMA is allowed to modify this bit              \
                             lane */
/* GPIO_DMAMASK[DOUT16] Bits */
#define GPIO_DMAMASK_DOUT16_OFS (16) /* !< DOUT16 Offset */
#define GPIO_DMAMASK_DOUT16_MASK                                               \
  ((uint32_t)0x00010000U) /* !< DMA is allowed to modify DOUT16 */
#define GPIO_DMAMASK_DOUT16_DISABLE                                            \
  ((uint32_t)0x00000000U) /* !< DMA is not allowed to modify this              \
                             bit lane */
#define GPIO_DMAMASK_DOUT16_ENABLE                                             \
  ((uint32_t)0x00010000U) /* !< DMA is allowed to modify this bit              \
                             lane */
/* GPIO_DMAMASK[DOUT17] Bits */
#define GPIO_DMAMASK_DOUT17_OFS (17) /* !< DOUT17 Offset */
#define GPIO_DMAMASK_DOUT17_MASK                                               \
  ((uint32_t)0x00020000U) /* !< DMA is allowed to modify DOUT17 */
#define GPIO_DMAMASK_DOUT17_DISABLE                                            \
  ((uint32_t)0x00000000U) /* !< DMA is not allowed to modify this              \
                             bit lane */
#define GPIO_DMAMASK_DOUT17_ENABLE                                             \
  ((uint32_t)0x00020000U) /* !< DMA is allowed to modify this bit              \
                             lane */
/* GPIO_DMAMASK[DOUT18] Bits */
#define GPIO_DMAMASK_DOUT18_OFS (18) /* !< DOUT18 Offset */
#define GPIO_DMAMASK_DOUT18_MASK                                               \
  ((uint32_t)0x00040000U) /* !< DMA is allowed to modify DOUT18 */
#define GPIO_DMAMASK_DOUT18_DISABLE                                            \
  ((uint32_t)0x00000000U) /* !< DMA is not allowed to modify this              \
                             bit lane */
#define GPIO_DMAMASK_DOUT18_ENABLE                                             \
  ((uint32_t)0x00040000U) /* !< DMA is allowed to modify this bit              \
                             lane */
/* GPIO_DMAMASK[DOUT19] Bits */
#define GPIO_DMAMASK_DOUT19_OFS (19) /* !< DOUT19 Offset */
#define GPIO_DMAMASK_DOUT19_MASK                                               \
  ((uint32_t)0x00080000U) /* !< DMA is allowed to modify DOUT19 */
#define GPIO_DMAMASK_DOUT19_DISABLE                                            \
  ((uint32_t)0x00000000U) /* !< DMA is not allowed to modify this              \
                             bit lane */
#define GPIO_DMAMASK_DOUT19_ENABLE                                             \
  ((uint32_t)0x00080000U) /* !< DMA is allowed to modify this bit              \
                             lane */
/* GPIO_DMAMASK[DOUT20] Bits */
#define GPIO_DMAMASK_DOUT20_OFS (20) /* !< DOUT20 Offset */
#define GPIO_DMAMASK_DOUT20_MASK                                               \
  ((uint32_t)0x00100000U) /* !< DMA is allowed to modify DOUT20 */
#define GPIO_DMAMASK_DOUT20_DISABLE                                            \
  ((uint32_t)0x00000000U) /* !< DMA is not allowed to modify this              \
                             bit lane */
#define GPIO_DMAMASK_DOUT20_ENABLE                                             \
  ((uint32_t)0x00100000U) /* !< DMA is allowed to modify this bit              \
                             lane */
/* GPIO_DMAMASK[DOUT21] Bits */
#define GPIO_DMAMASK_DOUT21_OFS (21) /* !< DOUT21 Offset */
#define GPIO_DMAMASK_DOUT21_MASK                                               \
  ((uint32_t)0x00200000U) /* !< DMA is allowed to modify DOUT21 */
#define GPIO_DMAMASK_DOUT21_DISABLE                                            \
  ((uint32_t)0x00000000U) /* !< DMA is not allowed to modify this              \
                             bit lane */
#define GPIO_DMAMASK_DOUT21_ENABLE                                             \
  ((uint32_t)0x00200000U) /* !< DMA is allowed to modify this bit              \
                             lane */
/* GPIO_DMAMASK[DOUT22] Bits */
#define GPIO_DMAMASK_DOUT22_OFS (22) /* !< DOUT22 Offset */
#define GPIO_DMAMASK_DOUT22_MASK                                               \
  ((uint32_t)0x00400000U) /* !< DMA is allowed to modify DOUT22 */
#define GPIO_DMAMASK_DOUT22_DISABLE                                            \
  ((uint32_t)0x00000000U) /* !< DMA is not allowed to modify this              \
                             bit lane */
#define GPIO_DMAMASK_DOUT22_ENABLE                                             \
  ((uint32_t)0x00400000U) /* !< DMA is allowed to modify this bit              \
                             lane */
/* GPIO_DMAMASK[DOUT23] Bits */
#define GPIO_DMAMASK_DOUT23_OFS (23) /* !< DOUT23 Offset */
#define GPIO_DMAMASK_DOUT23_MASK                                               \
  ((uint32_t)0x00800000U) /* !< DMA is allowed to modify DOUT23 */
#define GPIO_DMAMASK_DOUT23_DISABLE                                            \
  ((uint32_t)0x00000000U) /* !< DMA is not allowed to modify this              \
                             bit lane */
#define GPIO_DMAMASK_DOUT23_ENABLE                                             \
  ((uint32_t)0x00800000U) /* !< DMA is allowed to modify this bit              \
                             lane */
/* GPIO_DMAMASK[DOUT24] Bits */
#define GPIO_DMAMASK_DOUT24_OFS (24) /* !< DOUT24 Offset */
#define GPIO_DMAMASK_DOUT24_MASK                                               \
  ((uint32_t)0x01000000U) /* !< DMA is allowed to modify DOUT24 */
#define GPIO_DMAMASK_DOUT24_DISABLE                                            \
  ((uint32_t)0x00000000U) /* !< DMA is not allowed to modify this              \
                             bit lane */
#define GPIO_DMAMASK_DOUT24_ENABLE                                             \
  ((uint32_t)0x01000000U) /* !< DMA is allowed to modify this bit              \
                             lane */
/* GPIO_DMAMASK[DOUT25] Bits */
#define GPIO_DMAMASK_DOUT25_OFS (25) /* !< DOUT25 Offset */
#define GPIO_DMAMASK_DOUT25_MASK                                               \
  ((uint32_t)0x02000000U) /* !< DMA is allowed to modify DOUT25 */
#define GPIO_DMAMASK_DOUT25_DISABLE                                            \
  ((uint32_t)0x00000000U) /* !< DMA is not allowed to modify this              \
                             bit lane */
#define GPIO_DMAMASK_DOUT25_ENABLE                                             \
  ((uint32_t)0x02000000U) /* !< DMA is allowed to modify this bit              \
                             lane */
/* GPIO_DMAMASK[DOUT26] Bits */
#define GPIO_DMAMASK_DOUT26_OFS (26) /* !< DOUT26 Offset */
#define GPIO_DMAMASK_DOUT26_MASK                                               \
  ((uint32_t)0x04000000U) /* !< DMA is allowed to modify DOUT26 */
#define GPIO_DMAMASK_DOUT26_DISABLE                                            \
  ((uint32_t)0x00000000U) /* !< DMA is not allowed to modify this              \
                             bit lane */
#define GPIO_DMAMASK_DOUT26_ENABLE                                             \
  ((uint32_t)0x04000000U) /* !< DMA is allowed to modify this bit              \
                             lane */
/* GPIO_DMAMASK[DOUT27] Bits */
#define GPIO_DMAMASK_DOUT27_OFS (27) /* !< DOUT27 Offset */
#define GPIO_DMAMASK_DOUT27_MASK                                               \
  ((uint32_t)0x08000000U) /* !< DMA is allowed to modify DOUT27 */
#define GPIO_DMAMASK_DOUT27_DISABLE                                            \
  ((uint32_t)0x00000000U) /* !< DMA is not allowed to modify this              \
                             bit lane */
#define GPIO_DMAMASK_DOUT27_ENABLE                                             \
  ((uint32_t)0x08000000U) /* !< DMA is allowed to modify this bit              \
                             lane */
/* GPIO_DMAMASK[DOUT28] Bits */
#define GPIO_DMAMASK_DOUT28_OFS (28) /* !< DOUT28 Offset */
#define GPIO_DMAMASK_DOUT28_MASK                                               \
  ((uint32_t)0x10000000U) /* !< DMA is allowed to modify DOUT28 */
#define GPIO_DMAMASK_DOUT28_DISABLE                                            \
  ((uint32_t)0x00000000U) /* !< DMA is not allowed to modify this              \
                             bit lane */
#define GPIO_DMAMASK_DOUT28_ENABLE                                             \
  ((uint32_t)0x10000000U) /* !< DMA is allowed to modify this bit              \
                             lane */
/* GPIO_DMAMASK[DOUT29] Bits */
#define GPIO_DMAMASK_DOUT29_OFS (29) /* !< DOUT29 Offset */
#define GPIO_DMAMASK_DOUT29_MASK                                               \
  ((uint32_t)0x20000000U) /* !< DMA is allowed to modify DOUT29 */
#define GPIO_DMAMASK_DOUT29_DISABLE                                            \
  ((uint32_t)0x00000000U) /* !< DMA is not allowed to modify this              \
                             bit lane */
#define GPIO_DMAMASK_DOUT29_ENABLE                                             \
  ((uint32_t)0x20000000U) /* !< DMA is allowed to modify this bit              \
                             lane */
/* GPIO_DMAMASK[DOUT30] Bits */
#define GPIO_DMAMASK_DOUT30_OFS (30) /* !< DOUT30 Offset */
#define GPIO_DMAMASK_DOUT30_MASK                                               \
  ((uint32_t)0x40000000U) /* !< DMA is allowed to modify DOUT30 */
#define GPIO_DMAMASK_DOUT30_DISABLE                                            \
  ((uint32_t)0x00000000U) /* !< DMA is not allowed to modify this              \
                             bit lane */
#define GPIO_DMAMASK_DOUT30_ENABLE                                             \
  ((uint32_t)0x40000000U) /* !< DMA is allowed to modify this bit              \
                             lane */
/* GPIO_DMAMASK[DOUT31] Bits */
#define GPIO_DMAMASK_DOUT31_OFS (31) /* !< DOUT31 Offset */
#define GPIO_DMAMASK_DOUT31_MASK                                               \
  ((uint32_t)0x80000000U) /* !< DMA is allowed to modify DOUT31 */
#define GPIO_DMAMASK_DOUT31_DISABLE                                            \
  ((uint32_t)0x00000000U) /* !< DMA is not allowed to modify this              \
                             bit lane */
#define GPIO_DMAMASK_DOUT31_ENABLE                                             \
  ((uint32_t)0x80000000U) /* !< DMA is allowed to modify this bit              \
                             lane */

/* GPIO_SUB1CFG Bits */
/* GPIO_SUB1CFG[ENABLE] Bits */
#define GPIO_SUB1CFG_ENABLE_OFS (0) /* !< ENABLE Offset */
#define GPIO_SUB1CFG_ENABLE_MASK                                               \
  ((uint32_t)0x00000001U) /* !< This bit is used to enable                     \
                             subscriber 1 event. */
#define GPIO_SUB1CFG_ENABLE_CLR                                                \
  ((uint32_t)0x00000000U) /* !< Subscriber 1 event is disabled */
#define GPIO_SUB1CFG_ENABLE_SET                                                \
  ((uint32_t)0x00000001U) /* !< Subscriber 1 event is enabled */
/* GPIO_SUB1CFG[OUTPOLICY] Bits */
#define GPIO_SUB1CFG_OUTPOLICY_OFS (8) /* !< OUTPOLICY Offset */
#define GPIO_SUB1CFG_OUTPOLICY_MASK                                            \
  ((uint32_t)0x00000300U) /* !< These bits configure the output                \
                             policy for subscriber 1 event. */
#define GPIO_SUB1CFG_OUTPOLICY_SET                                             \
  ((uint32_t)0x00000000U) /* !< Selected DIO pins are set */
#define GPIO_SUB1CFG_OUTPOLICY_CLR                                             \
  ((uint32_t)0x00000100U) /* !< Selected DIO pins are cleared */
#define GPIO_SUB1CFG_OUTPOLICY_TOGGLE                                          \
  ((uint32_t)0x00000200U) /* !< Selected DIO pins are toggled */
/* GPIO_SUB1CFG[INDEX] Bits */
#define GPIO_SUB1CFG_INDEX_OFS (16) /* !< INDEX Offset */
#define GPIO_SUB1CFG_INDEX_MASK                                                \
  ((uint32_t)0x000F0000U) /* !< indicates the specific bit in the              \
                             upper 16 bits that is targeted by the             \
                             subscriber action */
#define GPIO_SUB1CFG_INDEX_MIN                                                 \
  ((uint32_t)0x00000000U) /* !< specific bit targeted by the                   \
                             subscriber action is bit16 */
#define GPIO_SUB1CFG_INDEX_MAX                                                 \
  ((uint32_t)0x000F0000U) /* !< specific bit targeted by the                   \
                             subscriber action is bit31 */

#ifdef __cplusplus
}
#endif

#endif /* ti_devices_msp_peripherals_hw_gpio__include */
